Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x32b2d (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  8
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_name        : go	
    <f>   DW_AT_language    : 22	(Go)
    <10>   DW_AT_low_pc      : 0x400c00	
    <18>   DW_AT_high_pc     : 0x486271	
    <20>   DW_AT_stmt_list   : 0x0	
 <1><24>: Abbrev Number: 2 (DW_TAG_subprogram)
    <25>   DW_AT_name        : main.main	
    <2f>   DW_AT_low_pc      : 0x400c00	
    <37>   DW_AT_high_pc     : 0x400e90	
    <3f>   DW_AT_external    : 1	
 <2><40>: Abbrev Number: 4 (DW_TAG_variable)
    <41>   DW_AT_name        : foo	
    <45>   DW_AT_location    : 5 byte block: 9c 11 80 7e 22 	(DW_OP_call_frame_cfa; DW_OP_consts: -256; DW_OP_plus)
    <4b>   DW_AT_type        : <0x271fd>	
 <2><53>: Abbrev Number: 4 (DW_TAG_variable)
    <54>   DW_AT_name        : arr	
    <58>   DW_AT_location    : 5 byte block: 9c 11 a0 7e 22 	(DW_OP_call_frame_cfa; DW_OP_consts: -224; DW_OP_plus)
    <5e>   DW_AT_type        : <0x2a182>	
 <2><66>: Abbrev Number: 4 (DW_TAG_variable)
    <67>   DW_AT_name        : bar	
    <6b>   DW_AT_location    : 5 byte block: 9c 11 b0 7e 22 	(DW_OP_call_frame_cfa; DW_OP_consts: -208; DW_OP_plus)
    <71>   DW_AT_type        : <0x264da>	
 <2><79>: Abbrev Number: 4 (DW_TAG_variable)
    <7a>   DW_AT_name        : sl	

    <260cc>   DW_AT_type        : <0x271fd>	
 <2><260d4>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <260d5>   DW_AT_name        : h	
    <260d7>   DW_AT_location    : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <260d9>   DW_AT_type        : <0x27685>	
 <2><260e1>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <260e2>   DW_AT_name        : s	
    <260e4>   DW_AT_location    : 4 byte block: 9c 11 8 22 	(DW_OP_call_frame_cfa; DW_OP_consts: 8; DW_OP_plus)
    <260e9>   DW_AT_type        : <0x26399>	
 <2><260f1>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <260f2>   DW_AT_name        : p	
    <260f4>   DW_AT_location    : 4 byte block: 9c 11 10 22 	(DW_OP_call_frame_cfa; DW_OP_consts: 16; DW_OP_plus)
    <260f9>   DW_AT_type        : <0x2d091>	
 <2><26101>: Abbrev Number: 0
 <1><26102>: Abbrev Number: 2 (DW_TAG_subprogram)
    <26103>   DW_AT_name        : type..eq.[8]struct { a string; b float64 }	
    <2612e>   DW_AT_low_pc      : 0x486060	
    <26136>   DW_AT_high_pc     : 0x4861a0	
    <2613e>   DW_AT_external    : 1	
 <2><2613f>: Abbrev Number: 4 (DW_TAG_variable)
    <26140>   DW_AT_name        : i	
    <26142>   DW_AT_location    : 5 byte block: 9c 11 b0 7f 22 	(DW_OP_call_frame_cfa; DW_OP_consts: -80; DW_OP_plus)
    <26148>   DW_AT_type        : <0x271fd>	
 <2><26150>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <26151>   DW_AT_name        : eq	
    <26154>   DW_AT_location    : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <26156>   DW_AT_type        : <0x28607>	
 <2><2615e>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <2615f>   DW_AT_name        : s	
    <26161>   DW_AT_location    : 4 byte block: 9c 11 8 22 	(DW_OP_call_frame_cfa; DW_OP_consts: 8; DW_OP_plus)
    <26166>   DW_AT_type        : <0x26399>	
 <2><2616e>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <2616f>   DW_AT_name        : p	
    <26171>   DW_AT_location    : 4 byte block: 9c 11 10 22 	(DW_OP_call_frame_cfa; DW_OP_consts: 16; DW_OP_plus)
    <26176>   DW_AT_type        : <0x2d091>	
 <2><2617e>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <2617f>   DW_AT_name        : q	
    <26181>   DW_AT_location    : 4 byte block: 9c 11 18 22 	(DW_OP_call_frame_cfa; DW_OP_consts: 24; DW_OP_plus)
    <26186>   DW_AT_type        : <0x2d091>	
 <2><2618e>: Abbrev Number: 0
 <1><2618f>: Abbrev Number: 2 (DW_TAG_subprogram)
    <26190>   DW_AT_name        : sync/atomic.CompareAndSwapInt32	
    <261b0>   DW_AT_low_pc      : 0x4861a0	
    <261b8>   DW_AT_high_pc     : 0x4861b0	
    <261c0>   DW_AT_external    : 1	
 <2><261c1>: Abbrev Number: 0
 <1><261c2>: Abbrev Number: 2 (DW_TAG_subprogram)
    <261c3>   DW_AT_name        : sync/atomic.CompareAndSwapUint32	
    <261e4>   DW_AT_low_pc      : 0x4861b0	
    <261ec>   DW_AT_high_pc     : 0x4861d0	
    <261f4>   DW_AT_external    : 1	
 <2><261f5>: Abbrev Number: 0
 <1><261f6>: Abbrev Number: 2 (DW_TAG_subprogram)
    <261f7>   DW_AT_name        : sync/atomic.AddInt32	
    <2620c>   DW_AT_low_pc      : 0x4861d0	
    <26214>   DW_AT_high_pc     : 0x4861e0	
    <2621c>   DW_AT_external    : 1	
 <2><2621d>: Abbrev Number: 0
 <1><2621e>: Abbrev Number: 2 (DW_TAG_subprogram)
    <2621f>   DW_AT_name        : sync/atomic.AddUint32	
    <26235>   DW_AT_low_pc      : 0x4861e0	
    <2623d>   DW_AT_high_pc     : 0x486200	
    <26245>   DW_AT_external    : 1	
 <2><26246>: Abbrev Number: 0
 <1><26247>: Abbrev Number: 2 (DW_TAG_subprogram)
    <26248>   DW_AT_name        : sync/atomic.LoadUint32	
    <2625f>   DW_AT_low_pc      : 0x486200	
    <26267>   DW_AT_high_pc     : 0x486210	
    <2626f>   DW_AT_external    : 1	
 <2><26270>: Abbrev Number: 0
 <1><26271>: Abbrev Number: 2 (DW_TAG_subprogram)
    <26272>   DW_AT_name        : sync/atomic.LoadUintptr	
    <2628a>   DW_AT_low_pc      : 0x486210	
    <26292>   DW_AT_high_pc     : 0x486220	
    <2629a>   DW_AT_external    : 1	
 <2><2629b>: Abbrev Number: 0
 <1><2629c>: Abbrev Number: 2 (DW_TAG_subprogram)
    <2629d>   DW_AT_name        : sync/atomic.LoadPointer	
    <262b5>   DW_AT_low_pc      : 0x486220	
    <262bd>   DW_AT_high_pc     : 0x486230	
    <262c5>   DW_AT_external    : 1	
 <2><262c6>: Abbrev Number: 0
 <1><262c7>: Abbrev Number: 2 (DW_TAG_subprogram)
    <262c8>   DW_AT_name        : sync/atomic.StoreInt32	
    <262df>   DW_AT_low_pc      : 0x486230	
    <262e7>   DW_AT_high_pc     : 0x486240	
    <262ef>   DW_AT_external    : 1	
 <2><262f0>: Abbrev Number: 0
 <1><262f1>: Abbrev Number: 2 (DW_TAG_subprogram)
    <262f2>   DW_AT_name        : sync/atomic.StoreUint32	
    <2630a>   DW_AT_low_pc      : 0x486240	
    <26312>   DW_AT_high_pc     : 0x486250	
    <2631a>   DW_AT_external    : 1	
 <2><2631b>: Abbrev Number: 0
 <1><2631c>: Abbrev Number: 2 (DW_TAG_subprogram)
    <2631d>   DW_AT_name        : sync/atomic.StoreUintptr	
    <26336>   DW_AT_low_pc      : 0x486250	
    <2633e>   DW_AT_high_pc     : 0x486260	
    <26346>   DW_AT_external    : 1	
 <2><26347>: Abbrev Number: 0
 <1><26348>: Abbrev Number: 2 (DW_TAG_subprogram)
    <26349>   DW_AT_name        : sync/atomic.StorePointer	
    <26362>   DW_AT_low_pc      : 0x486260	
    <2636a>   DW_AT_high_pc     : 0x486270	
    <26372>   DW_AT_external    : 1	
 <2><26373>: Abbrev Number: 0
 <1><26374>: Abbrev Number: 10 (DW_TAG_unspecified_type)
    <26375>   DW_AT_name        : <unspecified>	
 <1><26383>: Abbrev Number: 10 (DW_TAG_unspecified_type)
    <26384>   DW_AT_name        : void	
 <1><26389>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <2638a>   DW_AT_name        : unsafe.Pointer	
 <1><26399>: Abbrev Number: 11 (DW_TAG_base_type)
    <2639a>   DW_AT_name        : uintptr	
    <263a2>   DW_AT_encoding    : 7	(unsigned)
    <263a3>   DW_AT_byte_size   : 8	
    <263a4>   Unknown AT value: 2900: 12	
 <1><263a5>: Abbrev Number: 21 (DW_TAG_structure_type)
    <263a6>   DW_AT_name        : runtime.rtype	
    <263b4>   DW_AT_byte_size   : 64	
    <263b5>   Unknown AT value: 2900: 25	
 <2><263b6>: Abbrev Number: 6 (DW_TAG_member)
    <263b7>   DW_AT_name        : size	
    <263bc>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <263bf>   DW_AT_type        : <0x26399>	
 <2><263c7>: Abbrev Number: 6 (DW_TAG_member)
    <263c8>   DW_AT_name        : hash	
    <263cd>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
    <263d0>   DW_AT_type        : <0x264b3>	
 <2><263d8>: Abbrev Number: 6 (DW_TAG_member)
    <263d9>   DW_AT_name        : _	
    <263db>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
    <263de>   DW_AT_type        : <0x264be>	
 <2><263e6>: Abbrev Number: 6 (DW_TAG_member)
    <263e7>   DW_AT_name        : align	
    <263ed>   DW_AT_data_member_location: 2 byte block: 23 d 	(DW_OP_plus_uconst: 13)
    <263f0>   DW_AT_type        : <0x264be>	
 <2><263f8>: Abbrev Number: 6 (DW_TAG_member)
    <263f9>   DW_AT_name        : fieldAlign	
    <26404>   DW_AT_data_member_location: 2 byte block: 23 e 	(DW_OP_plus_uconst: 14)
    <26407>   DW_AT_type        : <0x264be>	
 <2><2640f>: Abbrev Number: 6 (DW_TAG_member)
    <26410>   DW_AT_name        : kind	
    <26415>   DW_AT_data_member_location: 2 byte block: 23 f 	(DW_OP_plus_uconst: 15)
    <26418>   DW_AT_type        : <0x264be>	
 <2><26420>: Abbrev Number: 6 (DW_TAG_member)
    <26421>   DW_AT_name        : alg	
    <26425>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
    <26428>   DW_AT_type        : <0x26389>	
 <2><26430>: Abbrev Number: 6 (DW_TAG_member)
    <26431>   DW_AT_name        : gc	
    <26434>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
    <26437>   DW_AT_type        : <0x26389>	
 <2><2643f>: Abbrev Number: 6 (DW_TAG_member)
    <26440>   DW_AT_name        : string	
    <26447>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
    <2644a>   DW_AT_type        : <0x264c8>	
 <2><26452>: Abbrev Number: 6 (DW_TAG_member)
    <26453>   DW_AT_name        : *runtime.uncommonType	
    <26469>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
    <2646c>   DW_AT_type        : <0x26505>	
 <2><26474>: Abbrev Number: 6 (DW_TAG_member)
    <26475>   DW_AT_name        : ptrToThis	
    <2647f>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
    <26482>   DW_AT_type        : <0x26678>	
 <2><2648a>: Abbrev Number: 6 (DW_TAG_member)
    <2648b>   DW_AT_name        : zero	
    <26490>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
    <26493>   DW_AT_type        : <0x26389>	
 <2><2649b>: Abbrev Number: 0
 <1><2649c>: Abbrev Number: 22 (DW_TAG_typedef)
    <2649d>   DW_AT_name        : runtime.rtype	
    <264ab>   DW_AT_type        : <0x263a5>	
 <1><264b3>: Abbrev Number: 11 (DW_TAG_base_type)
    <264b4>   DW_AT_name        : uint32	
    <264bb>   DW_AT_encoding    : 7	(unsigned)
    <264bc>   DW_AT_byte_size   : 4	
    <264bd>   Unknown AT value: 2900: 10	
 <1><264be>: Abbrev Number: 11 (DW_TAG_base_type)
    <264bf>   DW_AT_name        : uint8	
    <264c5>   DW_AT_encoding    : 7	(unsigned)
    <264c6>   DW_AT_byte_size   : 1	
    <264c7>   Unknown AT value: 2900: 8	
 <1><264c8>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <264c9>   DW_AT_name        : *string	
    <264d1>   DW_AT_type        : <0x264da>	
    <264d9>   Unknown AT value: 2900: 22	
 <1><264da>: Abbrev Number: 20 (DW_TAG_structure_type)
    <264db>   DW_AT_name        : string	
    <264e2>   DW_AT_byte_size   : 16	
    <264e3>   Unknown AT value: 2900: 24	
 <2><264e4>: Abbrev Number: 6 (DW_TAG_member)
    <264e5>   DW_AT_name        : str	
    <264e9>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <264ec>   DW_AT_type        : <0x26b78>	
 <2><264f4>: Abbrev Number: 6 (DW_TAG_member)
    <264f5>   DW_AT_name        : len	
    <264f9>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
    <264fc>   DW_AT_type        : <0x2709d>	
 <2><26504>: Abbrev Number: 0
 <1><26505>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <26506>   DW_AT_name        : *runtime.uncommonType	
    <2651c>   DW_AT_type        : <0x26525>	
    <26524>   Unknown AT value: 2900: 22	
 <1><26525>: Abbrev Number: 21 (DW_TAG_structure_type)
    <26526>   DW_AT_name        : runtime.uncommonType	
    <2653b>   DW_AT_byte_size   : 40	
    <2653c>   Unknown AT value: 2900: 25	
 <2><2653d>: Abbrev Number: 6 (DW_TAG_member)
    <2653e>   DW_AT_name        : name	
    <26543>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <26546>   DW_AT_type        : <0x264c8>	
 <2><2654e>: Abbrev Number: 6 (DW_TAG_member)
    <2654f>   DW_AT_name        : pkgPath	
    <26557>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
    <2655a>   DW_AT_type        : <0x264c8>	
 <2><26562>: Abbrev Number: 6 (DW_TAG_member)
    <26563>   DW_AT_name        : methods	
    <2656b>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
    <2656e>   DW_AT_type        : <0x26595>	
 <2><26576>: Abbrev Number: 0
 <1><26577>: Abbrev Number: 22 (DW_TAG_typedef)
    <26578>   DW_AT_name        : runtime.uncommonType	
    <2658d>   DW_AT_type        : <0x26525>	
 <1><26595>: Abbrev Number: 19 (DW_TAG_structure_type)
    <26596>   DW_AT_name        : []runtime._method	
    <265a8>   DW_AT_byte_size   : 24	
    <265a9>   Unknown AT value: 2900: 23	
    <265aa>   Unknown AT value: 2902: <0x265e5>	
 <2><265b2>: Abbrev Number: 6 (DW_TAG_member)
    <265b3>   DW_AT_name        : array	
    <265b9>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <265bc>   DW_AT_type        : <0x2d1ad>	
 <2><265c4>: Abbrev Number: 6 (DW_TAG_member)
    <265c5>   DW_AT_name        : len	
    <265c9>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
    <265cc>   DW_AT_type        : <0x269cc>	
 <2><265d4>: Abbrev Number: 6 (DW_TAG_member)
    <265d5>   DW_AT_name        : cap	
    <265d9>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
    <265dc>   DW_AT_type        : <0x269cc>	
 <2><265e4>: Abbrev Number: 0
 <1><265e5>: Abbrev Number: 21 (DW_TAG_structure_type)
    <265e6>   DW_AT_name        : runtime._method	
    <265f6>   DW_AT_byte_size   : 48	
    <265f7>   Unknown AT value: 2900: 25	
 <2><265f8>: Abbrev Number: 6 (DW_TAG_member)
    <265f9>   DW_AT_name        : name	
    <265fe>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <26601>   DW_AT_type        : <0x264c8>	
 <2><26609>: Abbrev Number: 6 (DW_TAG_member)
    <2660a>   DW_AT_name        : pkgPath	
    <26612>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
    <26615>   DW_AT_type        : <0x264c8>	
 <2><2661d>: Abbrev Number: 6 (DW_TAG_member)
    <2661e>   DW_AT_name        : mtyp	
    <26623>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
    <26626>   DW_AT_type        : <0x26678>	
 <2><2662e>: Abbrev Number: 6 (DW_TAG_member)
    <2662f>   DW_AT_name        : typ	
    <26633>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
    <26636>   DW_AT_type        : <0x26678>	
 <2><2663e>: Abbrev Number: 6 (DW_TAG_member)
    <2663f>   DW_AT_name        : ifn	
    <26643>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
    <26646>   DW_AT_type        : <0x26389>	
 <2><2664e>: Abbrev Number: 6 (DW_TAG_member)
    <2664f>   DW_AT_name        : tfn	
    <26653>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
    <26656>   DW_AT_type        : <0x26389>	
 <2><2665e>: Abbrev Number: 0
 <1><2665f>: Abbrev Number: 22 (DW_TAG_typedef)
    <26660>   DW_AT_name        : runtime._method	
    <26670>   DW_AT_type        : <0x265e5>	
 <1><26678>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <26679>   DW_AT_name        : *runtime.rtype	
    <26688>   DW_AT_type        : <0x2649c>	
    <26690>   Unknown AT value: 2900: 22	
 <1><26691>: Abbrev Number: 21 (DW_TAG_structure_type)
    <26692>   DW_AT_name        : runtime.interfaceType	
    <266a8>   DW_AT_byte_size   : 88	
    <266a9>   Unknown AT value: 2900: 25	
 <2><266aa>: Abbrev Number: 6 (DW_TAG_member)
    <266ab>   DW_AT_name        : runtime.rtype	
    <266b9>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <266bc>   DW_AT_type        : <0x2649c>	
 <2><266c4>: Abbrev Number: 6 (DW_TAG_member)
    <266c5>   DW_AT_name        : methods	
    <266cd>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
    <266d0>   DW_AT_type        : <0x266f8>	
 <2><266d8>: Abbrev Number: 0
 <1><266d9>: Abbrev Number: 22 (DW_TAG_typedef)
    <266da>   DW_AT_name        : runtime.interfaceType	
    <266f0>   DW_AT_type        : <0x26691>	
 <1><266f8>: Abbrev Number: 19 (DW_TAG_structure_type)
    <266f9>   DW_AT_name        : []runtime._imethod	
    <2670c>   DW_AT_byte_size   : 24	
    <2670d>   Unknown AT value: 2900: 23	
    <2670e>   Unknown AT value: 2902: <0x26749>	
 <2><26716>: Abbrev Number: 6 (DW_TAG_member)
    <26717>   DW_AT_name        : array	
    <2671d>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <26720>   DW_AT_type        : <0x2d191>	
 <2><26728>: Abbrev Number: 6 (DW_TAG_member)
    <26729>   DW_AT_name        : len	
    <2672d>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
    <26730>   DW_AT_type        : <0x269cc>	
 <2><26738>: Abbrev Number: 6 (DW_TAG_member)
    <26739>   DW_AT_name        : cap	
    <2673d>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
    <26740>   DW_AT_type        : <0x269cc>	
 <2><26748>: Abbrev Number: 0
 <1><26749>: Abbrev Number: 21 (DW_TAG_structure_type)
    <2674a>   DW_AT_name        : runtime._imethod	
    <2675b>   DW_AT_byte_size   : 24	
    <2675c>   Unknown AT value: 2900: 25	
 <2><2675d>: Abbrev Number: 6 (DW_TAG_member)
    <2675e>   DW_AT_name        : name	
    <26763>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <26766>   DW_AT_type        : <0x264c8>	
 <2><2676e>: Abbrev Number: 6 (DW_TAG_member)
    <2676f>   DW_AT_name        : pkgPath	
    <26777>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
    <2677a>   DW_AT_type        : <0x264c8>	
 <2><26782>: Abbrev Number: 6 (DW_TAG_member)
    <26783>   DW_AT_name        : typ	
    <26787>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
    <2678a>   DW_AT_type        : <0x26678>	
 <2><26792>: Abbrev Number: 0
 <1><26793>: Abbrev Number: 22 (DW_TAG_typedef)
    <26794>   DW_AT_name        : runtime._imethod	
    <267a5>   DW_AT_type        : <0x26749>	
 <1><267ad>: Abbrev Number: 21 (DW_TAG_structure_type)
    <267ae>   DW_AT_name        : runtime.itab	
    <267bb>   DW_AT_byte_size   : 32	
    <267bc>   Unknown AT value: 2900: 25	
 <2><267bd>: Abbrev Number: 6 (DW_TAG_member)
    <267be>   DW_AT_name        : inter	
    <267c4>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <267c7>   DW_AT_type        : <0x2683c>	
 <2><267cf>: Abbrev Number: 6 (DW_TAG_member)
    <267d0>   DW_AT_name        : _type	
    <267d6>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
    <267d9>   DW_AT_type        : <0x26dfc>	
 <2><267e1>: Abbrev Number: 6 (DW_TAG_member)
    <267e2>   DW_AT_name        : link	
    <267e7>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
    <267ea>   DW_AT_type        : <0x26ebc>	
 <2><267f2>: Abbrev Number: 6 (DW_TAG_member)
    <267f3>   DW_AT_name        : bad	
    <267f7>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
    <267fa>   DW_AT_type        : <0x26ed4>	
 <2><26802>: Abbrev Number: 6 (DW_TAG_member)
    <26803>   DW_AT_name        : unused	
    <2680a>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
    <2680d>   DW_AT_type        : <0x26ed4>	
 <2><26815>: Abbrev Number: 6 (DW_TAG_member)
    <26816>   DW_AT_name        : fun	
    <2681a>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
    <2681d>   DW_AT_type        : <0x26ede>	
 <2><26825>: Abbrev Number: 0
 <1><26826>: Abbrev Number: 22 (DW_TAG_typedef)
    <26827>   DW_AT_name        : runtime.itab	
    <26834>   DW_AT_type        : <0x267ad>	
 <1><2683c>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <2683d>   DW_AT_name        : *runtime.interfacetype	
    <26854>   DW_AT_type        : <0x2685d>	
    <2685c>   Unknown AT value: 2900: 22	
 <1><2685d>: Abbrev Number: 21 (DW_TAG_structure_type)
    <2685e>   DW_AT_name        : runtime.interfacetype	
    <26874>   DW_AT_byte_size   : 88	
    <26875>   Unknown AT value: 2900: 25	
 <2><26876>: Abbrev Number: 6 (DW_TAG_member)
    <26877>   DW_AT_name        : runtime._type	
    <26885>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <26888>   DW_AT_type        : <0x268cf>	
 <2><26890>: Abbrev Number: 6 (DW_TAG_member)
    <26891>   DW_AT_name        : mhdr	
    <26896>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
    <26899>   DW_AT_type        : <0x26cfd>	
 <2><268a1>: Abbrev Number: 6 (DW_TAG_member)
    <268a2>   DW_AT_name        : m	
    <268a4>   DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
    <268a7>   DW_AT_type        : <0x26e2f>	
 <2><268af>: Abbrev Number: 0
 <1><268b0>: Abbrev Number: 22 (DW_TAG_typedef)
    <268b1>   DW_AT_name        : runtime.interfacetype	
    <268c7>   DW_AT_type        : <0x2685d>	
 <1><268cf>: Abbrev Number: 21 (DW_TAG_structure_type)
    <268d0>   DW_AT_name        : runtime._type	
    <268de>   DW_AT_byte_size   : 64	
    <268df>   Unknown AT value: 2900: 25	
 <2><268e0>: Abbrev Number: 6 (DW_TAG_member)
    <268e1>   DW_AT_name        : size	
    <268e6>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <268e9>   DW_AT_type        : <0x269cc>	
 <2><268f1>: Abbrev Number: 6 (DW_TAG_member)
    <268f2>   DW_AT_name        : hash	
    <268f7>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
    <268fa>   DW_AT_type        : <0x264b3>	
 <2><26902>: Abbrev Number: 6 (DW_TAG_member)
    <26903>   DW_AT_name        : _unused	
    <2690b>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
    <2690e>   DW_AT_type        : <0x264be>	
 <2><26916>: Abbrev Number: 6 (DW_TAG_member)
    <26917>   DW_AT_name        : align	
    <2691d>   DW_AT_data_member_location: 2 byte block: 23 d 	(DW_OP_plus_uconst: 13)
    <26920>   DW_AT_type        : <0x264be>	
 <2><26928>: Abbrev Number: 6 (DW_TAG_member)
    <26929>   DW_AT_name        : fieldalign	
    <26934>   DW_AT_data_member_location: 2 byte block: 23 e 	(DW_OP_plus_uconst: 14)
    <26937>   DW_AT_type        : <0x264be>	
 <2><2693f>: Abbrev Number: 6 (DW_TAG_member)
    <26940>   DW_AT_name        : kind	
    <26945>   DW_AT_data_member_location: 2 byte block: 23 f 	(DW_OP_plus_uconst: 15)
    <26948>   DW_AT_type        : <0x264be>	
 <2><26950>: Abbrev Number: 6 (DW_TAG_member)
    <26951>   DW_AT_name        : alg	
    <26955>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
    <26958>   DW_AT_type        : <0x269d7>	
 <2><26960>: Abbrev Number: 6 (DW_TAG_member)
    <26961>   DW_AT_name        : gc	
    <26964>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
    <26967>   DW_AT_type        : <0x26389>	
 <2><2696f>: Abbrev Number: 6 (DW_TAG_member)
    <26970>   DW_AT_name        : _string	
    <26978>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
    <2697b>   DW_AT_type        : <0x264c8>	
 <2><26983>: Abbrev Number: 6 (DW_TAG_member)
    <26984>   DW_AT_name        : x	
    <26986>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
    <26989>   DW_AT_type        : <0x26c62>	
 <2><26991>: Abbrev Number: 6 (DW_TAG_member)
    <26992>   DW_AT_name        : ptrto	
    <26998>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
    <2699b>   DW_AT_type        : <0x26dfc>	
 <2><269a3>: Abbrev Number: 6 (DW_TAG_member)
    <269a4>   DW_AT_name        : zero	
    <269a9>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
    <269ac>   DW_AT_type        : <0x26b78>	
 <2><269b4>: Abbrev Number: 0
 <1><269b5>: Abbrev Number: 22 (DW_TAG_typedef)
    <269b6>   DW_AT_name        : runtime._type	
    <269c4>   DW_AT_type        : <0x268cf>	
 <1><269cc>: Abbrev Number: 11 (DW_TAG_base_type)
    <269cd>   DW_AT_name        : uint64	
    <269d4>   DW_AT_encoding    : 7	(unsigned)
    <269d5>   DW_AT_byte_size   : 8	
    <269d6>   Unknown AT value: 2900: 11	
 <1><269d7>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <269d8>   DW_AT_name        : *runtime.alg	
    <269e5>   DW_AT_type        : <0x269ee>	
    <269ed>   Unknown AT value: 2900: 22	
 <1><269ee>: Abbrev Number: 21 (DW_TAG_structure_type)
    <269ef>   DW_AT_name        : runtime.alg	
    <269fb>   DW_AT_byte_size   : 32	
    <269fc>   Unknown AT value: 2900: 25	
 <2><269fd>: Abbrev Number: 6 (DW_TAG_member)
    <269fe>   DW_AT_name        : hash	
    <26a03>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <26a06>   DW_AT_type        : <0x26a59>	
 <2><26a0e>: Abbrev Number: 6 (DW_TAG_member)
    <26a0f>   DW_AT_name        : equal	
    <26a15>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
    <26a18>   DW_AT_type        : <0x26ade>	
 <2><26a20>: Abbrev Number: 6 (DW_TAG_member)
    <26a21>   DW_AT_name        : print	
    <26a27>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
    <26a2a>   DW_AT_type        : <0x26b89>	
 <2><26a32>: Abbrev Number: 6 (DW_TAG_member)
    <26a33>   DW_AT_name        : copy	
    <26a38>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
    <26a3b>   DW_AT_type        : <0x26be1>	
 <2><26a43>: Abbrev Number: 0
 <1><26a44>: Abbrev Number: 22 (DW_TAG_typedef)
    <26a45>   DW_AT_name        : runtime.alg	
    <26a51>   DW_AT_type        : <0x269ee>	
 <1><26a59>: Abbrev Number: 14 (DW_TAG_subroutine_type)
    <26a5a>   DW_AT_name        : func(*uint64, uint64, unsafe.Pointer)	
    <26a80>   Unknown AT value: 2900: 19	
 <2><26a81>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <26a82>   DW_AT_type        : <0x26acc>	
 <2><26a8a>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <26a8b>   DW_AT_type        : <0x269cc>	
 <2><26a93>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <26a94>   DW_AT_type        : <0x26389>	
 <2><26a9c>: Abbrev Number: 0
 <1><26a9d>: Abbrev Number: 22 (DW_TAG_typedef)
    <26a9e>   DW_AT_name        : func(*uint64, uint64, unsafe.Pointer)	
    <26ac4>   DW_AT_type        : <0x26a59>	
 <1><26acc>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <26acd>   DW_AT_name        : *uint64	
    <26ad5>   DW_AT_type        : <0x269cc>	
    <26add>   Unknown AT value: 2900: 22	
 <1><26ade>: Abbrev Number: 14 (DW_TAG_subroutine_type)
    <26adf>   DW_AT_name        : func(*uint8, uint64, unsafe.Pointer, unsafe.Pointer)	
    <26b14>   Unknown AT value: 2900: 19	
 <2><26b15>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <26b16>   DW_AT_type        : <0x26b78>	
 <2><26b1e>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <26b1f>   DW_AT_type        : <0x269cc>	
 <2><26b27>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <26b28>   DW_AT_type        : <0x26389>	
 <2><26b30>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <26b31>   DW_AT_type        : <0x26389>	
 <2><26b39>: Abbrev Number: 0
 <1><26b3a>: Abbrev Number: 22 (DW_TAG_typedef)
    <26b3b>   DW_AT_name        : func(*uint8, uint64, unsafe.Pointer, unsafe.Pointer)	
    <26b70>   DW_AT_type        : <0x26ade>	
 <1><26b78>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <26b79>   DW_AT_name        : *uint8	
    <26b80>   DW_AT_type        : <0x264be>	
    <26b88>   Unknown AT value: 2900: 22	
 <1><26b89>: Abbrev Number: 14 (DW_TAG_subroutine_type)
    <26b8a>   DW_AT_name        : func(uint64, unsafe.Pointer)	
    <26ba7>   Unknown AT value: 2900: 19	
 <2><26ba8>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <26ba9>   DW_AT_type        : <0x269cc>	
 <2><26bb1>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <26bb2>   DW_AT_type        : <0x26389>	
 <2><26bba>: Abbrev Number: 0
 <1><26bbb>: Abbrev Number: 22 (DW_TAG_typedef)
    <26bbc>   DW_AT_name        : func(uint64, unsafe.Pointer)	
    <26bd9>   DW_AT_type        : <0x26b89>	
 <1><26be1>: Abbrev Number: 14 (DW_TAG_subroutine_type)
    <26be2>   DW_AT_name        : func(uint64, unsafe.Pointer, unsafe.Pointer)	
    <26c0f>   Unknown AT value: 2900: 19	
 <2><26c10>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <26c11>   DW_AT_type        : <0x269cc>	
 <2><26c19>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <26c1a>   DW_AT_type        : <0x26389>	
 <2><26c22>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <26c23>   DW_AT_type        : <0x26389>	
 <2><26c2b>: Abbrev Number: 0
 <1><26c2c>: Abbrev Number: 22 (DW_TAG_typedef)
    <26c2d>   DW_AT_name        : func(uint64, unsafe.Pointer, unsafe.Pointer)	
    <26c5a>   DW_AT_type        : <0x26be1>	
 <1><26c62>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <26c63>   DW_AT_name        : *runtime.uncommontype	
    <26c79>   DW_AT_type        : <0x26c82>	
    <26c81>   Unknown AT value: 2900: 22	
 <1><26c82>: Abbrev Number: 21 (DW_TAG_structure_type)
    <26c83>   DW_AT_name        : runtime.uncommontype	
    <26c98>   DW_AT_byte_size   : 40	
    <26c99>   Unknown AT value: 2900: 25	
 <2><26c9a>: Abbrev Number: 6 (DW_TAG_member)
    <26c9b>   DW_AT_name        : name	
    <26ca0>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <26ca3>   DW_AT_type        : <0x264c8>	
 <2><26cab>: Abbrev Number: 6 (DW_TAG_member)
    <26cac>   DW_AT_name        : pkgpath	
    <26cb4>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
    <26cb7>   DW_AT_type        : <0x264c8>	
 <2><26cbf>: Abbrev Number: 6 (DW_TAG_member)
    <26cc0>   DW_AT_name        : mhdr	
    <26cc5>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
    <26cc8>   DW_AT_type        : <0x26cfd>	
 <2><26cd0>: Abbrev Number: 6 (DW_TAG_member)
    <26cd1>   DW_AT_name        : m	
    <26cd3>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
    <26cd6>   DW_AT_type        : <0x26d43>	
 <2><26cde>: Abbrev Number: 0
 <1><26cdf>: Abbrev Number: 22 (DW_TAG_typedef)
    <26ce0>   DW_AT_name        : runtime.uncommontype	
    <26cf5>   DW_AT_type        : <0x26c82>	
 <1><26cfd>: Abbrev Number: 19 (DW_TAG_structure_type)
    <26cfe>   DW_AT_name        : []uint8	
    <26d06>   DW_AT_byte_size   : 24	
    <26d07>   Unknown AT value: 2900: 23	
    <26d08>   Unknown AT value: 2902: <0x264be>	
 <2><26d10>: Abbrev Number: 6 (DW_TAG_member)
    <26d11>   DW_AT_name        : array	
    <26d17>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <26d1a>   DW_AT_type        : <0x26b78>	
 <2><26d22>: Abbrev Number: 6 (DW_TAG_member)
    <26d23>   DW_AT_name        : len	
    <26d27>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
    <26d2a>   DW_AT_type        : <0x269cc>	
 <2><26d32>: Abbrev Number: 6 (DW_TAG_member)
    <26d33>   DW_AT_name        : cap	
    <26d37>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
    <26d3a>   DW_AT_type        : <0x269cc>	
 <2><26d42>: Abbrev Number: 0
 <1><26d43>: Abbrev Number: 12 (DW_TAG_array_type)
    <26d44>   DW_AT_name        : [0]runtime.method	
    <26d56>   DW_AT_type        : <0x26d6b>	
    <26d5e>   DW_AT_byte_size   : 0	
    <26d5f>   Unknown AT value: 2900: 17	
 <2><26d60>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <26d61>   DW_AT_type        : <0x26399>	
    <26d69>   DW_AT_count       : 0	
 <2><26d6a>: Abbrev Number: 0
 <1><26d6b>: Abbrev Number: 21 (DW_TAG_structure_type)
    <26d6c>   DW_AT_name        : runtime.method	
    <26d7b>   DW_AT_byte_size   : 48	
    <26d7c>   Unknown AT value: 2900: 25	
 <2><26d7d>: Abbrev Number: 6 (DW_TAG_member)
    <26d7e>   DW_AT_name        : name	
    <26d83>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <26d86>   DW_AT_type        : <0x264c8>	
 <2><26d8e>: Abbrev Number: 6 (DW_TAG_member)
    <26d8f>   DW_AT_name        : pkgpath	
    <26d97>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
    <26d9a>   DW_AT_type        : <0x264c8>	
 <2><26da2>: Abbrev Number: 6 (DW_TAG_member)
    <26da3>   DW_AT_name        : mtyp	
    <26da8>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
    <26dab>   DW_AT_type        : <0x26dfc>	
 <2><26db3>: Abbrev Number: 6 (DW_TAG_member)
    <26db4>   DW_AT_name        : typ	
    <26db8>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
    <26dbb>   DW_AT_type        : <0x26dfc>	
 <2><26dc3>: Abbrev Number: 6 (DW_TAG_member)
    <26dc4>   DW_AT_name        : ifn	
    <26dc8>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
    <26dcb>   DW_AT_type        : <0x26e15>	
 <2><26dd3>: Abbrev Number: 6 (DW_TAG_member)
    <26dd4>   DW_AT_name        : tfn	
    <26dd8>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
    <26ddb>   DW_AT_type        : <0x26e1f>	
 <2><26de3>: Abbrev Number: 0
 <1><26de4>: Abbrev Number: 22 (DW_TAG_typedef)
    <26de5>   DW_AT_name        : runtime.method	
    <26df4>   DW_AT_type        : <0x26d6b>	
 <1><26dfc>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <26dfd>   DW_AT_name        : *runtime._type	
    <26e0c>   DW_AT_type        : <0x269b5>	
    <26e14>   Unknown AT value: 2900: 22	
 <1><26e15>: Abbrev Number: 14 (DW_TAG_subroutine_type)
    <26e16>   DW_AT_name        : func()	
    <26e1d>   Unknown AT value: 2900: 19	
 <2><26e1e>: Abbrev Number: 0
 <1><26e1f>: Abbrev Number: 22 (DW_TAG_typedef)
    <26e20>   DW_AT_name        : func()	
    <26e27>   DW_AT_type        : <0x26e15>	
 <1><26e2f>: Abbrev Number: 12 (DW_TAG_array_type)
    <26e30>   DW_AT_name        : [0]runtime.imethod	
    <26e43>   DW_AT_type        : <0x26e58>	
    <26e4b>   DW_AT_byte_size   : 0	
    <26e4c>   Unknown AT value: 2900: 17	
 <2><26e4d>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <26e4e>   DW_AT_type        : <0x26399>	
    <26e56>   DW_AT_count       : 0	
 <2><26e57>: Abbrev Number: 0
 <1><26e58>: Abbrev Number: 21 (DW_TAG_structure_type)
    <26e59>   DW_AT_name        : runtime.imethod	
    <26e69>   DW_AT_byte_size   : 24	
    <26e6a>   Unknown AT value: 2900: 25	
 <2><26e6b>: Abbrev Number: 6 (DW_TAG_member)
    <26e6c>   DW_AT_name        : name	
    <26e71>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <26e74>   DW_AT_type        : <0x264c8>	
 <2><26e7c>: Abbrev Number: 6 (DW_TAG_member)
    <26e7d>   DW_AT_name        : pkgpath	
    <26e85>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
    <26e88>   DW_AT_type        : <0x264c8>	
 <2><26e90>: Abbrev Number: 6 (DW_TAG_member)
    <26e91>   DW_AT_name        : _type	
    <26e97>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
    <26e9a>   DW_AT_type        : <0x26dfc>	
 <2><26ea2>: Abbrev Number: 0
 <1><26ea3>: Abbrev Number: 22 (DW_TAG_typedef)
    <26ea4>   DW_AT_name        : runtime.imethod	
    <26eb4>   DW_AT_type        : <0x26e58>	
 <1><26ebc>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <26ebd>   DW_AT_name        : *runtime.itab	
    <26ecb>   DW_AT_type        : <0x26826>	
    <26ed3>   Unknown AT value: 2900: 22	
 <1><26ed4>: Abbrev Number: 11 (DW_TAG_base_type)
    <26ed5>   DW_AT_name        : int32	
    <26edb>   DW_AT_encoding    : 5	(signed)
    <26edc>   DW_AT_byte_size   : 4	
    <26edd>   Unknown AT value: 2900: 5	
 <1><26ede>: Abbrev Number: 12 (DW_TAG_array_type)
    <26edf>   DW_AT_name        : [0]func()	
    <26ee9>   DW_AT_type        : <0x26e1f>	
    <26ef1>   DW_AT_byte_size   : 0	
    <26ef2>   Unknown AT value: 2900: 17	
 <2><26ef3>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <26ef4>   DW_AT_type        : <0x26399>	
    <26efc>   DW_AT_count       : 0	
 <2><26efd>: Abbrev Number: 0
 <1><26efe>: Abbrev Number: 12 (DW_TAG_array_type)
    <26eff>   DW_AT_name        : [13]string	
    <26f0a>   DW_AT_type        : <0x264da>	
    <26f12>   DW_AT_byte_size   : 208	
    <26f14>   Unknown AT value: 2900: 17	
 <2><26f15>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <26f16>   DW_AT_type        : <0x26399>	
    <26f1e>   DW_AT_count       : 13	
 <2><26f1f>: Abbrev Number: 0
 <1><26f20>: Abbrev Number: 12 (DW_TAG_array_type)
    <26f21>   DW_AT_name        : [7]string	
    <26f2b>   DW_AT_type        : <0x264da>	
    <26f33>   DW_AT_byte_size   : 112	
    <26f34>   Unknown AT value: 2900: 17	
 <2><26f35>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <26f36>   DW_AT_type        : <0x26399>	
    <26f3e>   DW_AT_count       : 7	
 <2><26f3f>: Abbrev Number: 0
 <1><26f40>: Abbrev Number: 12 (DW_TAG_array_type)
    <26f41>   DW_AT_name        : [4]string	
    <26f4b>   DW_AT_type        : <0x264da>	
    <26f53>   DW_AT_byte_size   : 64	
    <26f54>   Unknown AT value: 2900: 17	
 <2><26f55>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <26f56>   DW_AT_type        : <0x26399>	
    <26f5e>   DW_AT_count       : 4	
 <2><26f5f>: Abbrev Number: 0
 <1><26f60>: Abbrev Number: 12 (DW_TAG_array_type)
    <26f61>   DW_AT_name        : [8]struct { a string; b float64 }	
    <26f83>   DW_AT_type        : <0x26f99>	
    <26f8b>   DW_AT_byte_size   : 192	
    <26f8d>   Unknown AT value: 2900: 17	
 <2><26f8e>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <26f8f>   DW_AT_type        : <0x26399>	
    <26f97>   DW_AT_count       : 8	
 <2><26f98>: Abbrev Number: 0
 <1><26f99>: Abbrev Number: 21 (DW_TAG_structure_type)
    <26f9a>   DW_AT_name        : struct { a string; b float64 }	
    <26fb9>   DW_AT_byte_size   : 24	
    <26fba>   Unknown AT value: 2900: 25	
 <2><26fbb>: Abbrev Number: 6 (DW_TAG_member)
    <26fbc>   DW_AT_name        : a	
    <26fbe>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <26fc1>   DW_AT_type        : <0x264da>	
 <2><26fc9>: Abbrev Number: 6 (DW_TAG_member)
    <26fca>   DW_AT_name        : b	
    <26fcc>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
    <26fcf>   DW_AT_type        : <0x26fd8>	
 <2><26fd7>: Abbrev Number: 0
 <1><26fd8>: Abbrev Number: 11 (DW_TAG_base_type)
    <26fd9>   DW_AT_name        : float64	
    <26fe1>   DW_AT_encoding    : 4	(float)
    <26fe2>   DW_AT_byte_size   : 8	
    <26fe3>   Unknown AT value: 2900: 14	
 <1><26fe4>: Abbrev Number: 19 (DW_TAG_structure_type)
    <26fe5>   DW_AT_name        : []string	
    <26fee>   DW_AT_byte_size   : 24	
    <26fef>   Unknown AT value: 2900: 23	
    <26ff0>   Unknown AT value: 2902: <0x264da>	
 <2><26ff8>: Abbrev Number: 6 (DW_TAG_member)
    <26ff9>   DW_AT_name        : array	
    <26fff>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <27002>   DW_AT_type        : <0x264c8>	
 <2><2700a>: Abbrev Number: 6 (DW_TAG_member)
    <2700b>   DW_AT_name        : len	
    <2700f>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
    <27012>   DW_AT_type        : <0x269cc>	
 <2><2701a>: Abbrev Number: 6 (DW_TAG_member)
    <2701b>   DW_AT_name        : cap	
    <2701f>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
    <27022>   DW_AT_type        : <0x269cc>	
 <2><2702a>: Abbrev Number: 0
 <1><2702b>: Abbrev Number: 21 (DW_TAG_structure_type)
    <2702c>   DW_AT_name        : time.zoneTrans	
    <2703b>   DW_AT_byte_size   : 16	
    <2703c>   Unknown AT value: 2900: 25	
 <2><2703d>: Abbrev Number: 6 (DW_TAG_member)
    <2703e>   DW_AT_name        : when	
    <27043>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <27046>   DW_AT_type        : <0x2709d>	
 <2><2704e>: Abbrev Number: 6 (DW_TAG_member)
    <2704f>   DW_AT_name        : index	
    <27055>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
    <27058>   DW_AT_type        : <0x264be>	
 <2><27060>: Abbrev Number: 6 (DW_TAG_member)
    <27061>   DW_AT_name        : isstd	
    <27067>   DW_AT_data_member_location: 2 byte block: 23 9 	(DW_OP_plus_uconst: 9)
    <2706a>   DW_AT_type        : <0x270a7>	
 <2><27072>: Abbrev Number: 6 (DW_TAG_member)
    <27073>   DW_AT_name        : isutc	
    <27079>   DW_AT_data_member_location: 2 byte block: 23 a 	(DW_OP_plus_uconst: 10)
    <2707c>   DW_AT_type        : <0x270a7>	
 <2><27084>: Abbrev Number: 0
 <1><27085>: Abbrev Number: 22 (DW_TAG_typedef)
    <27086>   DW_AT_name        : time.zoneTrans	
    <27095>   DW_AT_type        : <0x2702b>	
 <1><2709d>: Abbrev Number: 11 (DW_TAG_base_type)
    <2709e>   DW_AT_name        : int64	
    <270a4>   DW_AT_encoding    : 5	(signed)
    <270a5>   DW_AT_byte_size   : 8	
    <270a6>   Unknown AT value: 2900: 6	
 <1><270a7>: Abbrev Number: 11 (DW_TAG_base_type)
    <270a8>   DW_AT_name        : bool	
    <270ad>   DW_AT_encoding    : 2	(boolean)
    <270ae>   DW_AT_byte_size   : 1	
    <270af>   Unknown AT value: 2900: 1	
 <1><270b0>: Abbrev Number: 21 (DW_TAG_structure_type)
    <270b1>   DW_AT_name        : time.data	
    <270bb>   DW_AT_byte_size   : 32	
    <270bc>   Unknown AT value: 2900: 25	
 <2><270bd>: Abbrev Number: 6 (DW_TAG_member)
    <270be>   DW_AT_name        : p	
    <270c0>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <270c3>   DW_AT_type        : <0x26cfd>	
 <2><270cb>: Abbrev Number: 6 (DW_TAG_member)
    <270cc>   DW_AT_name        : error	
    <270d2>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
    <270d5>   DW_AT_type        : <0x270a7>	
 <2><270dd>: Abbrev Number: 0
 <1><270de>: Abbrev Number: 22 (DW_TAG_typedef)
    <270df>   DW_AT_name        : time.data	
    <270e9>   DW_AT_type        : <0x270b0>	
 <1><270f1>: Abbrev Number: 15 (DW_TAG_typedef)
    <270f2>   DW_AT_name        : error	
    <270f8>   DW_AT_type        : <0x27111>	
    <27100>   Unknown AT value: 2900: 20	
 <2><27101>: Abbrev Number: 0
 <1><27102>: Abbrev Number: 22 (DW_TAG_typedef)
    <27103>   DW_AT_name        : error	
    <27109>   DW_AT_type        : <0x270f1>	
 <1><27111>: Abbrev Number: 21 (DW_TAG_structure_type)
    <27112>   DW_AT_name        : runtime.iface	
    <27120>   DW_AT_byte_size   : 16	
    <27121>   Unknown AT value: 2900: 25	
 <2><27122>: Abbrev Number: 6 (DW_TAG_member)
    <27123>   DW_AT_name        : tab	
    <27127>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <2712a>   DW_AT_type        : <0x26ebc>	
 <2><27132>: Abbrev Number: 6 (DW_TAG_member)
    <27133>   DW_AT_name        : data	
    <27138>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
    <2713b>   DW_AT_type        : <0x26389>	
 <2><27143>: Abbrev Number: 0
 <1><27144>: Abbrev Number: 22 (DW_TAG_typedef)
    <27145>   DW_AT_name        : runtime.iface	
    <27153>   DW_AT_type        : <0x27111>	
 <1><2715b>: Abbrev Number: 12 (DW_TAG_array_type)
    <2715c>   DW_AT_name        : [1]time.zoneTrans	
    <2716e>   DW_AT_type        : <0x27085>	
    <27176>   DW_AT_byte_size   : 16	
    <27177>   Unknown AT value: 2900: 17	
 <2><27178>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <27179>   DW_AT_type        : <0x26399>	
    <27181>   DW_AT_count       : 1	
 <2><27182>: Abbrev Number: 0
 <1><27183>: Abbrev Number: 12 (DW_TAG_array_type)
    <27184>   DW_AT_name        : [1]time.zone	
    <27191>   DW_AT_type        : <0x271a6>	
    <27199>   DW_AT_byte_size   : 32	
    <2719a>   Unknown AT value: 2900: 17	
 <2><2719b>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <2719c>   DW_AT_type        : <0x26399>	
    <271a4>   DW_AT_count       : 1	
 <2><271a5>: Abbrev Number: 0
 <1><271a6>: Abbrev Number: 21 (DW_TAG_structure_type)
    <271a7>   DW_AT_name        : time.zone	
    <271b1>   DW_AT_byte_size   : 32	
    <271b2>   Unknown AT value: 2900: 25	
 <2><271b3>: Abbrev Number: 6 (DW_TAG_member)
    <271b4>   DW_AT_name        : name	
    <271b9>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <271bc>   DW_AT_type        : <0x264da>	
 <2><271c4>: Abbrev Number: 6 (DW_TAG_member)
    <271c5>   DW_AT_name        : offset	
    <271cc>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
    <271cf>   DW_AT_type        : <0x271fd>	
 <2><271d7>: Abbrev Number: 6 (DW_TAG_member)
    <271d8>   DW_AT_name        : isDST	
    <271de>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
    <271e1>   DW_AT_type        : <0x270a7>	
 <2><271e9>: Abbrev Number: 0
 <1><271ea>: Abbrev Number: 22 (DW_TAG_typedef)
    <271eb>   DW_AT_name        : time.zone	
    <271f5>   DW_AT_type        : <0x271a6>	
 <1><271fd>: Abbrev Number: 11 (DW_TAG_base_type)
    <271fe>   DW_AT_name        : int	
    <27202>   DW_AT_encoding    : 5	(signed)
    <27203>   DW_AT_byte_size   : 8	
    <27204>   Unknown AT value: 2900: 2	
 <1><27205>: Abbrev Number: 21 (DW_TAG_structure_type)
    <27206>   DW_AT_name        : sync.Once	
    <27210>   DW_AT_byte_size   : 12	
    <27211>   Unknown AT value: 2900: 25	
 <2><27212>: Abbrev Number: 6 (DW_TAG_member)
    <27213>   DW_AT_name        : m	
    <27215>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <27218>   DW_AT_type        : <0x27245>	
 <2><27220>: Abbrev Number: 6 (DW_TAG_member)
    <27221>   DW_AT_name        : done	
    <27226>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
    <27229>   DW_AT_type        : <0x264b3>	
 <2><27231>: Abbrev Number: 0
 <1><27232>: Abbrev Number: 22 (DW_TAG_typedef)
    <27233>   DW_AT_name        : sync.Once	
    <2723d>   DW_AT_type        : <0x27205>	
 <1><27245>: Abbrev Number: 21 (DW_TAG_structure_type)
    <27246>   DW_AT_name        : sync.Mutex	
    <27251>   DW_AT_byte_size   : 8	
    <27252>   Unknown AT value: 2900: 25	
 <2><27253>: Abbrev Number: 6 (DW_TAG_member)
    <27254>   DW_AT_name        : state	
    <2725a>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <2725d>   DW_AT_type        : <0x26ed4>	
 <2><27265>: Abbrev Number: 6 (DW_TAG_member)
    <27266>   DW_AT_name        : sema	
    <2726b>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
    <2726e>   DW_AT_type        : <0x264b3>	
 <2><27276>: Abbrev Number: 0
 <1><27277>: Abbrev Number: 22 (DW_TAG_typedef)
    <27278>   DW_AT_name        : sync.Mutex	
    <27283>   DW_AT_type        : <0x27245>	
 <1><2728b>: Abbrev Number: 21 (DW_TAG_structure_type)
    <2728c>   DW_AT_name        : time.Time	
    <27296>   DW_AT_byte_size   : 24	
    <27297>   Unknown AT value: 2900: 25	
 <2><27298>: Abbrev Number: 6 (DW_TAG_member)
    <27299>   DW_AT_name        : sec	
    <2729d>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <272a0>   DW_AT_type        : <0x2709d>	
 <2><272a8>: Abbrev Number: 6 (DW_TAG_member)
    <272a9>   DW_AT_name        : nsec	
    <272ae>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
    <272b1>   DW_AT_type        : <0x26ed4>	
 <2><272b9>: Abbrev Number: 6 (DW_TAG_member)
    <272ba>   DW_AT_name        : loc	
    <272be>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
    <272c1>   DW_AT_type        : <0x272dd>	
 <2><272c9>: Abbrev Number: 0
 <1><272ca>: Abbrev Number: 22 (DW_TAG_typedef)
    <272cb>   DW_AT_name        : time.Time	
    <272d5>   DW_AT_type        : <0x2728b>	
 <1><272dd>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <272de>   DW_AT_name        : *time.Location	
    <272ed>   DW_AT_type        : <0x272f6>	
    <272f5>   Unknown AT value: 2900: 22	
 <1><272f6>: Abbrev Number: 21 (DW_TAG_structure_type)
    <272f7>   DW_AT_name        : time.Location	
    <27305>   DW_AT_byte_size   : 88	
    <27306>   Unknown AT value: 2900: 25	
 <2><27307>: Abbrev Number: 6 (DW_TAG_member)
    <27308>   DW_AT_name        : name	
    <2730d>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <27310>   DW_AT_type        : <0x264da>	
 <2><27318>: Abbrev Number: 6 (DW_TAG_member)
    <27319>   DW_AT_name        : zone	
    <2731e>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
    <27321>   DW_AT_type        : <0x27392>	
 <2><27329>: Abbrev Number: 6 (DW_TAG_member)
    <2732a>   DW_AT_name        : tx	
    <2732d>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
    <27330>   DW_AT_type        : <0x273dc>	
 <2><27338>: Abbrev Number: 6 (DW_TAG_member)
    <27339>   DW_AT_name        : cacheStart	
    <27344>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
    <27347>   DW_AT_type        : <0x2709d>	
 <2><2734f>: Abbrev Number: 6 (DW_TAG_member)
    <27350>   DW_AT_name        : cacheEnd	
    <27359>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
    <2735c>   DW_AT_type        : <0x2709d>	
 <2><27364>: Abbrev Number: 6 (DW_TAG_member)
    <27365>   DW_AT_name        : cacheZone	
    <2736f>   DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
    <27372>   DW_AT_type        : <0x2742b>	
 <2><2737a>: Abbrev Number: 0
 <1><2737b>: Abbrev Number: 22 (DW_TAG_typedef)
    <2737c>   DW_AT_name        : time.Location	
    <2738a>   DW_AT_type        : <0x272f6>	
 <1><27392>: Abbrev Number: 19 (DW_TAG_structure_type)
    <27393>   DW_AT_name        : []time.zone	
    <2739f>   DW_AT_byte_size   : 24	
    <273a0>   Unknown AT value: 2900: 23	
    <273a1>   Unknown AT value: 2902: <0x271ea>	
 <2><273a9>: Abbrev Number: 6 (DW_TAG_member)
    <273aa>   DW_AT_name        : array	
    <273b0>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <273b3>   DW_AT_type        : <0x2742b>	
 <2><273bb>: Abbrev Number: 6 (DW_TAG_member)
    <273bc>   DW_AT_name        : len	
    <273c0>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
    <273c3>   DW_AT_type        : <0x269cc>	
 <2><273cb>: Abbrev Number: 6 (DW_TAG_member)
    <273cc>   DW_AT_name        : cap	
    <273d0>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
    <273d3>   DW_AT_type        : <0x269cc>	
 <2><273db>: Abbrev Number: 0
 <1><273dc>: Abbrev Number: 19 (DW_TAG_structure_type)
    <273dd>   DW_AT_name        : []time.zoneTrans	
    <273ee>   DW_AT_byte_size   : 24	
    <273ef>   Unknown AT value: 2900: 23	
    <273f0>   Unknown AT value: 2902: <0x27085>	
 <2><273f8>: Abbrev Number: 6 (DW_TAG_member)
    <273f9>   DW_AT_name        : array	
    <273ff>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <27402>   DW_AT_type        : <0x2cfa5>	
 <2><2740a>: Abbrev Number: 6 (DW_TAG_member)
    <2740b>   DW_AT_name        : len	
    <2740f>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
    <27412>   DW_AT_type        : <0x269cc>	
 <2><2741a>: Abbrev Number: 6 (DW_TAG_member)
    <2741b>   DW_AT_name        : cap	
    <2741f>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
    <27422>   DW_AT_type        : <0x269cc>	
 <2><2742a>: Abbrev Number: 0
 <1><2742b>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <2742c>   DW_AT_name        : *time.zone	
    <27437>   DW_AT_type        : <0x271ea>	
    <2743f>   Unknown AT value: 2900: 22	
 <1><27440>: Abbrev Number: 12 (DW_TAG_array_type)
    <27441>   DW_AT_name        : [15]uint8	
    <2744b>   DW_AT_type        : <0x264be>	
    <27453>   DW_AT_byte_size   : 15	
    <27454>   Unknown AT value: 2900: 17	
 <2><27455>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <27456>   DW_AT_type        : <0x26399>	
    <2745e>   DW_AT_count       : 15	
 <2><2745f>: Abbrev Number: 0
 <1><27460>: Abbrev Number: 12 (DW_TAG_array_type)
    <27461>   DW_AT_name        : [13]int32	
    <2746b>   DW_AT_type        : <0x26ed4>	
    <27473>   DW_AT_byte_size   : 52	
    <27474>   Unknown AT value: 2900: 17	
 <2><27475>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <27476>   DW_AT_type        : <0x26399>	
    <2747e>   DW_AT_count       : 13	
 <2><2747f>: Abbrev Number: 0
 <1><27480>: Abbrev Number: 16 (DW_TAG_typedef)
    <27481>   DW_AT_name        : map[string]float64	
    <27494>   DW_AT_type        : <0x2df82>	
    <2749c>   Unknown AT value: 2900: 21	
    <2749d>   Unknown AT value: 2901: <0x264da>	
    <274a5>   Unknown AT value: 2902: <0x26fd8>	
 <1><274ad>: Abbrev Number: 12 (DW_TAG_array_type)
    <274ae>   DW_AT_name        : [8]string	
    <274b8>   DW_AT_type        : <0x264da>	
    <274c0>   DW_AT_byte_size   : 128	
    <274c2>   Unknown AT value: 2900: 17	
 <2><274c3>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <274c4>   DW_AT_type        : <0x26399>	
    <274cc>   DW_AT_count       : 8	
 <2><274cd>: Abbrev Number: 0
 <1><274ce>: Abbrev Number: 12 (DW_TAG_array_type)
    <274cf>   DW_AT_name        : [12]string	
    <274da>   DW_AT_type        : <0x264da>	
    <274e2>   DW_AT_byte_size   : 192	
    <274e4>   Unknown AT value: 2900: 17	
 <2><274e5>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <274e6>   DW_AT_type        : <0x26399>	
    <274ee>   DW_AT_count       : 12	
 <2><274ef>: Abbrev Number: 0
 <1><274f0>: Abbrev Number: 12 (DW_TAG_array_type)
    <274f1>   DW_AT_name        : [6]int	
    <274f8>   DW_AT_type        : <0x271fd>	
    <27500>   DW_AT_byte_size   : 48	
    <27501>   Unknown AT value: 2900: 17	
 <2><27502>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <27503>   DW_AT_type        : <0x26399>	
    <2750b>   DW_AT_count       : 6	
 <2><2750c>: Abbrev Number: 0
 <1><2750d>: Abbrev Number: 21 (DW_TAG_structure_type)
    <2750e>   DW_AT_name        : syscall.mmapper	
    <2751e>   DW_AT_byte_size   : 32	
    <2751f>   Unknown AT value: 2900: 25	
 <2><27520>: Abbrev Number: 6 (DW_TAG_member)
    <27521>   DW_AT_name        : sync.Mutex	
    <2752c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <2752f>   DW_AT_type        : <0x27277>	
 <2><27537>: Abbrev Number: 6 (DW_TAG_member)
    <27538>   DW_AT_name        : active	
    <2753f>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
    <27542>   DW_AT_type        : <0x27588>	
 <2><2754a>: Abbrev Number: 6 (DW_TAG_member)
    <2754b>   DW_AT_name        : mmap	
    <27550>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
    <27553>   DW_AT_type        : <0x275b5>	
 <2><2755b>: Abbrev Number: 6 (DW_TAG_member)
    <2755c>   DW_AT_name        : munmap	
    <27563>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
    <27566>   DW_AT_type        : <0x276a9>	
 <2><2756e>: Abbrev Number: 0
 <1><2756f>: Abbrev Number: 22 (DW_TAG_typedef)
    <27570>   DW_AT_name        : syscall.mmapper	
    <27580>   DW_AT_type        : <0x2750d>	
 <1><27588>: Abbrev Number: 16 (DW_TAG_typedef)
    <27589>   DW_AT_name        : map[*uint8][]uint8	
    <2759c>   DW_AT_type        : <0x2ddad>	
    <275a4>   Unknown AT value: 2900: 21	
    <275a5>   Unknown AT value: 2901: <0x26b78>	
    <275ad>   Unknown AT value: 2902: <0x26cfd>	
 <1><275b5>: Abbrev Number: 14 (DW_TAG_subroutine_type)
    <275b6>   DW_AT_name        : func(uintptr, uintptr, int, int, int, int64) (uintptr, error)	
    <275f4>   Unknown AT value: 2900: 19	
 <2><275f5>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <275f6>   DW_AT_type        : <0x26399>	
 <2><275fe>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <275ff>   DW_AT_type        : <0x26399>	
 <2><27607>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <27608>   DW_AT_type        : <0x271fd>	
 <2><27610>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <27611>   DW_AT_type        : <0x271fd>	
 <2><27619>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <2761a>   DW_AT_type        : <0x271fd>	
 <2><27622>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <27623>   DW_AT_type        : <0x2709d>	
 <2><2762b>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <2762c>   DW_AT_type        : <0x27685>	
 <2><27634>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <27635>   DW_AT_type        : <0x27698>	
 <2><2763d>: Abbrev Number: 0
 <1><2763e>: Abbrev Number: 22 (DW_TAG_typedef)
    <2763f>   DW_AT_name        : func(uintptr, uintptr, int, int, int, int64) (uintptr, error)	
    <2767d>   DW_AT_type        : <0x275b5>	
 <1><27685>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <27686>   DW_AT_name        : *uintptr	
    <2768f>   DW_AT_type        : <0x26399>	
    <27697>   Unknown AT value: 2900: 0	
 <1><27698>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <27699>   DW_AT_name        : *error	
    <276a0>   DW_AT_type        : <0x27102>	
    <276a8>   Unknown AT value: 2900: 0	
 <1><276a9>: Abbrev Number: 14 (DW_TAG_subroutine_type)
    <276aa>   DW_AT_name        : func(uintptr, uintptr) error	
    <276c7>   Unknown AT value: 2900: 19	
 <2><276c8>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <276c9>   DW_AT_type        : <0x26399>	
 <2><276d1>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <276d2>   DW_AT_type        : <0x26399>	
 <2><276da>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <276db>   DW_AT_type        : <0x27698>	
 <2><276e3>: Abbrev Number: 0
 <1><276e4>: Abbrev Number: 22 (DW_TAG_typedef)
    <276e5>   DW_AT_name        : func(uintptr, uintptr) error	
    <27702>   DW_AT_type        : <0x276a9>	
 <1><2770a>: Abbrev Number: 12 (DW_TAG_array_type)
    <2770b>   DW_AT_name        : [32]string	
    <27716>   DW_AT_type        : <0x264da>	
    <2771e>   DW_AT_byte_size   : 512	
    <27720>   Unknown AT value: 2900: 17	
 <2><27721>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <27722>   DW_AT_type        : <0x26399>	
    <2772a>   DW_AT_count       : 32	
 <2><2772b>: Abbrev Number: 0
 <1><2772c>: Abbrev Number: 12 (DW_TAG_array_type)
    <2772d>   DW_AT_name        : [133]string	
    <27739>   DW_AT_type        : <0x264da>	
    <27741>   DW_AT_byte_size   : 2128	
    <27743>   Unknown AT value: 2900: 17	
 <2><27744>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <27745>   DW_AT_type        : <0x26399>	
    <2774d>   DW_AT_count       : 133	
 <2><2774f>: Abbrev Number: 0
 <1><27750>: Abbrev Number: 21 (DW_TAG_structure_type)
    <27751>   DW_AT_name        : struct { addr uintptr; len int; cap int }	
    <2777b>   DW_AT_byte_size   : 24	
    <2777c>   Unknown AT value: 2900: 25	
 <2><2777d>: Abbrev Number: 6 (DW_TAG_member)
    <2777e>   DW_AT_name        : addr	
    <27783>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <27786>   DW_AT_type        : <0x26399>	
 <2><2778e>: Abbrev Number: 6 (DW_TAG_member)
    <2778f>   DW_AT_name        : len	
    <27793>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
    <27796>   DW_AT_type        : <0x271fd>	
 <2><2779e>: Abbrev Number: 6 (DW_TAG_member)
    <2779f>   DW_AT_name        : cap	
    <277a3>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
    <277a6>   DW_AT_type        : <0x271fd>	
 <2><277ae>: Abbrev Number: 0
 <1><277af>: Abbrev Number: 21 (DW_TAG_structure_type)
    <277b0>   DW_AT_name        : sync.RWMutex	
    <277bd>   DW_AT_byte_size   : 24	
    <277be>   Unknown AT value: 2900: 25	
 <2><277bf>: Abbrev Number: 6 (DW_TAG_member)
    <277c0>   DW_AT_name        : w	
    <277c2>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <277c5>   DW_AT_type        : <0x27277>	
 <2><277cd>: Abbrev Number: 6 (DW_TAG_member)
    <277ce>   DW_AT_name        : writerSem	
    <277d8>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
    <277db>   DW_AT_type        : <0x264b3>	
 <2><277e3>: Abbrev Number: 6 (DW_TAG_member)
    <277e4>   DW_AT_name        : readerSem	
    <277ee>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
    <277f1>   DW_AT_type        : <0x264b3>	
 <2><277f9>: Abbrev Number: 6 (DW_TAG_member)
    <277fa>   DW_AT_name        : readerCount	
    <27806>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
    <27809>   DW_AT_type        : <0x26ed4>	
 <2><27811>: Abbrev Number: 6 (DW_TAG_member)
    <27812>   DW_AT_name        : readerWait	
    <2781d>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
    <27820>   DW_AT_type        : <0x26ed4>	
 <2><27828>: Abbrev Number: 0
 <1><27829>: Abbrev Number: 22 (DW_TAG_typedef)
    <2782a>   DW_AT_name        : sync.RWMutex	
    <27837>   DW_AT_type        : <0x277af>	
 <1><2783f>: Abbrev Number: 16 (DW_TAG_typedef)
    <27840>   DW_AT_name        : map[string]int	
    <2784f>   DW_AT_type        : <0x2dbdd>	
    <27857>   Unknown AT value: 2900: 21	
    <27858>   Unknown AT value: 2901: <0x264da>	
    <27860>   Unknown AT value: 2902: <0x271fd>	
 <1><27868>: Abbrev Number: 19 (DW_TAG_structure_type)
    <27869>   DW_AT_name        : []*sync.Pool	
    <27876>   DW_AT_byte_size   : 24	
    <27877>   Unknown AT value: 2900: 23	
    <27878>   Unknown AT value: 2902: <0x278b3>	
 <2><27880>: Abbrev Number: 6 (DW_TAG_member)
    <27881>   DW_AT_name        : array	
    <27887>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <2788a>   DW_AT_type        : <0x2d17b>	
 <2><27892>: Abbrev Number: 6 (DW_TAG_member)
    <27893>   DW_AT_name        : len	
    <27897>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
    <2789a>   DW_AT_type        : <0x269cc>	
 <2><278a2>: Abbrev Number: 6 (DW_TAG_member)
    <278a3>   DW_AT_name        : cap	
    <278a7>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
    <278aa>   DW_AT_type        : <0x269cc>	
 <2><278b2>: Abbrev Number: 0
 <1><278b3>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <278b4>   DW_AT_name        : *sync.Pool	
    <278bf>   DW_AT_type        : <0x278c8>	
    <278c7>   Unknown AT value: 2900: 22	
 <1><278c8>: Abbrev Number: 21 (DW_TAG_structure_type)
    <278c9>   DW_AT_name        : sync.Pool	
    <278d3>   DW_AT_byte_size   : 24	
    <278d4>   Unknown AT value: 2900: 25	
 <2><278d5>: Abbrev Number: 6 (DW_TAG_member)
    <278d6>   DW_AT_name        : local	
    <278dc>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <278df>   DW_AT_type        : <0x26389>	
 <2><278e7>: Abbrev Number: 6 (DW_TAG_member)
    <278e8>   DW_AT_name        : localSize	
    <278f2>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
    <278f5>   DW_AT_type        : <0x26399>	
 <2><278fd>: Abbrev Number: 6 (DW_TAG_member)
    <278fe>   DW_AT_name        : New	
    <27902>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
    <27905>   DW_AT_type        : <0x27921>	
 <2><2790d>: Abbrev Number: 0
 <1><2790e>: Abbrev Number: 22 (DW_TAG_typedef)
    <2790f>   DW_AT_name        : sync.Pool	
    <27919>   DW_AT_type        : <0x278c8>	
 <1><27921>: Abbrev Number: 14 (DW_TAG_subroutine_type)
    <27922>   DW_AT_name        : func() interface {}	
    <27936>   Unknown AT value: 2900: 19	
 <2><27937>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <27938>   DW_AT_type        : <0x279d8>	
 <2><27940>: Abbrev Number: 0
 <1><27941>: Abbrev Number: 22 (DW_TAG_typedef)
    <27942>   DW_AT_name        : func() interface {}	
    <27956>   DW_AT_type        : <0x27921>	
 <1><2795e>: Abbrev Number: 15 (DW_TAG_typedef)
    <2795f>   DW_AT_name        : interface {}	
    <2796c>   DW_AT_type        : <0x2798c>	
    <27974>   Unknown AT value: 2900: 20	
 <2><27975>: Abbrev Number: 0
 <1><27976>: Abbrev Number: 22 (DW_TAG_typedef)
    <27977>   DW_AT_name        : interface {}	
    <27984>   DW_AT_type        : <0x2795e>	
 <1><2798c>: Abbrev Number: 21 (DW_TAG_structure_type)
    <2798d>   DW_AT_name        : runtime.eface	
    <2799b>   DW_AT_byte_size   : 16	
    <2799c>   Unknown AT value: 2900: 25	
 <2><2799d>: Abbrev Number: 6 (DW_TAG_member)
    <2799e>   DW_AT_name        : _type	
    <279a4>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <279a7>   DW_AT_type        : <0x26dfc>	
 <2><279af>: Abbrev Number: 6 (DW_TAG_member)
    <279b0>   DW_AT_name        : data	
    <279b5>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
    <279b8>   DW_AT_type        : <0x26389>	
 <2><279c0>: Abbrev Number: 0
 <1><279c1>: Abbrev Number: 22 (DW_TAG_typedef)
    <279c2>   DW_AT_name        : runtime.eface	
    <279d0>   DW_AT_type        : <0x2798c>	
 <1><279d8>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <279d9>   DW_AT_name        : *interface {}	
    <279e7>   DW_AT_type        : <0x2795e>	
    <279ef>   Unknown AT value: 2900: 0	
 <1><279f0>: Abbrev Number: 12 (DW_TAG_array_type)
    <279f1>   DW_AT_name        : [27]string	
    <279fc>   DW_AT_type        : <0x264da>	
    <27a04>   DW_AT_byte_size   : 432	
    <27a06>   Unknown AT value: 2900: 17	
 <2><27a07>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <27a08>   DW_AT_type        : <0x26399>	
    <27a10>   DW_AT_count       : 27	
 <2><27a11>: Abbrev Number: 0
 <1><27a12>: Abbrev Number: 21 (DW_TAG_structure_type)
    <27a13>   DW_AT_name        : reflect.Value	
    <27a21>   DW_AT_byte_size   : 32	
    <27a22>   Unknown AT value: 2900: 25	
 <2><27a23>: Abbrev Number: 6 (DW_TAG_member)
    <27a24>   DW_AT_name        : typ	
    <27a28>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <27a2b>   DW_AT_type        : <0x27a87>	
 <2><27a33>: Abbrev Number: 6 (DW_TAG_member)
    <27a34>   DW_AT_name        : ptr	
    <27a38>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
    <27a3b>   DW_AT_type        : <0x26389>	
 <2><27a43>: Abbrev Number: 6 (DW_TAG_member)
    <27a44>   DW_AT_name        : scalar	
    <27a4b>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
    <27a4e>   DW_AT_type        : <0x26399>	
 <2><27a56>: Abbrev Number: 6 (DW_TAG_member)
    <27a57>   DW_AT_name        : reflect.flag	
    <27a64>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
    <27a67>   DW_AT_type        : <0x27d1e>	
 <2><27a6f>: Abbrev Number: 0
 <1><27a70>: Abbrev Number: 22 (DW_TAG_typedef)
    <27a71>   DW_AT_name        : reflect.Value	
    <27a7f>   DW_AT_type        : <0x27a12>	
 <1><27a87>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <27a88>   DW_AT_name        : *reflect.rtype	
    <27a97>   DW_AT_type        : <0x27aa0>	
    <27a9f>   Unknown AT value: 2900: 22	
 <1><27aa0>: Abbrev Number: 21 (DW_TAG_structure_type)
    <27aa1>   DW_AT_name        : reflect.rtype	
    <27aaf>   DW_AT_byte_size   : 64	
    <27ab0>   Unknown AT value: 2900: 25	
 <2><27ab1>: Abbrev Number: 6 (DW_TAG_member)
    <27ab2>   DW_AT_name        : size	
    <27ab7>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <27aba>   DW_AT_type        : <0x26399>	
 <2><27ac2>: Abbrev Number: 6 (DW_TAG_member)
    <27ac3>   DW_AT_name        : hash	
    <27ac8>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
    <27acb>   DW_AT_type        : <0x264b3>	
 <2><27ad3>: Abbrev Number: 6 (DW_TAG_member)
    <27ad4>   DW_AT_name        : _	
    <27ad6>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
    <27ad9>   DW_AT_type        : <0x264be>	
 <2><27ae1>: Abbrev Number: 6 (DW_TAG_member)
    <27ae2>   DW_AT_name        : align	
    <27ae8>   DW_AT_data_member_location: 2 byte block: 23 d 	(DW_OP_plus_uconst: 13)
    <27aeb>   DW_AT_type        : <0x264be>	
 <2><27af3>: Abbrev Number: 6 (DW_TAG_member)
    <27af4>   DW_AT_name        : fieldAlign	
    <27aff>   DW_AT_data_member_location: 2 byte block: 23 e 	(DW_OP_plus_uconst: 14)
    <27b02>   DW_AT_type        : <0x264be>	
 <2><27b0a>: Abbrev Number: 6 (DW_TAG_member)
    <27b0b>   DW_AT_name        : kind	
    <27b10>   DW_AT_data_member_location: 2 byte block: 23 f 	(DW_OP_plus_uconst: 15)
    <27b13>   DW_AT_type        : <0x264be>	
 <2><27b1b>: Abbrev Number: 6 (DW_TAG_member)
    <27b1c>   DW_AT_name        : alg	
    <27b20>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
    <27b23>   DW_AT_type        : <0x27685>	
 <2><27b2b>: Abbrev Number: 6 (DW_TAG_member)
    <27b2c>   DW_AT_name        : gc	
    <27b2f>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
    <27b32>   DW_AT_type        : <0x26389>	
 <2><27b3a>: Abbrev Number: 6 (DW_TAG_member)
    <27b3b>   DW_AT_name        : string	
    <27b42>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
    <27b45>   DW_AT_type        : <0x264c8>	
 <2><27b4d>: Abbrev Number: 6 (DW_TAG_member)
    <27b4e>   DW_AT_name        : *reflect.uncommonType	
    <27b64>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
    <27b67>   DW_AT_type        : <0x27bae>	
 <2><27b6f>: Abbrev Number: 6 (DW_TAG_member)
    <27b70>   DW_AT_name        : ptrToThis	
    <27b7a>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
    <27b7d>   DW_AT_type        : <0x27a87>	
 <2><27b85>: Abbrev Number: 6 (DW_TAG_member)
    <27b86>   DW_AT_name        : zero	
    <27b8b>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
    <27b8e>   DW_AT_type        : <0x26389>	
 <2><27b96>: Abbrev Number: 0
 <1><27b97>: Abbrev Number: 22 (DW_TAG_typedef)
    <27b98>   DW_AT_name        : reflect.rtype	
    <27ba6>   DW_AT_type        : <0x27aa0>	
 <1><27bae>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <27baf>   DW_AT_name        : *reflect.uncommonType	
    <27bc5>   DW_AT_type        : <0x27bce>	
    <27bcd>   Unknown AT value: 2900: 22	
 <1><27bce>: Abbrev Number: 21 (DW_TAG_structure_type)
    <27bcf>   DW_AT_name        : reflect.uncommonType	
    <27be4>   DW_AT_byte_size   : 40	
    <27be5>   Unknown AT value: 2900: 25	
 <2><27be6>: Abbrev Number: 6 (DW_TAG_member)
    <27be7>   DW_AT_name        : name	
    <27bec>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <27bef>   DW_AT_type        : <0x264c8>	
 <2><27bf7>: Abbrev Number: 6 (DW_TAG_member)
    <27bf8>   DW_AT_name        : pkgPath	
    <27c00>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
    <27c03>   DW_AT_type        : <0x264c8>	
 <2><27c0b>: Abbrev Number: 6 (DW_TAG_member)
    <27c0c>   DW_AT_name        : methods	
    <27c14>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
    <27c17>   DW_AT_type        : <0x27c3e>	
 <2><27c1f>: Abbrev Number: 0
 <1><27c20>: Abbrev Number: 22 (DW_TAG_typedef)
    <27c21>   DW_AT_name        : reflect.uncommonType	
    <27c36>   DW_AT_type        : <0x27bce>	
 <1><27c3e>: Abbrev Number: 19 (DW_TAG_structure_type)
    <27c3f>   DW_AT_name        : []reflect.method	
    <27c50>   DW_AT_byte_size   : 24	
    <27c51>   Unknown AT value: 2900: 23	
    <27c52>   Unknown AT value: 2902: <0x27c8d>	
 <2><27c5a>: Abbrev Number: 6 (DW_TAG_member)
    <27c5b>   DW_AT_name        : array	
    <27c61>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <27c64>   DW_AT_type        : <0x2bee1>	
 <2><27c6c>: Abbrev Number: 6 (DW_TAG_member)
    <27c6d>   DW_AT_name        : len	
    <27c71>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
    <27c74>   DW_AT_type        : <0x269cc>	
 <2><27c7c>: Abbrev Number: 6 (DW_TAG_member)
    <27c7d>   DW_AT_name        : cap	
    <27c81>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
    <27c84>   DW_AT_type        : <0x269cc>	
 <2><27c8c>: Abbrev Number: 0
 <1><27c8d>: Abbrev Number: 21 (DW_TAG_structure_type)
    <27c8e>   DW_AT_name        : reflect.method	
    <27c9d>   DW_AT_byte_size   : 48	
    <27c9e>   Unknown AT value: 2900: 25	
 <2><27c9f>: Abbrev Number: 6 (DW_TAG_member)
    <27ca0>   DW_AT_name        : name	
    <27ca5>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <27ca8>   DW_AT_type        : <0x264c8>	
 <2><27cb0>: Abbrev Number: 6 (DW_TAG_member)
    <27cb1>   DW_AT_name        : pkgPath	
    <27cb9>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
    <27cbc>   DW_AT_type        : <0x264c8>	
 <2><27cc4>: Abbrev Number: 6 (DW_TAG_member)
    <27cc5>   DW_AT_name        : mtyp	
    <27cca>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
    <27ccd>   DW_AT_type        : <0x27a87>	
 <2><27cd5>: Abbrev Number: 6 (DW_TAG_member)
    <27cd6>   DW_AT_name        : typ	
    <27cda>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
    <27cdd>   DW_AT_type        : <0x27a87>	
 <2><27ce5>: Abbrev Number: 6 (DW_TAG_member)
    <27ce6>   DW_AT_name        : ifn	
    <27cea>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
    <27ced>   DW_AT_type        : <0x26389>	
 <2><27cf5>: Abbrev Number: 6 (DW_TAG_member)
    <27cf6>   DW_AT_name        : tfn	
    <27cfa>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
    <27cfd>   DW_AT_type        : <0x26389>	
 <2><27d05>: Abbrev Number: 0
 <1><27d06>: Abbrev Number: 22 (DW_TAG_typedef)
    <27d07>   DW_AT_name        : reflect.method	
    <27d16>   DW_AT_type        : <0x27c8d>	
 <1><27d1e>: Abbrev Number: 11 (DW_TAG_base_type)
    <27d1f>   DW_AT_name        : reflect.flag	
    <27d2c>   DW_AT_encoding    : 7	(unsigned)
    <27d2d>   DW_AT_byte_size   : 8	
    <27d2e>   Unknown AT value: 2900: 12	
 <1><27d2f>: Abbrev Number: 21 (DW_TAG_structure_type)
    <27d30>   DW_AT_name        : reflect.sliceHeader	
    <27d44>   DW_AT_byte_size   : 24	
    <27d45>   Unknown AT value: 2900: 25	
 <2><27d46>: Abbrev Number: 6 (DW_TAG_member)
    <27d47>   DW_AT_name        : Data	
    <27d4c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <27d4f>   DW_AT_type        : <0x26389>	
 <2><27d57>: Abbrev Number: 6 (DW_TAG_member)
    <27d58>   DW_AT_name        : Len	
    <27d5c>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
    <27d5f>   DW_AT_type        : <0x271fd>	
 <2><27d67>: Abbrev Number: 6 (DW_TAG_member)
    <27d68>   DW_AT_name        : Cap	
    <27d6c>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
    <27d6f>   DW_AT_type        : <0x271fd>	
 <2><27d77>: Abbrev Number: 0
 <1><27d78>: Abbrev Number: 22 (DW_TAG_typedef)
    <27d79>   DW_AT_name        : reflect.sliceHeader	
    <27d8d>   DW_AT_type        : <0x27d2f>	
 <1><27d95>: Abbrev Number: 21 (DW_TAG_structure_type)
    <27d96>   DW_AT_name        : reflect.stringHeader	
    <27dab>   DW_AT_byte_size   : 16	
    <27dac>   Unknown AT value: 2900: 25	
 <2><27dad>: Abbrev Number: 6 (DW_TAG_member)
    <27dae>   DW_AT_name        : Data	
    <27db3>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <27db6>   DW_AT_type        : <0x26389>	
 <2><27dbe>: Abbrev Number: 6 (DW_TAG_member)
    <27dbf>   DW_AT_name        : Len	
    <27dc3>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
    <27dc6>   DW_AT_type        : <0x271fd>	
 <2><27dce>: Abbrev Number: 0
 <1><27dcf>: Abbrev Number: 22 (DW_TAG_typedef)
    <27dd0>   DW_AT_name        : reflect.stringHeader	
    <27de5>   DW_AT_type        : <0x27d95>	
 <1><27ded>: Abbrev Number: 12 (DW_TAG_array_type)
    <27dee>   DW_AT_name        : [6]string	
    <27df8>   DW_AT_type        : <0x264da>	
    <27e00>   DW_AT_byte_size   : 96	
    <27e01>   Unknown AT value: 2900: 17	
 <2><27e02>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <27e03>   DW_AT_type        : <0x26399>	
    <27e0b>   DW_AT_count       : 6	
 <2><27e0c>: Abbrev Number: 0
 <1><27e0d>: Abbrev Number: 21 (DW_TAG_structure_type)
    <27e0e>   DW_AT_name        : reflect.layoutType	
    <27e21>   DW_AT_byte_size   : 24	
    <27e22>   Unknown AT value: 2900: 25	
 <2><27e23>: Abbrev Number: 6 (DW_TAG_member)
    <27e24>   DW_AT_name        : t	
    <27e26>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <27e29>   DW_AT_type        : <0x27a87>	
 <2><27e31>: Abbrev Number: 6 (DW_TAG_member)
    <27e32>   DW_AT_name        : argSize	
    <27e3a>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
    <27e3d>   DW_AT_type        : <0x26399>	
 <2><27e45>: Abbrev Number: 6 (DW_TAG_member)
    <27e46>   DW_AT_name        : retOffset	
    <27e50>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
    <27e53>   DW_AT_type        : <0x26399>	
 <2><27e5b>: Abbrev Number: 0
 <1><27e5c>: Abbrev Number: 22 (DW_TAG_typedef)
    <27e5d>   DW_AT_name        : reflect.layoutType	
    <27e70>   DW_AT_type        : <0x27e0d>	
 <1><27e78>: Abbrev Number: 21 (DW_TAG_structure_type)
    <27e79>   DW_AT_name        : struct { sync.RWMutex; m map[reflect.layoutKey]reflect.layoutType }	
    <27ebd>   DW_AT_byte_size   : 32	
    <27ebe>   Unknown AT value: 2900: 25	
 <2><27ebf>: Abbrev Number: 6 (DW_TAG_member)
    <27ec0>   DW_AT_name        : sync.RWMutex	
    <27ecd>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <27ed0>   DW_AT_type        : <0x27829>	
 <2><27ed8>: Abbrev Number: 6 (DW_TAG_member)
    <27ed9>   DW_AT_name        : m	
    <27edb>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
    <27ede>   DW_AT_type        : <0x27ee7>	
 <2><27ee6>: Abbrev Number: 0
 <1><27ee7>: Abbrev Number: 16 (DW_TAG_typedef)
    <27ee8>   DW_AT_name        : map[reflect.layoutKey]reflect.layoutType	
    <27f11>   DW_AT_type        : <0x2da02>	
    <27f19>   Unknown AT value: 2900: 21	
    <27f1a>   Unknown AT value: 2901: <0x27f2a>	
    <27f22>   Unknown AT value: 2902: <0x27e5c>	
 <1><27f2a>: Abbrev Number: 21 (DW_TAG_structure_type)
    <27f2b>   DW_AT_name        : reflect.layoutKey	
    <27f3d>   DW_AT_byte_size   : 16	
    <27f3e>   Unknown AT value: 2900: 25	
 <2><27f3f>: Abbrev Number: 6 (DW_TAG_member)
    <27f40>   DW_AT_name        : t	
    <27f42>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <27f45>   DW_AT_type        : <0x27a87>	
 <2><27f4d>: Abbrev Number: 6 (DW_TAG_member)
    <27f4e>   DW_AT_name        : rcvr	
    <27f53>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
    <27f56>   DW_AT_type        : <0x27a87>	
 <2><27f5e>: Abbrev Number: 0
 <1><27f5f>: Abbrev Number: 22 (DW_TAG_typedef)
    <27f60>   DW_AT_name        : reflect.layoutKey	
    <27f72>   DW_AT_type        : <0x27f2a>	
 <1><27f7a>: Abbrev Number: 21 (DW_TAG_structure_type)
    <27f7b>   DW_AT_name        : reflect.ptrDataGC	
    <27f8d>   DW_AT_byte_size   : 32	
    <27f8e>   Unknown AT value: 2900: 25	
 <2><27f8f>: Abbrev Number: 6 (DW_TAG_member)
    <27f90>   DW_AT_name        : width	
    <27f96>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <27f99>   DW_AT_type        : <0x26399>	
 <2><27fa1>: Abbrev Number: 6 (DW_TAG_member)
    <27fa2>   DW_AT_name        : op	
    <27fa5>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
    <27fa8>   DW_AT_type        : <0x26399>	
 <2><27fb0>: Abbrev Number: 6 (DW_TAG_member)
    <27fb1>   DW_AT_name        : off	
    <27fb5>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
    <27fb8>   DW_AT_type        : <0x26399>	
 <2><27fc0>: Abbrev Number: 6 (DW_TAG_member)
    <27fc1>   DW_AT_name        : end	
    <27fc5>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
    <27fc8>   DW_AT_type        : <0x26399>	
 <2><27fd0>: Abbrev Number: 0
 <1><27fd1>: Abbrev Number: 22 (DW_TAG_typedef)
    <27fd2>   DW_AT_name        : reflect.ptrDataGC	
    <27fe4>   DW_AT_type        : <0x27f7a>	
 <1><27fec>: Abbrev Number: 12 (DW_TAG_array_type)
    <27fed>   DW_AT_name        : [1]uint8	
    <27ff6>   DW_AT_type        : <0x264be>	
    <27ffe>   DW_AT_byte_size   : 1	
    <27fff>   Unknown AT value: 2900: 17	
 <2><28000>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <28001>   DW_AT_type        : <0x26399>	
    <28009>   DW_AT_count       : 1	
 <2><2800a>: Abbrev Number: 0
 <1><2800b>: Abbrev Number: 21 (DW_TAG_structure_type)
    <2800c>   DW_AT_name        : struct { sync.RWMutex; m map[*reflect.rtype]*reflect.ptrType }	
    <2804b>   DW_AT_byte_size   : 32	
    <2804c>   Unknown AT value: 2900: 25	
 <2><2804d>: Abbrev Number: 6 (DW_TAG_member)
    <2804e>   DW_AT_name        : sync.RWMutex	
    <2805b>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <2805e>   DW_AT_type        : <0x27829>	
 <2><28066>: Abbrev Number: 6 (DW_TAG_member)
    <28067>   DW_AT_name        : m	
    <28069>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
    <2806c>   DW_AT_type        : <0x28075>	
 <2><28074>: Abbrev Number: 0
 <1><28075>: Abbrev Number: 16 (DW_TAG_typedef)
    <28076>   DW_AT_name        : map[*reflect.rtype]*reflect.ptrType	
    <2809a>   DW_AT_type        : <0x2d7c3>	
    <280a2>   Unknown AT value: 2900: 21	
    <280a3>   Unknown AT value: 2901: <0x27a87>	
    <280ab>   Unknown AT value: 2902: <0x280b3>	
 <1><280b3>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <280b4>   DW_AT_name        : *reflect.ptrType	
    <280c5>   DW_AT_type        : <0x280ce>	
    <280cd>   Unknown AT value: 2900: 22	
 <1><280ce>: Abbrev Number: 21 (DW_TAG_structure_type)
    <280cf>   DW_AT_name        : reflect.ptrType	
    <280df>   DW_AT_byte_size   : 72	
    <280e0>   Unknown AT value: 2900: 25	
 <2><280e1>: Abbrev Number: 6 (DW_TAG_member)
    <280e2>   DW_AT_name        : reflect.rtype	
    <280f0>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <280f3>   DW_AT_type        : <0x27b97>	
 <2><280fb>: Abbrev Number: 6 (DW_TAG_member)
    <280fc>   DW_AT_name        : elem	
    <28101>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
    <28104>   DW_AT_type        : <0x27a87>	
 <2><2810c>: Abbrev Number: 0
 <1><2810d>: Abbrev Number: 22 (DW_TAG_typedef)
    <2810e>   DW_AT_name        : reflect.ptrType	
    <2811e>   DW_AT_type        : <0x280ce>	
 <1><28126>: Abbrev Number: 21 (DW_TAG_structure_type)
    <28127>   DW_AT_name        : reflect.fieldScan	
    <28139>   DW_AT_byte_size   : 32	
    <2813a>   Unknown AT value: 2900: 25	
 <2><2813b>: Abbrev Number: 6 (DW_TAG_member)
    <2813c>   DW_AT_name        : typ	
    <28140>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <28143>   DW_AT_type        : <0x28179>	
 <2><2814b>: Abbrev Number: 6 (DW_TAG_member)
    <2814c>   DW_AT_name        : index	
    <28152>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
    <28155>   DW_AT_type        : <0x282d8>	
 <2><2815d>: Abbrev Number: 0
 <1><2815e>: Abbrev Number: 22 (DW_TAG_typedef)
    <2815f>   DW_AT_name        : reflect.fieldScan	
    <28171>   DW_AT_type        : <0x28126>	
 <1><28179>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <2817a>   DW_AT_name        : *reflect.structType	
    <2818e>   DW_AT_type        : <0x28197>	
    <28196>   Unknown AT value: 2900: 22	
 <1><28197>: Abbrev Number: 21 (DW_TAG_structure_type)
    <28198>   DW_AT_name        : reflect.structType	
    <281ab>   DW_AT_byte_size   : 88	
    <281ac>   Unknown AT value: 2900: 25	
 <2><281ad>: Abbrev Number: 6 (DW_TAG_member)
    <281ae>   DW_AT_name        : reflect.rtype	
    <281bc>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <281bf>   DW_AT_type        : <0x27b97>	
 <2><281c7>: Abbrev Number: 6 (DW_TAG_member)
    <281c8>   DW_AT_name        : fields	
    <281cf>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
    <281d2>   DW_AT_type        : <0x281f7>	
 <2><281da>: Abbrev Number: 0
 <1><281db>: Abbrev Number: 22 (DW_TAG_typedef)
    <281dc>   DW_AT_name        : reflect.structType	
    <281ef>   DW_AT_type        : <0x28197>	
 <1><281f7>: Abbrev Number: 19 (DW_TAG_structure_type)
    <281f8>   DW_AT_name        : []reflect.structField	
    <2820e>   DW_AT_byte_size   : 24	
    <2820f>   Unknown AT value: 2900: 23	
    <28210>   Unknown AT value: 2902: <0x2824b>	
 <2><28218>: Abbrev Number: 6 (DW_TAG_member)
    <28219>   DW_AT_name        : array	
    <2821f>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <28222>   DW_AT_type        : <0x2c18f>	
 <2><2822a>: Abbrev Number: 6 (DW_TAG_member)
    <2822b>   DW_AT_name        : len	
    <2822f>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
    <28232>   DW_AT_type        : <0x269cc>	
 <2><2823a>: Abbrev Number: 6 (DW_TAG_member)
    <2823b>   DW_AT_name        : cap	
    <2823f>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
    <28242>   DW_AT_type        : <0x269cc>	
 <2><2824a>: Abbrev Number: 0
 <1><2824b>: Abbrev Number: 21 (DW_TAG_structure_type)
    <2824c>   DW_AT_name        : reflect.structField	
    <28260>   DW_AT_byte_size   : 40	
    <28261>   Unknown AT value: 2900: 25	
 <2><28262>: Abbrev Number: 6 (DW_TAG_member)
    <28263>   DW_AT_name        : name	
    <28268>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <2826b>   DW_AT_type        : <0x264c8>	
 <2><28273>: Abbrev Number: 6 (DW_TAG_member)
    <28274>   DW_AT_name        : pkgPath	
    <2827c>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
    <2827f>   DW_AT_type        : <0x264c8>	
 <2><28287>: Abbrev Number: 6 (DW_TAG_member)
    <28288>   DW_AT_name        : typ	
    <2828c>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
    <2828f>   DW_AT_type        : <0x27a87>	
 <2><28297>: Abbrev Number: 6 (DW_TAG_member)
    <28298>   DW_AT_name        : tag	
    <2829c>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
    <2829f>   DW_AT_type        : <0x264c8>	
 <2><282a7>: Abbrev Number: 6 (DW_TAG_member)
    <282a8>   DW_AT_name        : offset	
    <282af>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
    <282b2>   DW_AT_type        : <0x26399>	
 <2><282ba>: Abbrev Number: 0
 <1><282bb>: Abbrev Number: 22 (DW_TAG_typedef)
    <282bc>   DW_AT_name        : reflect.structField	
    <282d0>   DW_AT_type        : <0x2824b>	
 <1><282d8>: Abbrev Number: 19 (DW_TAG_structure_type)
    <282d9>   DW_AT_name        : []int	
    <282df>   DW_AT_byte_size   : 24	
    <282e0>   Unknown AT value: 2900: 23	
    <282e1>   Unknown AT value: 2902: <0x271fd>	
 <2><282e9>: Abbrev Number: 6 (DW_TAG_member)
    <282ea>   DW_AT_name        : array	
    <282f0>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <282f3>   DW_AT_type        : <0x2b592>	
 <2><282fb>: Abbrev Number: 6 (DW_TAG_member)
    <282fc>   DW_AT_name        : len	
    <28300>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
    <28303>   DW_AT_type        : <0x269cc>	
 <2><2830b>: Abbrev Number: 6 (DW_TAG_member)
    <2830c>   DW_AT_name        : cap	
    <28310>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
    <28313>   DW_AT_type        : <0x269cc>	
 <2><2831b>: Abbrev Number: 0
 <1><2831c>: Abbrev Number: 21 (DW_TAG_structure_type)
    <2831d>   DW_AT_name        : reflect.StructField	
    <28331>   DW_AT_byte_size   : 104	
    <28332>   Unknown AT value: 2900: 25	
 <2><28333>: Abbrev Number: 6 (DW_TAG_member)
    <28334>   DW_AT_name        : Name	
    <28339>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <2833c>   DW_AT_type        : <0x264da>	
 <2><28344>: Abbrev Number: 6 (DW_TAG_member)
    <28345>   DW_AT_name        : PkgPath	
    <2834d>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
    <28350>   DW_AT_type        : <0x264da>	
 <2><28358>: Abbrev Number: 6 (DW_TAG_member)
    <28359>   DW_AT_name        : Type	
    <2835e>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
    <28361>   DW_AT_type        : <0x283d2>	
 <2><28369>: Abbrev Number: 6 (DW_TAG_member)
    <2836a>   DW_AT_name        : Tag	
    <2836e>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
    <28371>   DW_AT_type        : <0x28400>	
 <2><28379>: Abbrev Number: 6 (DW_TAG_member)
    <2837a>   DW_AT_name        : Offset	
    <28381>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
    <28384>   DW_AT_type        : <0x26399>	
 <2><2838c>: Abbrev Number: 6 (DW_TAG_member)
    <2838d>   DW_AT_name        : Index	
    <28393>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
    <28396>   DW_AT_type        : <0x282d8>	
 <2><2839e>: Abbrev Number: 6 (DW_TAG_member)
    <2839f>   DW_AT_name        : Anonymous	
    <283a9>   DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
    <283ac>   DW_AT_type        : <0x270a7>	
 <2><283b4>: Abbrev Number: 0
 <1><283b5>: Abbrev Number: 22 (DW_TAG_typedef)
    <283b6>   DW_AT_name        : reflect.StructField	
    <283ca>   DW_AT_type        : <0x2831c>	
 <1><283d2>: Abbrev Number: 15 (DW_TAG_typedef)
    <283d3>   DW_AT_name        : reflect.Type	
    <283e0>   DW_AT_type        : <0x27144>	
    <283e8>   Unknown AT value: 2900: 20	
 <2><283e9>: Abbrev Number: 0
 <1><283ea>: Abbrev Number: 22 (DW_TAG_typedef)
    <283eb>   DW_AT_name        : reflect.Type	
    <283f8>   DW_AT_type        : <0x283d2>	
 <1><28400>: Abbrev Number: 20 (DW_TAG_structure_type)
    <28401>   DW_AT_name        : reflect.StructTag	
    <28413>   DW_AT_byte_size   : 16	
    <28414>   Unknown AT value: 2900: 24	
 <2><28415>: Abbrev Number: 6 (DW_TAG_member)
    <28416>   DW_AT_name        : str	
    <2841a>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <2841d>   DW_AT_type        : <0x26b78>	
 <2><28425>: Abbrev Number: 6 (DW_TAG_member)
    <28426>   DW_AT_name        : len	
    <2842a>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
    <2842d>   DW_AT_type        : <0x2709d>	
 <2><28435>: Abbrev Number: 0
 <1><28436>: Abbrev Number: 21 (DW_TAG_structure_type)
    <28437>   DW_AT_name        : struct { b bool; x interface {} }	
    <28459>   DW_AT_byte_size   : 24	
    <2845a>   Unknown AT value: 2900: 25	
 <2><2845b>: Abbrev Number: 6 (DW_TAG_member)
    <2845c>   DW_AT_name        : b	
    <2845e>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <28461>   DW_AT_type        : <0x270a7>	
 <2><28469>: Abbrev Number: 6 (DW_TAG_member)
    <2846a>   DW_AT_name        : x	
    <2846c>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
    <2846f>   DW_AT_type        : <0x27976>	
 <2><28477>: Abbrev Number: 0
 <1><28478>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <28479>   DW_AT_name        : *os.File	
    <28482>   DW_AT_type        : <0x2848b>	
    <2848a>   Unknown AT value: 2900: 22	
 <1><2848b>: Abbrev Number: 21 (DW_TAG_structure_type)
    <2848c>   DW_AT_name        : os.File	
    <28494>   DW_AT_byte_size   : 8	
    <28495>   Unknown AT value: 2900: 25	
 <2><28496>: Abbrev Number: 6 (DW_TAG_member)
    <28497>   DW_AT_name        : *os.file	
    <284a0>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <284a3>   DW_AT_type        : <0x284bd>	
 <2><284ab>: Abbrev Number: 0
 <1><284ac>: Abbrev Number: 22 (DW_TAG_typedef)
    <284ad>   DW_AT_name        : os.File	
    <284b5>   DW_AT_type        : <0x2848b>	
 <1><284bd>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <284be>   DW_AT_name        : *os.file	
    <284c7>   DW_AT_type        : <0x284d0>	
    <284cf>   Unknown AT value: 2900: 22	
 <1><284d0>: Abbrev Number: 21 (DW_TAG_structure_type)
    <284d1>   DW_AT_name        : os.file	
    <284d9>   DW_AT_byte_size   : 40	
    <284da>   Unknown AT value: 2900: 25	
 <2><284db>: Abbrev Number: 6 (DW_TAG_member)
    <284dc>   DW_AT_name        : fd	
    <284df>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <284e2>   DW_AT_type        : <0x271fd>	
 <2><284ea>: Abbrev Number: 6 (DW_TAG_member)
    <284eb>   DW_AT_name        : name	
    <284f0>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
    <284f3>   DW_AT_type        : <0x264da>	
 <2><284fb>: Abbrev Number: 6 (DW_TAG_member)
    <284fc>   DW_AT_name        : dirinfo	
    <28504>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
    <28507>   DW_AT_type        : <0x28534>	
 <2><2850f>: Abbrev Number: 6 (DW_TAG_member)
    <28510>   DW_AT_name        : nepipe	
    <28517>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
    <2851a>   DW_AT_type        : <0x26ed4>	
 <2><28522>: Abbrev Number: 0
 <1><28523>: Abbrev Number: 22 (DW_TAG_typedef)
    <28524>   DW_AT_name        : os.file	
    <2852c>   DW_AT_type        : <0x284d0>	
 <1><28534>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <28535>   DW_AT_name        : *os.dirInfo	
    <28541>   DW_AT_type        : <0x2854a>	
    <28549>   Unknown AT value: 2900: 22	
 <1><2854a>: Abbrev Number: 21 (DW_TAG_structure_type)
    <2854b>   DW_AT_name        : os.dirInfo	
    <28556>   DW_AT_byte_size   : 40	
    <28557>   Unknown AT value: 2900: 25	
 <2><28558>: Abbrev Number: 6 (DW_TAG_member)
    <28559>   DW_AT_name        : buf	
    <2855d>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <28560>   DW_AT_type        : <0x26cfd>	
 <2><28568>: Abbrev Number: 6 (DW_TAG_member)
    <28569>   DW_AT_name        : nbuf	
    <2856e>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
    <28571>   DW_AT_type        : <0x271fd>	
 <2><28579>: Abbrev Number: 6 (DW_TAG_member)
    <2857a>   DW_AT_name        : bufp	
    <2857f>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
    <28582>   DW_AT_type        : <0x271fd>	
 <2><2858a>: Abbrev Number: 0
 <1><2858b>: Abbrev Number: 22 (DW_TAG_typedef)
    <2858c>   DW_AT_name        : os.dirInfo	
    <28597>   DW_AT_type        : <0x2854a>	
 <1><2859f>: Abbrev Number: 15 (DW_TAG_typedef)
    <285a0>   DW_AT_name        : os.Signal	
    <285aa>   DW_AT_type        : <0x27144>	
    <285b2>   Unknown AT value: 2900: 20	
 <2><285b3>: Abbrev Number: 0
 <1><285b4>: Abbrev Number: 22 (DW_TAG_typedef)
    <285b5>   DW_AT_name        : os.Signal	
    <285bf>   DW_AT_type        : <0x2859f>	
 <1><285c7>: Abbrev Number: 14 (DW_TAG_subroutine_type)
    <285c8>   DW_AT_name        : func(error) bool	
    <285d9>   Unknown AT value: 2900: 19	
 <2><285da>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <285db>   DW_AT_type        : <0x27102>	
 <2><285e3>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <285e4>   DW_AT_type        : <0x28607>	
 <2><285ec>: Abbrev Number: 0
 <1><285ed>: Abbrev Number: 22 (DW_TAG_typedef)
    <285ee>   DW_AT_name        : func(error) bool	
    <285ff>   DW_AT_type        : <0x285c7>	
 <1><28607>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <28608>   DW_AT_name        : *bool	
    <2860e>   DW_AT_type        : <0x270a7>	
    <28616>   Unknown AT value: 2900: 0	
 <1><28617>: Abbrev Number: 14 (DW_TAG_subroutine_type)
    <28618>   DW_AT_name        : func(string) (os.FileInfo, error)	
    <2863a>   Unknown AT value: 2900: 19	
 <2><2863b>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <2863c>   DW_AT_type        : <0x264da>	
 <2><28644>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <28645>   DW_AT_type        : <0x286ae>	
 <2><2864d>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <2864e>   DW_AT_type        : <0x27698>	
 <2><28656>: Abbrev Number: 0
 <1><28657>: Abbrev Number: 22 (DW_TAG_typedef)
    <28658>   DW_AT_name        : func(string) (os.FileInfo, error)	
    <2867a>   DW_AT_type        : <0x28617>	
 <1><28682>: Abbrev Number: 15 (DW_TAG_typedef)
    <28683>   DW_AT_name        : os.FileInfo	
    <2868f>   DW_AT_type        : <0x27144>	
    <28697>   Unknown AT value: 2900: 20	
 <2><28698>: Abbrev Number: 0
 <1><28699>: Abbrev Number: 22 (DW_TAG_typedef)
    <2869a>   DW_AT_name        : os.FileInfo	
    <286a6>   DW_AT_type        : <0x28682>	
 <1><286ae>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <286af>   DW_AT_name        : *os.FileInfo	
    <286bc>   DW_AT_type        : <0x28682>	
    <286c4>   Unknown AT value: 2900: 0	
 <1><286c5>: Abbrev Number: 12 (DW_TAG_array_type)
    <286c6>   DW_AT_name        : [60]uint16	
    <286d1>   DW_AT_type        : <0x286e6>	
    <286d9>   DW_AT_byte_size   : 120	
    <286da>   Unknown AT value: 2900: 17	
 <2><286db>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <286dc>   DW_AT_type        : <0x26399>	
    <286e4>   DW_AT_count       : 60	
 <2><286e5>: Abbrev Number: 0
 <1><286e6>: Abbrev Number: 11 (DW_TAG_base_type)
    <286e7>   DW_AT_name        : uint16	
    <286ee>   DW_AT_encoding    : 7	(unsigned)
    <286ef>   DW_AT_byte_size   : 2	
    <286f0>   Unknown AT value: 2900: 9	
 <1><286f1>: Abbrev Number: 12 (DW_TAG_array_type)
    <286f2>   DW_AT_name        : [218]uint32	
    <286fe>   DW_AT_type        : <0x264b3>	
    <28706>   DW_AT_byte_size   : 872	
    <28708>   Unknown AT value: 2900: 17	
 <2><28709>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <2870a>   DW_AT_type        : <0x26399>	
    <28712>   DW_AT_count       : 218	
 <2><28714>: Abbrev Number: 0
 <1><28715>: Abbrev Number: 12 (DW_TAG_array_type)
    <28716>   DW_AT_name        : [136]uint16	
    <28722>   DW_AT_type        : <0x286e6>	
    <2872a>   DW_AT_byte_size   : 272	
    <2872c>   Unknown AT value: 2900: 17	
 <2><2872d>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <2872e>   DW_AT_type        : <0x26399>	
    <28736>   DW_AT_count       : 136	
 <2><28738>: Abbrev Number: 0
 <1><28739>: Abbrev Number: 12 (DW_TAG_array_type)
    <2873a>   DW_AT_name        : [470]uint16	
    <28746>   DW_AT_type        : <0x286e6>	
    <2874e>   DW_AT_byte_size   : 940	
    <28750>   Unknown AT value: 2900: 17	
 <2><28751>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <28752>   DW_AT_type        : <0x26399>	
    <2875a>   DW_AT_count       : 470	
 <2><2875c>: Abbrev Number: 0
 <1><2875d>: Abbrev Number: 12 (DW_TAG_array_type)
    <2875e>   DW_AT_name        : [28]strconv.leftCheat	
    <28774>   DW_AT_type        : <0x2878a>	
    <2877c>   DW_AT_byte_size   : 672	
    <2877e>   Unknown AT value: 2900: 17	
 <2><2877f>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <28780>   DW_AT_type        : <0x26399>	
    <28788>   DW_AT_count       : 28	
 <2><28789>: Abbrev Number: 0
 <1><2878a>: Abbrev Number: 21 (DW_TAG_structure_type)
    <2878b>   DW_AT_name        : strconv.leftCheat	
    <2879d>   DW_AT_byte_size   : 24	
    <2879e>   Unknown AT value: 2900: 25	
 <2><2879f>: Abbrev Number: 6 (DW_TAG_member)
    <287a0>   DW_AT_name        : delta	
    <287a6>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <287a9>   DW_AT_type        : <0x271fd>	
 <2><287b1>: Abbrev Number: 6 (DW_TAG_member)
    <287b2>   DW_AT_name        : cutoff	
    <287b9>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
    <287bc>   DW_AT_type        : <0x264da>	
 <2><287c4>: Abbrev Number: 0
 <1><287c5>: Abbrev Number: 22 (DW_TAG_typedef)
    <287c6>   DW_AT_name        : strconv.leftCheat	
    <287d8>   DW_AT_type        : <0x2878a>	
 <1><287e0>: Abbrev Number: 12 (DW_TAG_array_type)
    <287e1>   DW_AT_name        : [11]float32	
    <287ed>   DW_AT_type        : <0x28802>	
    <287f5>   DW_AT_byte_size   : 44	
    <287f6>   Unknown AT value: 2900: 17	
 <2><287f7>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <287f8>   DW_AT_type        : <0x26399>	
    <28800>   DW_AT_count       : 11	
 <2><28801>: Abbrev Number: 0
 <1><28802>: Abbrev Number: 11 (DW_TAG_base_type)
    <28803>   DW_AT_name        : float32	
    <2880b>   DW_AT_encoding    : 4	(float)
    <2880c>   DW_AT_byte_size   : 4	
    <2880d>   Unknown AT value: 2900: 13	
 <1><2880e>: Abbrev Number: 12 (DW_TAG_array_type)
    <2880f>   DW_AT_name        : [23]float64	
    <2881b>   DW_AT_type        : <0x26fd8>	
    <28823>   DW_AT_byte_size   : 184	
    <28825>   Unknown AT value: 2900: 17	
 <2><28826>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <28827>   DW_AT_type        : <0x26399>	
