Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x30aec (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  8
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_name        : go	
    <f>   DW_AT_language    : 22	(Go)
    <10>   DW_AT_low_pc      : 0x400c00	
    <18>   DW_AT_high_pc     : 0x483271	
    <20>   DW_AT_stmt_list   : 0x0	
 <1><24>: Abbrev Number: 2 (DW_TAG_subprogram)
    <25>   DW_AT_name        : main.main	
    <2f>   DW_AT_low_pc      : 0x400c00	
    <37>   DW_AT_high_pc     : 0x400f30	
    <3f>   DW_AT_external    : 1	
 <2><40>: Abbrev Number: 4 (DW_TAG_variable)
    <41>   DW_AT_name        : foo	
    <45>   DW_AT_location    : 5 byte block: 9c 11 98 7e 22 	(DW_OP_call_frame_cfa; DW_OP_consts: -232; DW_OP_plus)
    <4b>   DW_AT_type        : <0x2572a>	
 <2><53>: Abbrev Number: 4 (DW_TAG_variable)
    <54>   DW_AT_name        : baz	
    <58>   DW_AT_location    : 5 byte block: 9c 11 b8 7e 22 	(DW_OP_call_frame_cfa; DW_OP_consts: -200; DW_OP_plus)
    <5e>   DW_AT_type        : <0x285bb>	
 <2><66>: Abbrev Number: 4 (DW_TAG_variable)
    <67>   DW_AT_name        : bar	
    <6b>   DW_AT_location    : 5 byte block: 9c 11 f0 7e 22 	(DW_OP_call_frame_cfa; DW_OP_consts: -144; DW_OP_plus)
    <71>   DW_AT_type        : <0x24a46>	
 <2><79>: Abbrev Number: 4 (DW_TAG_variable)
    <7a>   DW_AT_name        : arr	

    <2462f>   DW_AT_location    : 4 byte block: 9c 11 60 22 	(DW_OP_call_frame_cfa; DW_OP_consts: -32; DW_OP_plus)
    <24634>   DW_AT_type        : <0x2572a>	
 <2><2463c>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <2463d>   DW_AT_name        : h	
    <2463f>   DW_AT_location    : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <24641>   DW_AT_type        : <0x25b75>	
 <2><24649>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <2464a>   DW_AT_name        : s	
    <2464c>   DW_AT_location    : 4 byte block: 9c 11 8 22 	(DW_OP_call_frame_cfa; DW_OP_consts: 8; DW_OP_plus)
    <24651>   DW_AT_type        : <0x24901>	
 <2><24659>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <2465a>   DW_AT_name        : p	
    <2465c>   DW_AT_location    : 4 byte block: 9c 11 10 22 	(DW_OP_call_frame_cfa; DW_OP_consts: 16; DW_OP_plus)
    <24661>   DW_AT_type        : <0x2af6c>	
 <2><24669>: Abbrev Number: 0
 <1><2466a>: Abbrev Number: 2 (DW_TAG_subprogram)
    <2466b>   DW_AT_name        : type..eq.[8]struct { a string; b float64 }	
    <24696>   DW_AT_low_pc      : 0x483060	
    <2469e>   DW_AT_high_pc     : 0x4831a0	
    <246a6>   DW_AT_external    : 1	
 <2><246a7>: Abbrev Number: 4 (DW_TAG_variable)
    <246a8>   DW_AT_name        : i	
    <246aa>   DW_AT_location    : 5 byte block: 9c 11 b0 7f 22 	(DW_OP_call_frame_cfa; DW_OP_consts: -80; DW_OP_plus)
    <246b0>   DW_AT_type        : <0x2572a>	
 <2><246b8>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <246b9>   DW_AT_name        : eq	
    <246bc>   DW_AT_location    : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <246be>   DW_AT_type        : <0x26a7f>	
 <2><246c6>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <246c7>   DW_AT_name        : s	
    <246c9>   DW_AT_location    : 4 byte block: 9c 11 8 22 	(DW_OP_call_frame_cfa; DW_OP_consts: 8; DW_OP_plus)
    <246ce>   DW_AT_type        : <0x24901>	
 <2><246d6>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <246d7>   DW_AT_name        : p	
    <246d9>   DW_AT_location    : 4 byte block: 9c 11 10 22 	(DW_OP_call_frame_cfa; DW_OP_consts: 16; DW_OP_plus)
    <246de>   DW_AT_type        : <0x2af6c>	
 <2><246e6>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <246e7>   DW_AT_name        : q	
    <246e9>   DW_AT_location    : 4 byte block: 9c 11 18 22 	(DW_OP_call_frame_cfa; DW_OP_consts: 24; DW_OP_plus)
    <246ee>   DW_AT_type        : <0x2af6c>	
 <2><246f6>: Abbrev Number: 0
 <1><246f7>: Abbrev Number: 2 (DW_TAG_subprogram)
    <246f8>   DW_AT_name        : sync/atomic.CompareAndSwapInt32	
    <24718>   DW_AT_low_pc      : 0x4831a0	
    <24720>   DW_AT_high_pc     : 0x4831b0	
    <24728>   DW_AT_external    : 1	
 <2><24729>: Abbrev Number: 0
 <1><2472a>: Abbrev Number: 2 (DW_TAG_subprogram)
    <2472b>   DW_AT_name        : sync/atomic.CompareAndSwapUint32	
    <2474c>   DW_AT_low_pc      : 0x4831b0	
    <24754>   DW_AT_high_pc     : 0x4831d0	
    <2475c>   DW_AT_external    : 1	
 <2><2475d>: Abbrev Number: 0
 <1><2475e>: Abbrev Number: 2 (DW_TAG_subprogram)
    <2475f>   DW_AT_name        : sync/atomic.AddInt32	
    <24774>   DW_AT_low_pc      : 0x4831d0	
    <2477c>   DW_AT_high_pc     : 0x4831e0	
    <24784>   DW_AT_external    : 1	
 <2><24785>: Abbrev Number: 0
 <1><24786>: Abbrev Number: 2 (DW_TAG_subprogram)
    <24787>   DW_AT_name        : sync/atomic.AddUint32	
    <2479d>   DW_AT_low_pc      : 0x4831e0	
    <247a5>   DW_AT_high_pc     : 0x483200	
    <247ad>   DW_AT_external    : 1	
 <2><247ae>: Abbrev Number: 0
 <1><247af>: Abbrev Number: 2 (DW_TAG_subprogram)
    <247b0>   DW_AT_name        : sync/atomic.LoadUint32	
    <247c7>   DW_AT_low_pc      : 0x483200	
    <247cf>   DW_AT_high_pc     : 0x483210	
    <247d7>   DW_AT_external    : 1	
 <2><247d8>: Abbrev Number: 0
 <1><247d9>: Abbrev Number: 2 (DW_TAG_subprogram)
    <247da>   DW_AT_name        : sync/atomic.LoadUintptr	
    <247f2>   DW_AT_low_pc      : 0x483210	
    <247fa>   DW_AT_high_pc     : 0x483220	
    <24802>   DW_AT_external    : 1	
 <2><24803>: Abbrev Number: 0
 <1><24804>: Abbrev Number: 2 (DW_TAG_subprogram)
    <24805>   DW_AT_name        : sync/atomic.LoadPointer	
    <2481d>   DW_AT_low_pc      : 0x483220	
    <24825>   DW_AT_high_pc     : 0x483230	
    <2482d>   DW_AT_external    : 1	
 <2><2482e>: Abbrev Number: 0
 <1><2482f>: Abbrev Number: 2 (DW_TAG_subprogram)
    <24830>   DW_AT_name        : sync/atomic.StoreInt32	
    <24847>   DW_AT_low_pc      : 0x483230	
    <2484f>   DW_AT_high_pc     : 0x483240	
    <24857>   DW_AT_external    : 1	
 <2><24858>: Abbrev Number: 0
 <1><24859>: Abbrev Number: 2 (DW_TAG_subprogram)
    <2485a>   DW_AT_name        : sync/atomic.StoreUint32	
    <24872>   DW_AT_low_pc      : 0x483240	
    <2487a>   DW_AT_high_pc     : 0x483250	
    <24882>   DW_AT_external    : 1	
 <2><24883>: Abbrev Number: 0
 <1><24884>: Abbrev Number: 2 (DW_TAG_subprogram)
    <24885>   DW_AT_name        : sync/atomic.StoreUintptr	
    <2489e>   DW_AT_low_pc      : 0x483250	
    <248a6>   DW_AT_high_pc     : 0x483260	
    <248ae>   DW_AT_external    : 1	
 <2><248af>: Abbrev Number: 0
 <1><248b0>: Abbrev Number: 2 (DW_TAG_subprogram)
    <248b1>   DW_AT_name        : sync/atomic.StorePointer	
    <248ca>   DW_AT_low_pc      : 0x483260	
    <248d2>   DW_AT_high_pc     : 0x483270	
    <248da>   DW_AT_external    : 1	
 <2><248db>: Abbrev Number: 0
 <1><248dc>: Abbrev Number: 10 (DW_TAG_unspecified_type)
    <248dd>   DW_AT_name        : <unspecified>	
 <1><248eb>: Abbrev Number: 10 (DW_TAG_unspecified_type)
    <248ec>   DW_AT_name        : void	
 <1><248f1>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <248f2>   DW_AT_name        : unsafe.Pointer	
 <1><24901>: Abbrev Number: 11 (DW_TAG_base_type)
    <24902>   DW_AT_name        : uintptr	
    <2490a>   DW_AT_encoding    : 7	(unsigned)
    <2490b>   DW_AT_byte_size   : 8	
 <1><2490c>: Abbrev Number: 21 (DW_TAG_structure_type)
    <2490d>   DW_AT_name        : runtime.rtype	
    <2491b>   DW_AT_byte_size   : 64	
 <2><2491c>: Abbrev Number: 6 (DW_TAG_member)
    <2491d>   DW_AT_name        : size	
    <24922>   DW_AT_data_member_location: 0 byte block: 	()
    <24923>   DW_AT_type        : <0x24901>	
 <2><2492b>: Abbrev Number: 6 (DW_TAG_member)
    <2492c>   DW_AT_name        : hash	
    <24931>   DW_AT_data_member_location: 3 byte block: 11 8 22 	(DW_OP_consts: 8; DW_OP_plus)
    <24935>   DW_AT_type        : <0x24a22>	
 <2><2493d>: Abbrev Number: 6 (DW_TAG_member)
    <2493e>   DW_AT_name        : _	
    <24940>   DW_AT_data_member_location: 3 byte block: 11 c 22 	(DW_OP_consts: 12; DW_OP_plus)
    <24944>   DW_AT_type        : <0x24a2c>	
 <2><2494c>: Abbrev Number: 6 (DW_TAG_member)
    <2494d>   DW_AT_name        : align	
    <24953>   DW_AT_data_member_location: 3 byte block: 11 d 22 	(DW_OP_consts: 13; DW_OP_plus)
    <24957>   DW_AT_type        : <0x24a2c>	
 <2><2495f>: Abbrev Number: 6 (DW_TAG_member)
    <24960>   DW_AT_name        : fieldAlign	
    <2496b>   DW_AT_data_member_location: 3 byte block: 11 e 22 	(DW_OP_consts: 14; DW_OP_plus)
    <2496f>   DW_AT_type        : <0x24a2c>	
 <2><24977>: Abbrev Number: 6 (DW_TAG_member)
    <24978>   DW_AT_name        : kind	
    <2497d>   DW_AT_data_member_location: 3 byte block: 11 f 22 	(DW_OP_consts: 15; DW_OP_plus)
    <24981>   DW_AT_type        : <0x24a2c>	
 <2><24989>: Abbrev Number: 6 (DW_TAG_member)
    <2498a>   DW_AT_name        : alg	
    <2498e>   DW_AT_data_member_location: 3 byte block: 11 10 22 	(DW_OP_consts: 16; DW_OP_plus)
    <24992>   DW_AT_type        : <0x248f1>	
 <2><2499a>: Abbrev Number: 6 (DW_TAG_member)
    <2499b>   DW_AT_name        : gc	
    <2499e>   DW_AT_data_member_location: 3 byte block: 11 18 22 	(DW_OP_consts: 24; DW_OP_plus)
    <249a2>   DW_AT_type        : <0x248f1>	
 <2><249aa>: Abbrev Number: 6 (DW_TAG_member)
    <249ab>   DW_AT_name        : string	
    <249b2>   DW_AT_data_member_location: 3 byte block: 11 20 22 	(DW_OP_consts: 32; DW_OP_plus)
    <249b6>   DW_AT_type        : <0x24a35>	
 <2><249be>: Abbrev Number: 6 (DW_TAG_member)
    <249bf>   DW_AT_name        : *runtime.uncommonType	
    <249d5>   DW_AT_data_member_location: 3 byte block: 11 28 22 	(DW_OP_consts: 40; DW_OP_plus)
    <249d9>   DW_AT_type        : <0x24a6f>	
 <2><249e1>: Abbrev Number: 6 (DW_TAG_member)
    <249e2>   DW_AT_name        : ptrToThis	
    <249ec>   DW_AT_data_member_location: 3 byte block: 11 30 22 	(DW_OP_consts: 48; DW_OP_plus)
    <249f0>   DW_AT_type        : <0x24bd9>	
 <2><249f8>: Abbrev Number: 6 (DW_TAG_member)
    <249f9>   DW_AT_name        : zero	
    <249fe>   DW_AT_data_member_location: 3 byte block: 11 38 22 	(DW_OP_consts: 56; DW_OP_plus)
    <24a02>   DW_AT_type        : <0x248f1>	
 <2><24a0a>: Abbrev Number: 0
 <1><24a0b>: Abbrev Number: 22 (DW_TAG_typedef)
    <24a0c>   DW_AT_name        : runtime.rtype	
    <24a1a>   DW_AT_type        : <0x2490c>	
 <1><24a22>: Abbrev Number: 11 (DW_TAG_base_type)
    <24a23>   DW_AT_name        : uint32	
    <24a2a>   DW_AT_encoding    : 7	(unsigned)
    <24a2b>   DW_AT_byte_size   : 4	
 <1><24a2c>: Abbrev Number: 11 (DW_TAG_base_type)
    <24a2d>   DW_AT_name        : uint8	
    <24a33>   DW_AT_encoding    : 7	(unsigned)
    <24a34>   DW_AT_byte_size   : 1	
 <1><24a35>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <24a36>   DW_AT_name        : *string	
    <24a3e>   DW_AT_type        : <0x24a46>	
 <1><24a46>: Abbrev Number: 20 (DW_TAG_structure_type)
    <24a47>   DW_AT_name        : string	
    <24a4e>   DW_AT_byte_size   : 16	
 <2><24a4f>: Abbrev Number: 6 (DW_TAG_member)
    <24a50>   DW_AT_name        : str	
    <24a54>   DW_AT_data_member_location: 0 byte block: 	()
    <24a55>   DW_AT_type        : <0x250d2>	
 <2><24a5d>: Abbrev Number: 6 (DW_TAG_member)
    <24a5e>   DW_AT_name        : len	
    <24a62>   DW_AT_data_member_location: 3 byte block: 11 8 22 	(DW_OP_consts: 8; DW_OP_plus)
    <24a66>   DW_AT_type        : <0x255d4>	
 <2><24a6e>: Abbrev Number: 0
 <1><24a6f>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <24a70>   DW_AT_name        : *runtime.uncommonType	
    <24a86>   DW_AT_type        : <0x24a8e>	
 <1><24a8e>: Abbrev Number: 21 (DW_TAG_structure_type)
    <24a8f>   DW_AT_name        : runtime.uncommonType	
    <24aa4>   DW_AT_byte_size   : 40	
 <2><24aa5>: Abbrev Number: 6 (DW_TAG_member)
    <24aa6>   DW_AT_name        : name	
    <24aab>   DW_AT_data_member_location: 0 byte block: 	()
    <24aac>   DW_AT_type        : <0x24a35>	
 <2><24ab4>: Abbrev Number: 6 (DW_TAG_member)
    <24ab5>   DW_AT_name        : pkgPath	
    <24abd>   DW_AT_data_member_location: 3 byte block: 11 8 22 	(DW_OP_consts: 8; DW_OP_plus)
    <24ac1>   DW_AT_type        : <0x24a35>	
 <2><24ac9>: Abbrev Number: 6 (DW_TAG_member)
    <24aca>   DW_AT_name        : methods	
    <24ad2>   DW_AT_data_member_location: 3 byte block: 11 10 22 	(DW_OP_consts: 16; DW_OP_plus)
    <24ad6>   DW_AT_type        : <0x24afd>	
 <2><24ade>: Abbrev Number: 0
 <1><24adf>: Abbrev Number: 22 (DW_TAG_typedef)
    <24ae0>   DW_AT_name        : runtime.uncommonType	
    <24af5>   DW_AT_type        : <0x24a8e>	
 <1><24afd>: Abbrev Number: 19 (DW_TAG_structure_type)
    <24afe>   DW_AT_name        : []runtime._method	
    <24b10>   DW_AT_byte_size   : 24	
 <2><24b11>: Abbrev Number: 6 (DW_TAG_member)
    <24b12>   DW_AT_name        : array	
    <24b18>   DW_AT_data_member_location: 0 byte block: 	()
    <24b19>   DW_AT_type        : <0x2b081>	
 <2><24b21>: Abbrev Number: 6 (DW_TAG_member)
    <24b22>   DW_AT_name        : len	
    <24b26>   DW_AT_data_member_location: 3 byte block: 11 8 22 	(DW_OP_consts: 8; DW_OP_plus)
    <24b2a>   DW_AT_type        : <0x24f2b>	
 <2><24b32>: Abbrev Number: 6 (DW_TAG_member)
    <24b33>   DW_AT_name        : cap	
    <24b37>   DW_AT_data_member_location: 3 byte block: 11 10 22 	(DW_OP_consts: 16; DW_OP_plus)
    <24b3b>   DW_AT_type        : <0x24f2b>	
 <2><24b43>: Abbrev Number: 0
 <1><24b44>: Abbrev Number: 21 (DW_TAG_structure_type)
    <24b45>   DW_AT_name        : runtime._method	
    <24b55>   DW_AT_byte_size   : 48	
 <2><24b56>: Abbrev Number: 6 (DW_TAG_member)
    <24b57>   DW_AT_name        : name	
    <24b5c>   DW_AT_data_member_location: 0 byte block: 	()
    <24b5d>   DW_AT_type        : <0x24a35>	
 <2><24b65>: Abbrev Number: 6 (DW_TAG_member)
    <24b66>   DW_AT_name        : pkgPath	
    <24b6e>   DW_AT_data_member_location: 3 byte block: 11 8 22 	(DW_OP_consts: 8; DW_OP_plus)
    <24b72>   DW_AT_type        : <0x24a35>	
 <2><24b7a>: Abbrev Number: 6 (DW_TAG_member)
    <24b7b>   DW_AT_name        : mtyp	
    <24b80>   DW_AT_data_member_location: 3 byte block: 11 10 22 	(DW_OP_consts: 16; DW_OP_plus)
    <24b84>   DW_AT_type        : <0x24bd9>	
 <2><24b8c>: Abbrev Number: 6 (DW_TAG_member)
    <24b8d>   DW_AT_name        : typ	
    <24b91>   DW_AT_data_member_location: 3 byte block: 11 18 22 	(DW_OP_consts: 24; DW_OP_plus)
    <24b95>   DW_AT_type        : <0x24bd9>	
 <2><24b9d>: Abbrev Number: 6 (DW_TAG_member)
    <24b9e>   DW_AT_name        : ifn	
    <24ba2>   DW_AT_data_member_location: 3 byte block: 11 20 22 	(DW_OP_consts: 32; DW_OP_plus)
    <24ba6>   DW_AT_type        : <0x248f1>	
 <2><24bae>: Abbrev Number: 6 (DW_TAG_member)
    <24baf>   DW_AT_name        : tfn	
    <24bb3>   DW_AT_data_member_location: 3 byte block: 11 28 22 	(DW_OP_consts: 40; DW_OP_plus)
    <24bb7>   DW_AT_type        : <0x248f1>	
 <2><24bbf>: Abbrev Number: 0
 <1><24bc0>: Abbrev Number: 22 (DW_TAG_typedef)
    <24bc1>   DW_AT_name        : runtime._method	
    <24bd1>   DW_AT_type        : <0x24b44>	
 <1><24bd9>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <24bda>   DW_AT_name        : *runtime.rtype	
    <24be9>   DW_AT_type        : <0x24a0b>	
 <1><24bf1>: Abbrev Number: 21 (DW_TAG_structure_type)
    <24bf2>   DW_AT_name        : runtime.interfaceType	
    <24c08>   DW_AT_byte_size   : 88	
 <2><24c09>: Abbrev Number: 6 (DW_TAG_member)
    <24c0a>   DW_AT_name        : runtime.rtype	
    <24c18>   DW_AT_data_member_location: 0 byte block: 	()
    <24c19>   DW_AT_type        : <0x24a0b>	
 <2><24c21>: Abbrev Number: 6 (DW_TAG_member)
    <24c22>   DW_AT_name        : methods	
    <24c2a>   DW_AT_data_member_location: 4 byte block: 11 c0 0 22 	(DW_OP_consts: 64; DW_OP_plus)
    <24c2f>   DW_AT_type        : <0x24c57>	
 <2><24c37>: Abbrev Number: 0
 <1><24c38>: Abbrev Number: 22 (DW_TAG_typedef)
    <24c39>   DW_AT_name        : runtime.interfaceType	
    <24c4f>   DW_AT_type        : <0x24bf1>	
 <1><24c57>: Abbrev Number: 19 (DW_TAG_structure_type)
    <24c58>   DW_AT_name        : []runtime._imethod	
    <24c6b>   DW_AT_byte_size   : 24	
 <2><24c6c>: Abbrev Number: 6 (DW_TAG_member)
    <24c6d>   DW_AT_name        : array	
    <24c73>   DW_AT_data_member_location: 0 byte block: 	()
    <24c74>   DW_AT_type        : <0x2b066>	
 <2><24c7c>: Abbrev Number: 6 (DW_TAG_member)
    <24c7d>   DW_AT_name        : len	
    <24c81>   DW_AT_data_member_location: 3 byte block: 11 8 22 	(DW_OP_consts: 8; DW_OP_plus)
    <24c85>   DW_AT_type        : <0x24f2b>	
 <2><24c8d>: Abbrev Number: 6 (DW_TAG_member)
    <24c8e>   DW_AT_name        : cap	
    <24c92>   DW_AT_data_member_location: 3 byte block: 11 10 22 	(DW_OP_consts: 16; DW_OP_plus)
    <24c96>   DW_AT_type        : <0x24f2b>	
 <2><24c9e>: Abbrev Number: 0
 <1><24c9f>: Abbrev Number: 21 (DW_TAG_structure_type)
    <24ca0>   DW_AT_name        : runtime._imethod	
    <24cb1>   DW_AT_byte_size   : 24	
 <2><24cb2>: Abbrev Number: 6 (DW_TAG_member)
    <24cb3>   DW_AT_name        : name	
    <24cb8>   DW_AT_data_member_location: 0 byte block: 	()
    <24cb9>   DW_AT_type        : <0x24a35>	
 <2><24cc1>: Abbrev Number: 6 (DW_TAG_member)
    <24cc2>   DW_AT_name        : pkgPath	
    <24cca>   DW_AT_data_member_location: 3 byte block: 11 8 22 	(DW_OP_consts: 8; DW_OP_plus)
    <24cce>   DW_AT_type        : <0x24a35>	
 <2><24cd6>: Abbrev Number: 6 (DW_TAG_member)
    <24cd7>   DW_AT_name        : typ	
    <24cdb>   DW_AT_data_member_location: 3 byte block: 11 10 22 	(DW_OP_consts: 16; DW_OP_plus)
    <24cdf>   DW_AT_type        : <0x24bd9>	
 <2><24ce7>: Abbrev Number: 0
 <1><24ce8>: Abbrev Number: 22 (DW_TAG_typedef)
    <24ce9>   DW_AT_name        : runtime._imethod	
    <24cfa>   DW_AT_type        : <0x24c9f>	
 <1><24d02>: Abbrev Number: 21 (DW_TAG_structure_type)
    <24d03>   DW_AT_name        : runtime.itab	
    <24d10>   DW_AT_byte_size   : 32	
 <2><24d11>: Abbrev Number: 6 (DW_TAG_member)
    <24d12>   DW_AT_name        : inter	
    <24d18>   DW_AT_data_member_location: 0 byte block: 	()
    <24d19>   DW_AT_type        : <0x24d93>	
 <2><24d21>: Abbrev Number: 6 (DW_TAG_member)
    <24d22>   DW_AT_name        : _type	
    <24d28>   DW_AT_data_member_location: 3 byte block: 11 8 22 	(DW_OP_consts: 8; DW_OP_plus)
    <24d2c>   DW_AT_type        : <0x2534a>	
 <2><24d34>: Abbrev Number: 6 (DW_TAG_member)
    <24d35>   DW_AT_name        : link	
    <24d3a>   DW_AT_data_member_location: 3 byte block: 11 10 22 	(DW_OP_consts: 16; DW_OP_plus)
    <24d3e>   DW_AT_type        : <0x25406>	
 <2><24d46>: Abbrev Number: 6 (DW_TAG_member)
    <24d47>   DW_AT_name        : bad	
    <24d4b>   DW_AT_data_member_location: 3 byte block: 11 18 22 	(DW_OP_consts: 24; DW_OP_plus)
    <24d4f>   DW_AT_type        : <0x2541d>	
 <2><24d57>: Abbrev Number: 6 (DW_TAG_member)
    <24d58>   DW_AT_name        : unused	
    <24d5f>   DW_AT_data_member_location: 3 byte block: 11 1c 22 	(DW_OP_consts: 28; DW_OP_plus)
    <24d63>   DW_AT_type        : <0x2541d>	
 <2><24d6b>: Abbrev Number: 6 (DW_TAG_member)
    <24d6c>   DW_AT_name        : fun	
    <24d70>   DW_AT_data_member_location: 3 byte block: 11 20 22 	(DW_OP_consts: 32; DW_OP_plus)
    <24d74>   DW_AT_type        : <0x25426>	
 <2><24d7c>: Abbrev Number: 0
 <1><24d7d>: Abbrev Number: 22 (DW_TAG_typedef)
    <24d7e>   DW_AT_name        : runtime.itab	
    <24d8b>   DW_AT_type        : <0x24d02>	
 <1><24d93>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <24d94>   DW_AT_name        : *runtime.interfacetype	
    <24dab>   DW_AT_type        : <0x24db3>	
 <1><24db3>: Abbrev Number: 21 (DW_TAG_structure_type)
    <24db4>   DW_AT_name        : runtime.interfacetype	
    <24dca>   DW_AT_byte_size   : 88	
 <2><24dcb>: Abbrev Number: 6 (DW_TAG_member)
    <24dcc>   DW_AT_name        : runtime._type	
    <24dda>   DW_AT_data_member_location: 0 byte block: 	()
    <24ddb>   DW_AT_type        : <0x24e26>	
 <2><24de3>: Abbrev Number: 6 (DW_TAG_member)
    <24de4>   DW_AT_name        : mhdr	
    <24de9>   DW_AT_data_member_location: 4 byte block: 11 c0 0 22 	(DW_OP_consts: 64; DW_OP_plus)
    <24dee>   DW_AT_type        : <0x25253>	
 <2><24df6>: Abbrev Number: 6 (DW_TAG_member)
    <24df7>   DW_AT_name        : m	
    <24df9>   DW_AT_data_member_location: 4 byte block: 11 d8 0 22 	(DW_OP_consts: 88; DW_OP_plus)
    <24dfe>   DW_AT_type        : <0x2537b>	
 <2><24e06>: Abbrev Number: 0
 <1><24e07>: Abbrev Number: 22 (DW_TAG_typedef)
    <24e08>   DW_AT_name        : runtime.interfacetype	
    <24e1e>   DW_AT_type        : <0x24db3>	
 <1><24e26>: Abbrev Number: 21 (DW_TAG_structure_type)
    <24e27>   DW_AT_name        : runtime._type	
    <24e35>   DW_AT_byte_size   : 64	
 <2><24e36>: Abbrev Number: 6 (DW_TAG_member)
    <24e37>   DW_AT_name        : size	
    <24e3c>   DW_AT_data_member_location: 0 byte block: 	()
    <24e3d>   DW_AT_type        : <0x24f2b>	
 <2><24e45>: Abbrev Number: 6 (DW_TAG_member)
    <24e46>   DW_AT_name        : hash	
    <24e4b>   DW_AT_data_member_location: 3 byte block: 11 8 22 	(DW_OP_consts: 8; DW_OP_plus)
    <24e4f>   DW_AT_type        : <0x24a22>	
 <2><24e57>: Abbrev Number: 6 (DW_TAG_member)
    <24e58>   DW_AT_name        : _unused	
    <24e60>   DW_AT_data_member_location: 3 byte block: 11 c 22 	(DW_OP_consts: 12; DW_OP_plus)
    <24e64>   DW_AT_type        : <0x24a2c>	
 <2><24e6c>: Abbrev Number: 6 (DW_TAG_member)
    <24e6d>   DW_AT_name        : align	
    <24e73>   DW_AT_data_member_location: 3 byte block: 11 d 22 	(DW_OP_consts: 13; DW_OP_plus)
    <24e77>   DW_AT_type        : <0x24a2c>	
 <2><24e7f>: Abbrev Number: 6 (DW_TAG_member)
    <24e80>   DW_AT_name        : fieldalign	
    <24e8b>   DW_AT_data_member_location: 3 byte block: 11 e 22 	(DW_OP_consts: 14; DW_OP_plus)
    <24e8f>   DW_AT_type        : <0x24a2c>	
 <2><24e97>: Abbrev Number: 6 (DW_TAG_member)
    <24e98>   DW_AT_name        : kind	
    <24e9d>   DW_AT_data_member_location: 3 byte block: 11 f 22 	(DW_OP_consts: 15; DW_OP_plus)
    <24ea1>   DW_AT_type        : <0x24a2c>	
 <2><24ea9>: Abbrev Number: 6 (DW_TAG_member)
    <24eaa>   DW_AT_name        : alg	
    <24eae>   DW_AT_data_member_location: 3 byte block: 11 10 22 	(DW_OP_consts: 16; DW_OP_plus)
    <24eb2>   DW_AT_type        : <0x24f35>	
 <2><24eba>: Abbrev Number: 6 (DW_TAG_member)
    <24ebb>   DW_AT_name        : gc	
    <24ebe>   DW_AT_data_member_location: 3 byte block: 11 18 22 	(DW_OP_consts: 24; DW_OP_plus)
    <24ec2>   DW_AT_type        : <0x248f1>	
 <2><24eca>: Abbrev Number: 6 (DW_TAG_member)
    <24ecb>   DW_AT_name        : _string	
    <24ed3>   DW_AT_data_member_location: 3 byte block: 11 20 22 	(DW_OP_consts: 32; DW_OP_plus)
    <24ed7>   DW_AT_type        : <0x24a35>	
 <2><24edf>: Abbrev Number: 6 (DW_TAG_member)
    <24ee0>   DW_AT_name        : x	
    <24ee2>   DW_AT_data_member_location: 3 byte block: 11 28 22 	(DW_OP_consts: 40; DW_OP_plus)
    <24ee6>   DW_AT_type        : <0x251b9>	
 <2><24eee>: Abbrev Number: 6 (DW_TAG_member)
    <24eef>   DW_AT_name        : ptrto	
    <24ef5>   DW_AT_data_member_location: 3 byte block: 11 30 22 	(DW_OP_consts: 48; DW_OP_plus)
    <24ef9>   DW_AT_type        : <0x2534a>	
 <2><24f01>: Abbrev Number: 6 (DW_TAG_member)
    <24f02>   DW_AT_name        : zero	
    <24f07>   DW_AT_data_member_location: 3 byte block: 11 38 22 	(DW_OP_consts: 56; DW_OP_plus)
    <24f0b>   DW_AT_type        : <0x250d2>	
 <2><24f13>: Abbrev Number: 0
 <1><24f14>: Abbrev Number: 22 (DW_TAG_typedef)
    <24f15>   DW_AT_name        : runtime._type	
    <24f23>   DW_AT_type        : <0x24e26>	
 <1><24f2b>: Abbrev Number: 11 (DW_TAG_base_type)
    <24f2c>   DW_AT_name        : uint64	
    <24f33>   DW_AT_encoding    : 7	(unsigned)
    <24f34>   DW_AT_byte_size   : 8	
 <1><24f35>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <24f36>   DW_AT_name        : *runtime.alg	
    <24f43>   DW_AT_type        : <0x24f4b>	
 <1><24f4b>: Abbrev Number: 21 (DW_TAG_structure_type)
    <24f4c>   DW_AT_name        : runtime.alg	
    <24f58>   DW_AT_byte_size   : 32	
 <2><24f59>: Abbrev Number: 6 (DW_TAG_member)
    <24f5a>   DW_AT_name        : hash	
    <24f5f>   DW_AT_data_member_location: 0 byte block: 	()
    <24f60>   DW_AT_type        : <0x24fb6>	
 <2><24f68>: Abbrev Number: 6 (DW_TAG_member)
    <24f69>   DW_AT_name        : equal	
    <24f6f>   DW_AT_data_member_location: 3 byte block: 11 8 22 	(DW_OP_consts: 8; DW_OP_plus)
    <24f73>   DW_AT_type        : <0x25039>	
 <2><24f7b>: Abbrev Number: 6 (DW_TAG_member)
    <24f7c>   DW_AT_name        : print	
    <24f82>   DW_AT_data_member_location: 3 byte block: 11 10 22 	(DW_OP_consts: 16; DW_OP_plus)
    <24f86>   DW_AT_type        : <0x250e2>	
 <2><24f8e>: Abbrev Number: 6 (DW_TAG_member)
    <24f8f>   DW_AT_name        : copy	
    <24f94>   DW_AT_data_member_location: 3 byte block: 11 18 22 	(DW_OP_consts: 24; DW_OP_plus)
    <24f98>   DW_AT_type        : <0x25139>	
 <2><24fa0>: Abbrev Number: 0
 <1><24fa1>: Abbrev Number: 22 (DW_TAG_typedef)
    <24fa2>   DW_AT_name        : runtime.alg	
    <24fae>   DW_AT_type        : <0x24f4b>	
 <1><24fb6>: Abbrev Number: 14 (DW_TAG_subroutine_type)
    <24fb7>   DW_AT_name        : func(*uint64, uint64, unsafe.Pointer)	
 <2><24fdd>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <24fde>   DW_AT_type        : <0x25028>	
 <2><24fe6>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <24fe7>   DW_AT_type        : <0x24f2b>	
 <2><24fef>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <24ff0>   DW_AT_type        : <0x248f1>	
 <2><24ff8>: Abbrev Number: 0
 <1><24ff9>: Abbrev Number: 22 (DW_TAG_typedef)
    <24ffa>   DW_AT_name        : func(*uint64, uint64, unsafe.Pointer)	
    <25020>   DW_AT_type        : <0x24fb6>	
 <1><25028>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <25029>   DW_AT_name        : *uint64	
    <25031>   DW_AT_type        : <0x24f2b>	
 <1><25039>: Abbrev Number: 14 (DW_TAG_subroutine_type)
    <2503a>   DW_AT_name        : func(*uint8, uint64, unsafe.Pointer, unsafe.Pointer)	
 <2><2506f>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <25070>   DW_AT_type        : <0x250d2>	
 <2><25078>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <25079>   DW_AT_type        : <0x24f2b>	
 <2><25081>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <25082>   DW_AT_type        : <0x248f1>	
 <2><2508a>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <2508b>   DW_AT_type        : <0x248f1>	
 <2><25093>: Abbrev Number: 0
 <1><25094>: Abbrev Number: 22 (DW_TAG_typedef)
    <25095>   DW_AT_name        : func(*uint8, uint64, unsafe.Pointer, unsafe.Pointer)	
    <250ca>   DW_AT_type        : <0x25039>	
 <1><250d2>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <250d3>   DW_AT_name        : *uint8	
    <250da>   DW_AT_type        : <0x24a2c>	
 <1><250e2>: Abbrev Number: 14 (DW_TAG_subroutine_type)
    <250e3>   DW_AT_name        : func(uint64, unsafe.Pointer)	
 <2><25100>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <25101>   DW_AT_type        : <0x24f2b>	
 <2><25109>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <2510a>   DW_AT_type        : <0x248f1>	
 <2><25112>: Abbrev Number: 0
 <1><25113>: Abbrev Number: 22 (DW_TAG_typedef)
    <25114>   DW_AT_name        : func(uint64, unsafe.Pointer)	
    <25131>   DW_AT_type        : <0x250e2>	
 <1><25139>: Abbrev Number: 14 (DW_TAG_subroutine_type)
    <2513a>   DW_AT_name        : func(uint64, unsafe.Pointer, unsafe.Pointer)	
 <2><25167>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <25168>   DW_AT_type        : <0x24f2b>	
 <2><25170>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <25171>   DW_AT_type        : <0x248f1>	
 <2><25179>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <2517a>   DW_AT_type        : <0x248f1>	
 <2><25182>: Abbrev Number: 0
 <1><25183>: Abbrev Number: 22 (DW_TAG_typedef)
    <25184>   DW_AT_name        : func(uint64, unsafe.Pointer, unsafe.Pointer)	
    <251b1>   DW_AT_type        : <0x25139>	
 <1><251b9>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <251ba>   DW_AT_name        : *runtime.uncommontype	
    <251d0>   DW_AT_type        : <0x251d8>	
 <1><251d8>: Abbrev Number: 21 (DW_TAG_structure_type)
    <251d9>   DW_AT_name        : runtime.uncommontype	
    <251ee>   DW_AT_byte_size   : 40	
 <2><251ef>: Abbrev Number: 6 (DW_TAG_member)
    <251f0>   DW_AT_name        : name	
    <251f5>   DW_AT_data_member_location: 0 byte block: 	()
    <251f6>   DW_AT_type        : <0x24a35>	
 <2><251fe>: Abbrev Number: 6 (DW_TAG_member)
    <251ff>   DW_AT_name        : pkgpath	
    <25207>   DW_AT_data_member_location: 3 byte block: 11 8 22 	(DW_OP_consts: 8; DW_OP_plus)
    <2520b>   DW_AT_type        : <0x24a35>	
 <2><25213>: Abbrev Number: 6 (DW_TAG_member)
    <25214>   DW_AT_name        : mhdr	
    <25219>   DW_AT_data_member_location: 3 byte block: 11 10 22 	(DW_OP_consts: 16; DW_OP_plus)
    <2521d>   DW_AT_type        : <0x25253>	
 <2><25225>: Abbrev Number: 6 (DW_TAG_member)
    <25226>   DW_AT_name        : m	
    <25228>   DW_AT_data_member_location: 3 byte block: 11 28 22 	(DW_OP_consts: 40; DW_OP_plus)
    <2522c>   DW_AT_type        : <0x25290>	
 <2><25234>: Abbrev Number: 0
 <1><25235>: Abbrev Number: 22 (DW_TAG_typedef)
    <25236>   DW_AT_name        : runtime.uncommontype	
    <2524b>   DW_AT_type        : <0x251d8>	
 <1><25253>: Abbrev Number: 19 (DW_TAG_structure_type)
    <25254>   DW_AT_name        : []uint8	
    <2525c>   DW_AT_byte_size   : 24	
 <2><2525d>: Abbrev Number: 6 (DW_TAG_member)
    <2525e>   DW_AT_name        : array	
    <25264>   DW_AT_data_member_location: 0 byte block: 	()
    <25265>   DW_AT_type        : <0x250d2>	
 <2><2526d>: Abbrev Number: 6 (DW_TAG_member)
    <2526e>   DW_AT_name        : len	
    <25272>   DW_AT_data_member_location: 3 byte block: 11 8 22 	(DW_OP_consts: 8; DW_OP_plus)
    <25276>   DW_AT_type        : <0x24f2b>	
 <2><2527e>: Abbrev Number: 6 (DW_TAG_member)
    <2527f>   DW_AT_name        : cap	
    <25283>   DW_AT_data_member_location: 3 byte block: 11 10 22 	(DW_OP_consts: 16; DW_OP_plus)
    <25287>   DW_AT_type        : <0x24f2b>	
 <2><2528f>: Abbrev Number: 0
 <1><25290>: Abbrev Number: 12 (DW_TAG_array_type)
    <25291>   DW_AT_name        : [0]runtime.method	
    <252a3>   DW_AT_type        : <0x252b7>	
    <252ab>   DW_AT_byte_size   : 0	
 <2><252ac>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <252ad>   DW_AT_type        : <0x24901>	
    <252b5>   DW_AT_upper_bound : 0	
 <2><252b6>: Abbrev Number: 0
 <1><252b7>: Abbrev Number: 21 (DW_TAG_structure_type)
    <252b8>   DW_AT_name        : runtime.method	
    <252c7>   DW_AT_byte_size   : 48	
 <2><252c8>: Abbrev Number: 6 (DW_TAG_member)
    <252c9>   DW_AT_name        : name	
    <252ce>   DW_AT_data_member_location: 0 byte block: 	()
    <252cf>   DW_AT_type        : <0x24a35>	
 <2><252d7>: Abbrev Number: 6 (DW_TAG_member)
    <252d8>   DW_AT_name        : pkgpath	
    <252e0>   DW_AT_data_member_location: 3 byte block: 11 8 22 	(DW_OP_consts: 8; DW_OP_plus)
    <252e4>   DW_AT_type        : <0x24a35>	
 <2><252ec>: Abbrev Number: 6 (DW_TAG_member)
    <252ed>   DW_AT_name        : mtyp	
    <252f2>   DW_AT_data_member_location: 3 byte block: 11 10 22 	(DW_OP_consts: 16; DW_OP_plus)
    <252f6>   DW_AT_type        : <0x2534a>	
 <2><252fe>: Abbrev Number: 6 (DW_TAG_member)
    <252ff>   DW_AT_name        : typ	
    <25303>   DW_AT_data_member_location: 3 byte block: 11 18 22 	(DW_OP_consts: 24; DW_OP_plus)
    <25307>   DW_AT_type        : <0x2534a>	
 <2><2530f>: Abbrev Number: 6 (DW_TAG_member)
    <25310>   DW_AT_name        : ifn	
    <25314>   DW_AT_data_member_location: 3 byte block: 11 20 22 	(DW_OP_consts: 32; DW_OP_plus)
    <25318>   DW_AT_type        : <0x25362>	
 <2><25320>: Abbrev Number: 6 (DW_TAG_member)
    <25321>   DW_AT_name        : tfn	
    <25325>   DW_AT_data_member_location: 3 byte block: 11 28 22 	(DW_OP_consts: 40; DW_OP_plus)
    <25329>   DW_AT_type        : <0x2536b>	
 <2><25331>: Abbrev Number: 0
 <1><25332>: Abbrev Number: 22 (DW_TAG_typedef)
    <25333>   DW_AT_name        : runtime.method	
    <25342>   DW_AT_type        : <0x252b7>	
 <1><2534a>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <2534b>   DW_AT_name        : *runtime._type	
    <2535a>   DW_AT_type        : <0x24f14>	
 <1><25362>: Abbrev Number: 14 (DW_TAG_subroutine_type)
    <25363>   DW_AT_name        : func()	
 <2><2536a>: Abbrev Number: 0
 <1><2536b>: Abbrev Number: 22 (DW_TAG_typedef)
    <2536c>   DW_AT_name        : func()	
    <25373>   DW_AT_type        : <0x25362>	
 <1><2537b>: Abbrev Number: 12 (DW_TAG_array_type)
    <2537c>   DW_AT_name        : [0]runtime.imethod	
    <2538f>   DW_AT_type        : <0x253a3>	
    <25397>   DW_AT_byte_size   : 0	
 <2><25398>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <25399>   DW_AT_type        : <0x24901>	
    <253a1>   DW_AT_upper_bound : 64	
 <2><253a2>: Abbrev Number: 0
 <1><253a3>: Abbrev Number: 21 (DW_TAG_structure_type)
    <253a4>   DW_AT_name        : runtime.imethod	
    <253b4>   DW_AT_byte_size   : 24	
 <2><253b5>: Abbrev Number: 6 (DW_TAG_member)
    <253b6>   DW_AT_name        : name	
    <253bb>   DW_AT_data_member_location: 0 byte block: 	()
    <253bc>   DW_AT_type        : <0x24a35>	
 <2><253c4>: Abbrev Number: 6 (DW_TAG_member)
    <253c5>   DW_AT_name        : pkgpath	
    <253cd>   DW_AT_data_member_location: 3 byte block: 11 8 22 	(DW_OP_consts: 8; DW_OP_plus)
    <253d1>   DW_AT_type        : <0x24a35>	
 <2><253d9>: Abbrev Number: 6 (DW_TAG_member)
    <253da>   DW_AT_name        : _type	
    <253e0>   DW_AT_data_member_location: 3 byte block: 11 10 22 	(DW_OP_consts: 16; DW_OP_plus)
    <253e4>   DW_AT_type        : <0x2534a>	
 <2><253ec>: Abbrev Number: 0
 <1><253ed>: Abbrev Number: 22 (DW_TAG_typedef)
    <253ee>   DW_AT_name        : runtime.imethod	
    <253fe>   DW_AT_type        : <0x253a3>	
 <1><25406>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <25407>   DW_AT_name        : *runtime.itab	
    <25415>   DW_AT_type        : <0x24d7d>	
 <1><2541d>: Abbrev Number: 11 (DW_TAG_base_type)
    <2541e>   DW_AT_name        : int32	
    <25424>   DW_AT_encoding    : 5	(signed)
    <25425>   DW_AT_byte_size   : 4	
 <1><25426>: Abbrev Number: 12 (DW_TAG_array_type)
    <25427>   DW_AT_name        : [0]func()	
    <25431>   DW_AT_type        : <0x2536b>	
    <25439>   DW_AT_byte_size   : 0	
 <2><2543a>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <2543b>   DW_AT_type        : <0x24901>	
    <25443>   DW_AT_upper_bound : 0	
 <2><25444>: Abbrev Number: 0
 <1><25445>: Abbrev Number: 12 (DW_TAG_array_type)
    <25446>   DW_AT_name        : [13]string	
    <25451>   DW_AT_type        : <0x24a46>	
    <25459>   DW_AT_byte_size   : 208	
 <2><2545b>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <2545c>   DW_AT_type        : <0x24901>	
    <25464>   DW_AT_upper_bound : 32	
 <2><25465>: Abbrev Number: 0
 <1><25466>: Abbrev Number: 12 (DW_TAG_array_type)
    <25467>   DW_AT_name        : [7]string	
    <25471>   DW_AT_type        : <0x24a46>	
    <25479>   DW_AT_byte_size   : 112	
 <2><2547a>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <2547b>   DW_AT_type        : <0x24901>	
    <25483>   DW_AT_upper_bound : 32	
 <2><25484>: Abbrev Number: 0
 <1><25485>: Abbrev Number: 12 (DW_TAG_array_type)
    <25486>   DW_AT_name        : [4]string	
    <25490>   DW_AT_type        : <0x24a46>	
    <25498>   DW_AT_byte_size   : 64	
 <2><25499>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <2549a>   DW_AT_type        : <0x24901>	
    <254a2>   DW_AT_upper_bound : 32	
 <2><254a3>: Abbrev Number: 0
 <1><254a4>: Abbrev Number: 12 (DW_TAG_array_type)
    <254a5>   DW_AT_name        : [8]struct { a string; b float64 }	
    <254c7>   DW_AT_type        : <0x254dc>	
    <254cf>   DW_AT_byte_size   : 192	
 <2><254d1>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <254d2>   DW_AT_type        : <0x24901>	
    <254da>   DW_AT_upper_bound : 224	
 <2><254db>: Abbrev Number: 0
 <1><254dc>: Abbrev Number: 21 (DW_TAG_structure_type)
    <254dd>   DW_AT_name        : struct { a string; b float64 }	
    <254fc>   DW_AT_byte_size   : 24	
 <2><254fd>: Abbrev Number: 6 (DW_TAG_member)
    <254fe>   DW_AT_name        : a	
    <25500>   DW_AT_data_member_location: 0 byte block: 	()
    <25501>   DW_AT_type        : <0x24a46>	
 <2><25509>: Abbrev Number: 6 (DW_TAG_member)
    <2550a>   DW_AT_name        : b	
    <2550c>   DW_AT_data_member_location: 3 byte block: 11 10 22 	(DW_OP_consts: 16; DW_OP_plus)
    <25510>   DW_AT_type        : <0x25519>	
 <2><25518>: Abbrev Number: 0
 <1><25519>: Abbrev Number: 11 (DW_TAG_base_type)
    <2551a>   DW_AT_name        : float64	
    <25522>   DW_AT_encoding    : 4	(float)
    <25523>   DW_AT_byte_size   : 8	
 <1><25524>: Abbrev Number: 19 (DW_TAG_structure_type)
    <25525>   DW_AT_name        : []string	
    <2552e>   DW_AT_byte_size   : 24	
 <2><2552f>: Abbrev Number: 6 (DW_TAG_member)
    <25530>   DW_AT_name        : array	
    <25536>   DW_AT_data_member_location: 0 byte block: 	()
    <25537>   DW_AT_type        : <0x24a35>	
 <2><2553f>: Abbrev Number: 6 (DW_TAG_member)
    <25540>   DW_AT_name        : len	
    <25544>   DW_AT_data_member_location: 3 byte block: 11 8 22 	(DW_OP_consts: 8; DW_OP_plus)
    <25548>   DW_AT_type        : <0x24f2b>	
 <2><25550>: Abbrev Number: 6 (DW_TAG_member)
    <25551>   DW_AT_name        : cap	
    <25555>   DW_AT_data_member_location: 3 byte block: 11 10 22 	(DW_OP_consts: 16; DW_OP_plus)
    <25559>   DW_AT_type        : <0x24f2b>	
 <2><25561>: Abbrev Number: 0
 <1><25562>: Abbrev Number: 21 (DW_TAG_structure_type)
    <25563>   DW_AT_name        : time.zoneTrans	
    <25572>   DW_AT_byte_size   : 16	
 <2><25573>: Abbrev Number: 6 (DW_TAG_member)
    <25574>   DW_AT_name        : when	
    <25579>   DW_AT_data_member_location: 0 byte block: 	()
    <2557a>   DW_AT_type        : <0x255d4>	
 <2><25582>: Abbrev Number: 6 (DW_TAG_member)
    <25583>   DW_AT_name        : index	
    <25589>   DW_AT_data_member_location: 3 byte block: 11 8 22 	(DW_OP_consts: 8; DW_OP_plus)
    <2558d>   DW_AT_type        : <0x24a2c>	
 <2><25595>: Abbrev Number: 6 (DW_TAG_member)
    <25596>   DW_AT_name        : isstd	
    <2559c>   DW_AT_data_member_location: 3 byte block: 11 9 22 	(DW_OP_consts: 9; DW_OP_plus)
    <255a0>   DW_AT_type        : <0x255dd>	
 <2><255a8>: Abbrev Number: 6 (DW_TAG_member)
    <255a9>   DW_AT_name        : isutc	
    <255af>   DW_AT_data_member_location: 3 byte block: 11 a 22 	(DW_OP_consts: 10; DW_OP_plus)
    <255b3>   DW_AT_type        : <0x255dd>	
 <2><255bb>: Abbrev Number: 0
 <1><255bc>: Abbrev Number: 22 (DW_TAG_typedef)
    <255bd>   DW_AT_name        : time.zoneTrans	
    <255cc>   DW_AT_type        : <0x25562>	
 <1><255d4>: Abbrev Number: 11 (DW_TAG_base_type)
    <255d5>   DW_AT_name        : int64	
    <255db>   DW_AT_encoding    : 5	(signed)
    <255dc>   DW_AT_byte_size   : 8	
 <1><255dd>: Abbrev Number: 11 (DW_TAG_base_type)
    <255de>   DW_AT_name        : bool	
    <255e3>   DW_AT_encoding    : 2	(boolean)
    <255e4>   DW_AT_byte_size   : 1	
 <1><255e5>: Abbrev Number: 21 (DW_TAG_structure_type)
    <255e6>   DW_AT_name        : time.data	
    <255f0>   DW_AT_byte_size   : 32	
 <2><255f1>: Abbrev Number: 6 (DW_TAG_member)
    <255f2>   DW_AT_name        : p	
    <255f4>   DW_AT_data_member_location: 0 byte block: 	()
    <255f5>   DW_AT_type        : <0x25253>	
 <2><255fd>: Abbrev Number: 6 (DW_TAG_member)
    <255fe>   DW_AT_name        : error	
    <25604>   DW_AT_data_member_location: 3 byte block: 11 18 22 	(DW_OP_consts: 24; DW_OP_plus)
    <25608>   DW_AT_type        : <0x255dd>	
 <2><25610>: Abbrev Number: 0
 <1><25611>: Abbrev Number: 22 (DW_TAG_typedef)
    <25612>   DW_AT_name        : time.data	
    <2561c>   DW_AT_type        : <0x255e5>	
 <1><25624>: Abbrev Number: 15 (DW_TAG_typedef)
    <25625>   DW_AT_name        : error	
    <2562b>   DW_AT_type        : <0x25643>	
 <2><25633>: Abbrev Number: 0
 <1><25634>: Abbrev Number: 22 (DW_TAG_typedef)
    <25635>   DW_AT_name        : error	
    <2563b>   DW_AT_type        : <0x25624>	
 <1><25643>: Abbrev Number: 21 (DW_TAG_structure_type)
    <25644>   DW_AT_name        : runtime.iface	
    <25652>   DW_AT_byte_size   : 16	
 <2><25653>: Abbrev Number: 6 (DW_TAG_member)
    <25654>   DW_AT_name        : tab	
    <25658>   DW_AT_data_member_location: 0 byte block: 	()
    <25659>   DW_AT_type        : <0x25406>	
 <2><25661>: Abbrev Number: 6 (DW_TAG_member)
    <25662>   DW_AT_name        : data	
    <25667>   DW_AT_data_member_location: 3 byte block: 11 8 22 	(DW_OP_consts: 8; DW_OP_plus)
    <2566b>   DW_AT_type        : <0x248f1>	
 <2><25673>: Abbrev Number: 0
 <1><25674>: Abbrev Number: 22 (DW_TAG_typedef)
    <25675>   DW_AT_name        : runtime.iface	
    <25683>   DW_AT_type        : <0x25643>	
 <1><2568b>: Abbrev Number: 12 (DW_TAG_array_type)
    <2568c>   DW_AT_name        : [1]time.zoneTrans	
    <2569e>   DW_AT_type        : <0x255bc>	
    <256a6>   DW_AT_byte_size   : 16	
 <2><256a7>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <256a8>   DW_AT_type        : <0x24901>	
    <256b0>   DW_AT_upper_bound : 0	
 <2><256b1>: Abbrev Number: 0
 <1><256b2>: Abbrev Number: 12 (DW_TAG_array_type)
    <256b3>   DW_AT_name        : [1]time.zone	
    <256c0>   DW_AT_type        : <0x256d4>	
    <256c8>   DW_AT_byte_size   : 32	
 <2><256c9>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <256ca>   DW_AT_type        : <0x24901>	
    <256d2>   DW_AT_upper_bound : 160	
 <2><256d3>: Abbrev Number: 0
 <1><256d4>: Abbrev Number: 21 (DW_TAG_structure_type)
    <256d5>   DW_AT_name        : time.zone	
    <256df>   DW_AT_byte_size   : 32	
 <2><256e0>: Abbrev Number: 6 (DW_TAG_member)
    <256e1>   DW_AT_name        : name	
    <256e6>   DW_AT_data_member_location: 0 byte block: 	()
    <256e7>   DW_AT_type        : <0x24a46>	
 <2><256ef>: Abbrev Number: 6 (DW_TAG_member)
    <256f0>   DW_AT_name        : offset	
    <256f7>   DW_AT_data_member_location: 3 byte block: 11 10 22 	(DW_OP_consts: 16; DW_OP_plus)
    <256fb>   DW_AT_type        : <0x2572a>	
 <2><25703>: Abbrev Number: 6 (DW_TAG_member)
    <25704>   DW_AT_name        : isDST	
    <2570a>   DW_AT_data_member_location: 3 byte block: 11 18 22 	(DW_OP_consts: 24; DW_OP_plus)
    <2570e>   DW_AT_type        : <0x255dd>	
 <2><25716>: Abbrev Number: 0
 <1><25717>: Abbrev Number: 22 (DW_TAG_typedef)
    <25718>   DW_AT_name        : time.zone	
    <25722>   DW_AT_type        : <0x256d4>	
 <1><2572a>: Abbrev Number: 11 (DW_TAG_base_type)
    <2572b>   DW_AT_name        : int	
    <2572f>   DW_AT_encoding    : 5	(signed)
    <25730>   DW_AT_byte_size   : 8	
 <1><25731>: Abbrev Number: 21 (DW_TAG_structure_type)
    <25732>   DW_AT_name        : sync.Once	
    <2573c>   DW_AT_byte_size   : 12	
 <2><2573d>: Abbrev Number: 6 (DW_TAG_member)
    <2573e>   DW_AT_name        : m	
    <25740>   DW_AT_data_member_location: 0 byte block: 	()
    <25741>   DW_AT_type        : <0x2576f>	
 <2><25749>: Abbrev Number: 6 (DW_TAG_member)
    <2574a>   DW_AT_name        : done	
    <2574f>   DW_AT_data_member_location: 3 byte block: 11 8 22 	(DW_OP_consts: 8; DW_OP_plus)
    <25753>   DW_AT_type        : <0x24a22>	
 <2><2575b>: Abbrev Number: 0
 <1><2575c>: Abbrev Number: 22 (DW_TAG_typedef)
    <2575d>   DW_AT_name        : sync.Once	
    <25767>   DW_AT_type        : <0x25731>	
 <1><2576f>: Abbrev Number: 21 (DW_TAG_structure_type)
    <25770>   DW_AT_name        : sync.Mutex	
    <2577b>   DW_AT_byte_size   : 8	
 <2><2577c>: Abbrev Number: 6 (DW_TAG_member)
    <2577d>   DW_AT_name        : state	
    <25783>   DW_AT_data_member_location: 0 byte block: 	()
    <25784>   DW_AT_type        : <0x2541d>	
 <2><2578c>: Abbrev Number: 6 (DW_TAG_member)
    <2578d>   DW_AT_name        : sema	
    <25792>   DW_AT_data_member_location: 3 byte block: 11 4 22 	(DW_OP_consts: 4; DW_OP_plus)
    <25796>   DW_AT_type        : <0x24a22>	
 <2><2579e>: Abbrev Number: 0
 <1><2579f>: Abbrev Number: 22 (DW_TAG_typedef)
    <257a0>   DW_AT_name        : sync.Mutex	
    <257ab>   DW_AT_type        : <0x2576f>	
 <1><257b3>: Abbrev Number: 21 (DW_TAG_structure_type)
    <257b4>   DW_AT_name        : time.Time	
    <257be>   DW_AT_byte_size   : 24	
 <2><257bf>: Abbrev Number: 6 (DW_TAG_member)
    <257c0>   DW_AT_name        : sec	
    <257c4>   DW_AT_data_member_location: 0 byte block: 	()
    <257c5>   DW_AT_type        : <0x255d4>	
 <2><257cd>: Abbrev Number: 6 (DW_TAG_member)
    <257ce>   DW_AT_name        : nsec	
    <257d3>   DW_AT_data_member_location: 3 byte block: 11 8 22 	(DW_OP_consts: 8; DW_OP_plus)
    <257d7>   DW_AT_type        : <0x24901>	
 <2><257df>: Abbrev Number: 6 (DW_TAG_member)
    <257e0>   DW_AT_name        : loc	
    <257e4>   DW_AT_data_member_location: 3 byte block: 11 10 22 	(DW_OP_consts: 16; DW_OP_plus)
    <257e8>   DW_AT_type        : <0x25804>	
 <2><257f0>: Abbrev Number: 0
 <1><257f1>: Abbrev Number: 22 (DW_TAG_typedef)
    <257f2>   DW_AT_name        : time.Time	
    <257fc>   DW_AT_type        : <0x257b3>	
 <1><25804>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <25805>   DW_AT_name        : *time.Location	
    <25814>   DW_AT_type        : <0x2581c>	
 <1><2581c>: Abbrev Number: 21 (DW_TAG_structure_type)
    <2581d>   DW_AT_name        : time.Location	
    <2582b>   DW_AT_byte_size   : 88	
 <2><2582c>: Abbrev Number: 6 (DW_TAG_member)
    <2582d>   DW_AT_name        : name	
    <25832>   DW_AT_data_member_location: 0 byte block: 	()
    <25833>   DW_AT_type        : <0x24a46>	
 <2><2583b>: Abbrev Number: 6 (DW_TAG_member)
    <2583c>   DW_AT_name        : zone	
    <25841>   DW_AT_data_member_location: 3 byte block: 11 10 22 	(DW_OP_consts: 16; DW_OP_plus)
    <25845>   DW_AT_type        : <0x258bd>	
 <2><2584d>: Abbrev Number: 6 (DW_TAG_member)
    <2584e>   DW_AT_name        : tx	
    <25851>   DW_AT_data_member_location: 3 byte block: 11 28 22 	(DW_OP_consts: 40; DW_OP_plus)
    <25855>   DW_AT_type        : <0x258fe>	
 <2><2585d>: Abbrev Number: 6 (DW_TAG_member)
    <2585e>   DW_AT_name        : cacheStart	
    <25869>   DW_AT_data_member_location: 4 byte block: 11 c0 0 22 	(DW_OP_consts: 64; DW_OP_plus)
    <2586e>   DW_AT_type        : <0x255d4>	
 <2><25876>: Abbrev Number: 6 (DW_TAG_member)
    <25877>   DW_AT_name        : cacheEnd	
    <25880>   DW_AT_data_member_location: 4 byte block: 11 c8 0 22 	(DW_OP_consts: 72; DW_OP_plus)
    <25885>   DW_AT_type        : <0x255d4>	
 <2><2588d>: Abbrev Number: 6 (DW_TAG_member)
    <2588e>   DW_AT_name        : cacheZone	
    <25898>   DW_AT_data_member_location: 4 byte block: 11 d0 0 22 	(DW_OP_consts: 80; DW_OP_plus)
    <2589d>   DW_AT_type        : <0x25944>	
 <2><258a5>: Abbrev Number: 0
 <1><258a6>: Abbrev Number: 22 (DW_TAG_typedef)
    <258a7>   DW_AT_name        : time.Location	
    <258b5>   DW_AT_type        : <0x2581c>	
 <1><258bd>: Abbrev Number: 19 (DW_TAG_structure_type)
    <258be>   DW_AT_name        : []time.zone	
    <258ca>   DW_AT_byte_size   : 24	
 <2><258cb>: Abbrev Number: 6 (DW_TAG_member)
    <258cc>   DW_AT_name        : array	
    <258d2>   DW_AT_data_member_location: 0 byte block: 	()
    <258d3>   DW_AT_type        : <0x25944>	
 <2><258db>: Abbrev Number: 6 (DW_TAG_member)
    <258dc>   DW_AT_name        : len	
    <258e0>   DW_AT_data_member_location: 3 byte block: 11 8 22 	(DW_OP_consts: 8; DW_OP_plus)
    <258e4>   DW_AT_type        : <0x24f2b>	
 <2><258ec>: Abbrev Number: 6 (DW_TAG_member)
    <258ed>   DW_AT_name        : cap	
    <258f1>   DW_AT_data_member_location: 3 byte block: 11 10 22 	(DW_OP_consts: 16; DW_OP_plus)
    <258f5>   DW_AT_type        : <0x24f2b>	
 <2><258fd>: Abbrev Number: 0
 <1><258fe>: Abbrev Number: 19 (DW_TAG_structure_type)
    <258ff>   DW_AT_name        : []time.zoneTrans	
    <25910>   DW_AT_byte_size   : 24	
 <2><25911>: Abbrev Number: 6 (DW_TAG_member)
    <25912>   DW_AT_name        : array	
    <25918>   DW_AT_data_member_location: 0 byte block: 	()
    <25919>   DW_AT_type        : <0x2ae75>	
 <2><25921>: Abbrev Number: 6 (DW_TAG_member)
    <25922>   DW_AT_name        : len	
    <25926>   DW_AT_data_member_location: 3 byte block: 11 8 22 	(DW_OP_consts: 8; DW_OP_plus)
    <2592a>   DW_AT_type        : <0x24f2b>	
 <2><25932>: Abbrev Number: 6 (DW_TAG_member)
    <25933>   DW_AT_name        : cap	
    <25937>   DW_AT_data_member_location: 3 byte block: 11 10 22 	(DW_OP_consts: 16; DW_OP_plus)
    <2593b>   DW_AT_type        : <0x24f2b>	
 <2><25943>: Abbrev Number: 0
 <1><25944>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <25945>   DW_AT_name        : *time.zone	
    <25950>   DW_AT_type        : <0x25717>	
 <1><25958>: Abbrev Number: 12 (DW_TAG_array_type)
    <25959>   DW_AT_name        : [15]uint8	
    <25963>   DW_AT_type        : <0x24a2c>	
    <2596b>   DW_AT_byte_size   : 15	
 <2><2596c>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <2596d>   DW_AT_type        : <0x24901>	
    <25975>   DW_AT_upper_bound : 224	
 <2><25976>: Abbrev Number: 0
 <1><25977>: Abbrev Number: 12 (DW_TAG_array_type)
    <25978>   DW_AT_name        : [13]int32	
    <25982>   DW_AT_type        : <0x2541d>	
    <2598a>   DW_AT_byte_size   : 52	
 <2><2598b>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <2598c>   DW_AT_type        : <0x24901>	
    <25994>   DW_AT_upper_bound : 192	
 <2><25995>: Abbrev Number: 0
 <1><25996>: Abbrev Number: 16 (DW_TAG_typedef)
    <25997>   DW_AT_name        : map[string]float64	
    <259aa>   DW_AT_type        : <0x2c015>	
 <1><259b2>: Abbrev Number: 12 (DW_TAG_array_type)
    <259b3>   DW_AT_name        : [8]string	
    <259bd>   DW_AT_type        : <0x24a46>	
    <259c5>   DW_AT_byte_size   : 128	
 <2><259c7>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <259c8>   DW_AT_type        : <0x24901>	
    <259d0>   DW_AT_upper_bound : 32	
 <2><259d1>: Abbrev Number: 0
 <1><259d2>: Abbrev Number: 12 (DW_TAG_array_type)
    <259d3>   DW_AT_name        : [12]string	
    <259de>   DW_AT_type        : <0x24a46>	
    <259e6>   DW_AT_byte_size   : 192	
 <2><259e8>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <259e9>   DW_AT_type        : <0x24901>	
    <259f1>   DW_AT_upper_bound : 32	
 <2><259f2>: Abbrev Number: 0
 <1><259f3>: Abbrev Number: 12 (DW_TAG_array_type)
    <259f4>   DW_AT_name        : [6]int	
    <259fb>   DW_AT_type        : <0x2572a>	
    <25a03>   DW_AT_byte_size   : 48	
 <2><25a04>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <25a05>   DW_AT_type        : <0x24901>	
    <25a0d>   DW_AT_upper_bound : 96	
 <2><25a0e>: Abbrev Number: 0
 <1><25a0f>: Abbrev Number: 21 (DW_TAG_structure_type)
    <25a10>   DW_AT_name        : syscall.mmapper	
    <25a20>   DW_AT_byte_size   : 32	
 <2><25a21>: Abbrev Number: 6 (DW_TAG_member)
    <25a22>   DW_AT_name        : sync.Mutex	
    <25a2d>   DW_AT_data_member_location: 0 byte block: 	()
    <25a2e>   DW_AT_type        : <0x2579f>	
 <2><25a36>: Abbrev Number: 6 (DW_TAG_member)
    <25a37>   DW_AT_name        : active	
    <25a3e>   DW_AT_data_member_location: 3 byte block: 11 8 22 	(DW_OP_consts: 8; DW_OP_plus)
    <25a42>   DW_AT_type        : <0x25a8a>	
 <2><25a4a>: Abbrev Number: 6 (DW_TAG_member)
    <25a4b>   DW_AT_name        : mmap	
    <25a50>   DW_AT_data_member_location: 3 byte block: 11 10 22 	(DW_OP_consts: 16; DW_OP_plus)
    <25a54>   DW_AT_type        : <0x25aa6>	
 <2><25a5c>: Abbrev Number: 6 (DW_TAG_member)
    <25a5d>   DW_AT_name        : munmap	
    <25a64>   DW_AT_data_member_location: 3 byte block: 11 18 22 	(DW_OP_consts: 24; DW_OP_plus)
    <25a68>   DW_AT_type        : <0x25b97>	
 <2><25a70>: Abbrev Number: 0
 <1><25a71>: Abbrev Number: 22 (DW_TAG_typedef)
    <25a72>   DW_AT_name        : syscall.mmapper	
    <25a82>   DW_AT_type        : <0x25a0f>	
 <1><25a8a>: Abbrev Number: 16 (DW_TAG_typedef)
    <25a8b>   DW_AT_name        : map[*uint8][]uint8	
    <25a9e>   DW_AT_type        : <0x2be3e>	
 <1><25aa6>: Abbrev Number: 14 (DW_TAG_subroutine_type)
    <25aa7>   DW_AT_name        : func(uintptr, uintptr, int, int, int, int64) (uintptr, error)	
 <2><25ae5>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <25ae6>   DW_AT_type        : <0x24901>	
 <2><25aee>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <25aef>   DW_AT_type        : <0x24901>	
 <2><25af7>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <25af8>   DW_AT_type        : <0x2572a>	
 <2><25b00>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <25b01>   DW_AT_type        : <0x2572a>	
 <2><25b09>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <25b0a>   DW_AT_type        : <0x2572a>	
 <2><25b12>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <25b13>   DW_AT_type        : <0x255d4>	
 <2><25b1b>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <25b1c>   DW_AT_type        : <0x25b75>	
 <2><25b24>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <25b25>   DW_AT_type        : <0x25b87>	
 <2><25b2d>: Abbrev Number: 0
 <1><25b2e>: Abbrev Number: 22 (DW_TAG_typedef)
    <25b2f>   DW_AT_name        : func(uintptr, uintptr, int, int, int, int64) (uintptr, error)	
    <25b6d>   DW_AT_type        : <0x25aa6>	
 <1><25b75>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <25b76>   DW_AT_name        : *uintptr	
    <25b7f>   DW_AT_type        : <0x24901>	
 <1><25b87>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <25b88>   DW_AT_name        : *error	
    <25b8f>   DW_AT_type        : <0x25634>	
 <1><25b97>: Abbrev Number: 14 (DW_TAG_subroutine_type)
    <25b98>   DW_AT_name        : func(uintptr, uintptr) error	
 <2><25bb5>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <25bb6>   DW_AT_type        : <0x24901>	
 <2><25bbe>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <25bbf>   DW_AT_type        : <0x24901>	
 <2><25bc7>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <25bc8>   DW_AT_type        : <0x25b87>	
 <2><25bd0>: Abbrev Number: 0
 <1><25bd1>: Abbrev Number: 22 (DW_TAG_typedef)
    <25bd2>   DW_AT_name        : func(uintptr, uintptr) error	
    <25bef>   DW_AT_type        : <0x25b97>	
 <1><25bf7>: Abbrev Number: 12 (DW_TAG_array_type)
    <25bf8>   DW_AT_name        : [32]string	
    <25c03>   DW_AT_type        : <0x24a46>	
    <25c0b>   DW_AT_byte_size   : 512	
 <2><25c0d>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <25c0e>   DW_AT_type        : <0x24901>	
    <25c16>   DW_AT_upper_bound : 32	
 <2><25c17>: Abbrev Number: 0
 <1><25c18>: Abbrev Number: 12 (DW_TAG_array_type)
    <25c19>   DW_AT_name        : [133]string	
    <25c25>   DW_AT_type        : <0x24a46>	
    <25c2d>   DW_AT_byte_size   : 2128	
 <2><25c2f>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <25c30>   DW_AT_type        : <0x24901>	
    <25c38>   DW_AT_upper_bound : 32	
 <2><25c39>: Abbrev Number: 0
 <1><25c3a>: Abbrev Number: 21 (DW_TAG_structure_type)
    <25c3b>   DW_AT_name        : struct { addr uintptr; len int; cap int }	
    <25c65>   DW_AT_byte_size   : 24	
 <2><25c66>: Abbrev Number: 6 (DW_TAG_member)
    <25c67>   DW_AT_name        : addr	
    <25c6c>   DW_AT_data_member_location: 0 byte block: 	()
    <25c6d>   DW_AT_type        : <0x24901>	
 <2><25c75>: Abbrev Number: 6 (DW_TAG_member)
    <25c76>   DW_AT_name        : len	
    <25c7a>   DW_AT_data_member_location: 3 byte block: 11 8 22 	(DW_OP_consts: 8; DW_OP_plus)
    <25c7e>   DW_AT_type        : <0x2572a>	
 <2><25c86>: Abbrev Number: 6 (DW_TAG_member)
    <25c87>   DW_AT_name        : cap	
    <25c8b>   DW_AT_data_member_location: 3 byte block: 11 10 22 	(DW_OP_consts: 16; DW_OP_plus)
    <25c8f>   DW_AT_type        : <0x2572a>	
 <2><25c97>: Abbrev Number: 0
 <1><25c98>: Abbrev Number: 21 (DW_TAG_structure_type)
    <25c99>   DW_AT_name        : sync.RWMutex	
    <25ca6>   DW_AT_byte_size   : 24	
 <2><25ca7>: Abbrev Number: 6 (DW_TAG_member)
    <25ca8>   DW_AT_name        : w	
    <25caa>   DW_AT_data_member_location: 0 byte block: 	()
    <25cab>   DW_AT_type        : <0x2579f>	
 <2><25cb3>: Abbrev Number: 6 (DW_TAG_member)
    <25cb4>   DW_AT_name        : writerSem	
    <25cbe>   DW_AT_data_member_location: 3 byte block: 11 8 22 	(DW_OP_consts: 8; DW_OP_plus)
    <25cc2>   DW_AT_type        : <0x24a22>	
 <2><25cca>: Abbrev Number: 6 (DW_TAG_member)
    <25ccb>   DW_AT_name        : readerSem	
    <25cd5>   DW_AT_data_member_location: 3 byte block: 11 c 22 	(DW_OP_consts: 12; DW_OP_plus)
    <25cd9>   DW_AT_type        : <0x24a22>	
 <2><25ce1>: Abbrev Number: 6 (DW_TAG_member)
    <25ce2>   DW_AT_name        : readerCount	
    <25cee>   DW_AT_data_member_location: 3 byte block: 11 10 22 	(DW_OP_consts: 16; DW_OP_plus)
    <25cf2>   DW_AT_type        : <0x2541d>	
 <2><25cfa>: Abbrev Number: 6 (DW_TAG_member)
    <25cfb>   DW_AT_name        : readerWait	
    <25d06>   DW_AT_data_member_location: 3 byte block: 11 14 22 	(DW_OP_consts: 20; DW_OP_plus)
    <25d0a>   DW_AT_type        : <0x2541d>	
 <2><25d12>: Abbrev Number: 0
 <1><25d13>: Abbrev Number: 22 (DW_TAG_typedef)
    <25d14>   DW_AT_name        : sync.RWMutex	
    <25d21>   DW_AT_type        : <0x25c98>	
 <1><25d29>: Abbrev Number: 16 (DW_TAG_typedef)
    <25d2a>   DW_AT_name        : map[string]int	
    <25d39>   DW_AT_type        : <0x2bc6b>	
 <1><25d41>: Abbrev Number: 19 (DW_TAG_structure_type)
    <25d42>   DW_AT_name        : []*sync.Pool	
    <25d4f>   DW_AT_byte_size   : 24	
 <2><25d50>: Abbrev Number: 6 (DW_TAG_member)
    <25d51>   DW_AT_name        : array	
    <25d57>   DW_AT_data_member_location: 0 byte block: 	()
    <25d58>   DW_AT_type        : <0x2b051>	
 <2><25d60>: Abbrev Number: 6 (DW_TAG_member)
    <25d61>   DW_AT_name        : len	
    <25d65>   DW_AT_data_member_location: 3 byte block: 11 8 22 	(DW_OP_consts: 8; DW_OP_plus)
    <25d69>   DW_AT_type        : <0x24f2b>	
 <2><25d71>: Abbrev Number: 6 (DW_TAG_member)
    <25d72>   DW_AT_name        : cap	
    <25d76>   DW_AT_data_member_location: 3 byte block: 11 10 22 	(DW_OP_consts: 16; DW_OP_plus)
    <25d7a>   DW_AT_type        : <0x24f2b>	
 <2><25d82>: Abbrev Number: 0
 <1><25d83>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <25d84>   DW_AT_name        : *sync.Pool	
    <25d8f>   DW_AT_type        : <0x25d97>	
 <1><25d97>: Abbrev Number: 21 (DW_TAG_structure_type)
    <25d98>   DW_AT_name        : sync.Pool	
    <25da2>   DW_AT_byte_size   : 24	
 <2><25da3>: Abbrev Number: 6 (DW_TAG_member)
    <25da4>   DW_AT_name        : local	
    <25daa>   DW_AT_data_member_location: 0 byte block: 	()
    <25dab>   DW_AT_type        : <0x248f1>	
 <2><25db3>: Abbrev Number: 6 (DW_TAG_member)
    <25db4>   DW_AT_name        : localSize	
    <25dbe>   DW_AT_data_member_location: 3 byte block: 11 8 22 	(DW_OP_consts: 8; DW_OP_plus)
    <25dc2>   DW_AT_type        : <0x24901>	
 <2><25dca>: Abbrev Number: 6 (DW_TAG_member)
    <25dcb>   DW_AT_name        : New	
    <25dcf>   DW_AT_data_member_location: 3 byte block: 11 10 22 	(DW_OP_consts: 16; DW_OP_plus)
    <25dd3>   DW_AT_type        : <0x25def>	
 <2><25ddb>: Abbrev Number: 0
 <1><25ddc>: Abbrev Number: 22 (DW_TAG_typedef)
    <25ddd>   DW_AT_name        : sync.Pool	
    <25de7>   DW_AT_type        : <0x25d97>	
 <1><25def>: Abbrev Number: 14 (DW_TAG_subroutine_type)
    <25df0>   DW_AT_name        : func() interface {}	
 <2><25e04>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <25e05>   DW_AT_type        : <0x25ea2>	
 <2><25e0d>: Abbrev Number: 0
 <1><25e0e>: Abbrev Number: 22 (DW_TAG_typedef)
    <25e0f>   DW_AT_name        : func() interface {}	
    <25e23>   DW_AT_type        : <0x25def>	
 <1><25e2b>: Abbrev Number: 15 (DW_TAG_typedef)
    <25e2c>   DW_AT_name        : interface {}	
    <25e39>   DW_AT_type        : <0x25e58>	
 <2><25e41>: Abbrev Number: 0
 <1><25e42>: Abbrev Number: 22 (DW_TAG_typedef)
    <25e43>   DW_AT_name        : interface {}	
    <25e50>   DW_AT_type        : <0x25e2b>	
 <1><25e58>: Abbrev Number: 21 (DW_TAG_structure_type)
    <25e59>   DW_AT_name        : runtime.eface	
    <25e67>   DW_AT_byte_size   : 16	
 <2><25e68>: Abbrev Number: 6 (DW_TAG_member)
    <25e69>   DW_AT_name        : _type	
    <25e6f>   DW_AT_data_member_location: 0 byte block: 	()
    <25e70>   DW_AT_type        : <0x2534a>	
 <2><25e78>: Abbrev Number: 6 (DW_TAG_member)
    <25e79>   DW_AT_name        : data	
    <25e7e>   DW_AT_data_member_location: 3 byte block: 11 8 22 	(DW_OP_consts: 8; DW_OP_plus)
    <25e82>   DW_AT_type        : <0x248f1>	
 <2><25e8a>: Abbrev Number: 0
 <1><25e8b>: Abbrev Number: 22 (DW_TAG_typedef)
    <25e8c>   DW_AT_name        : runtime.eface	
    <25e9a>   DW_AT_type        : <0x25e58>	
 <1><25ea2>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <25ea3>   DW_AT_name        : *interface {}	
    <25eb1>   DW_AT_type        : <0x25e2b>	
 <1><25eb9>: Abbrev Number: 12 (DW_TAG_array_type)
    <25eba>   DW_AT_name        : [27]string	
    <25ec5>   DW_AT_type        : <0x24a46>	
    <25ecd>   DW_AT_byte_size   : 432	
 <2><25ecf>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <25ed0>   DW_AT_type        : <0x24901>	
    <25ed8>   DW_AT_upper_bound : 32	
 <2><25ed9>: Abbrev Number: 0
 <1><25eda>: Abbrev Number: 21 (DW_TAG_structure_type)
    <25edb>   DW_AT_name        : reflect.Value	
    <25ee9>   DW_AT_byte_size   : 32	
 <2><25eea>: Abbrev Number: 6 (DW_TAG_member)
    <25eeb>   DW_AT_name        : typ	
    <25eef>   DW_AT_data_member_location: 0 byte block: 	()
    <25ef0>   DW_AT_type        : <0x25f4f>	
 <2><25ef8>: Abbrev Number: 6 (DW_TAG_member)
    <25ef9>   DW_AT_name        : ptr	
    <25efd>   DW_AT_data_member_location: 3 byte block: 11 8 22 	(DW_OP_consts: 8; DW_OP_plus)
    <25f01>   DW_AT_type        : <0x248f1>	
 <2><25f09>: Abbrev Number: 6 (DW_TAG_member)
    <25f0a>   DW_AT_name        : scalar	
    <25f11>   DW_AT_data_member_location: 3 byte block: 11 10 22 	(DW_OP_consts: 16; DW_OP_plus)
    <25f15>   DW_AT_type        : <0x24901>	
 <2><25f1d>: Abbrev Number: 6 (DW_TAG_member)
    <25f1e>   DW_AT_name        : reflect.flag	
    <25f2b>   DW_AT_data_member_location: 3 byte block: 11 18 22 	(DW_OP_consts: 24; DW_OP_plus)
    <25f2f>   DW_AT_type        : <0x261e4>	
 <2><25f37>: Abbrev Number: 0
 <1><25f38>: Abbrev Number: 22 (DW_TAG_typedef)
    <25f39>   DW_AT_name        : reflect.Value	
    <25f47>   DW_AT_type        : <0x25eda>	
 <1><25f4f>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <25f50>   DW_AT_name        : *reflect.rtype	
    <25f5f>   DW_AT_type        : <0x25f67>	
 <1><25f67>: Abbrev Number: 21 (DW_TAG_structure_type)
    <25f68>   DW_AT_name        : reflect.rtype	
    <25f76>   DW_AT_byte_size   : 64	
 <2><25f77>: Abbrev Number: 6 (DW_TAG_member)
    <25f78>   DW_AT_name        : size	
    <25f7d>   DW_AT_data_member_location: 0 byte block: 	()
    <25f7e>   DW_AT_type        : <0x24901>	
 <2><25f86>: Abbrev Number: 6 (DW_TAG_member)
    <25f87>   DW_AT_name        : hash	
    <25f8c>   DW_AT_data_member_location: 3 byte block: 11 8 22 	(DW_OP_consts: 8; DW_OP_plus)
    <25f90>   DW_AT_type        : <0x24a22>	
 <2><25f98>: Abbrev Number: 6 (DW_TAG_member)
    <25f99>   DW_AT_name        : _	
    <25f9b>   DW_AT_data_member_location: 3 byte block: 11 c 22 	(DW_OP_consts: 12; DW_OP_plus)
    <25f9f>   DW_AT_type        : <0x24a2c>	
 <2><25fa7>: Abbrev Number: 6 (DW_TAG_member)
    <25fa8>   DW_AT_name        : align	
    <25fae>   DW_AT_data_member_location: 3 byte block: 11 d 22 	(DW_OP_consts: 13; DW_OP_plus)
    <25fb2>   DW_AT_type        : <0x24a2c>	
 <2><25fba>: Abbrev Number: 6 (DW_TAG_member)
    <25fbb>   DW_AT_name        : fieldAlign	
    <25fc6>   DW_AT_data_member_location: 3 byte block: 11 e 22 	(DW_OP_consts: 14; DW_OP_plus)
    <25fca>   DW_AT_type        : <0x24a2c>	
 <2><25fd2>: Abbrev Number: 6 (DW_TAG_member)
    <25fd3>   DW_AT_name        : kind	
    <25fd8>   DW_AT_data_member_location: 3 byte block: 11 f 22 	(DW_OP_consts: 15; DW_OP_plus)
    <25fdc>   DW_AT_type        : <0x24a2c>	
 <2><25fe4>: Abbrev Number: 6 (DW_TAG_member)
    <25fe5>   DW_AT_name        : alg	
    <25fe9>   DW_AT_data_member_location: 3 byte block: 11 10 22 	(DW_OP_consts: 16; DW_OP_plus)
    <25fed>   DW_AT_type        : <0x25b75>	
 <2><25ff5>: Abbrev Number: 6 (DW_TAG_member)
    <25ff6>   DW_AT_name        : gc	
    <25ff9>   DW_AT_data_member_location: 3 byte block: 11 18 22 	(DW_OP_consts: 24; DW_OP_plus)
    <25ffd>   DW_AT_type        : <0x248f1>	
 <2><26005>: Abbrev Number: 6 (DW_TAG_member)
    <26006>   DW_AT_name        : string	
    <2600d>   DW_AT_data_member_location: 3 byte block: 11 20 22 	(DW_OP_consts: 32; DW_OP_plus)
    <26011>   DW_AT_type        : <0x24a35>	
 <2><26019>: Abbrev Number: 6 (DW_TAG_member)
    <2601a>   DW_AT_name        : *reflect.uncommonType	
    <26030>   DW_AT_data_member_location: 3 byte block: 11 28 22 	(DW_OP_consts: 40; DW_OP_plus)
    <26034>   DW_AT_type        : <0x2607d>	
 <2><2603c>: Abbrev Number: 6 (DW_TAG_member)
    <2603d>   DW_AT_name        : ptrToThis	
    <26047>   DW_AT_data_member_location: 3 byte block: 11 30 22 	(DW_OP_consts: 48; DW_OP_plus)
    <2604b>   DW_AT_type        : <0x25f4f>	
 <2><26053>: Abbrev Number: 6 (DW_TAG_member)
    <26054>   DW_AT_name        : zero	
    <26059>   DW_AT_data_member_location: 3 byte block: 11 38 22 	(DW_OP_consts: 56; DW_OP_plus)
    <2605d>   DW_AT_type        : <0x248f1>	
 <2><26065>: Abbrev Number: 0
 <1><26066>: Abbrev Number: 22 (DW_TAG_typedef)
    <26067>   DW_AT_name        : reflect.rtype	
    <26075>   DW_AT_type        : <0x25f67>	
 <1><2607d>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <2607e>   DW_AT_name        : *reflect.uncommonType	
    <26094>   DW_AT_type        : <0x2609c>	
 <1><2609c>: Abbrev Number: 21 (DW_TAG_structure_type)
    <2609d>   DW_AT_name        : reflect.uncommonType	
    <260b2>   DW_AT_byte_size   : 40	
 <2><260b3>: Abbrev Number: 6 (DW_TAG_member)
    <260b4>   DW_AT_name        : name	
    <260b9>   DW_AT_data_member_location: 0 byte block: 	()
    <260ba>   DW_AT_type        : <0x24a35>	
 <2><260c2>: Abbrev Number: 6 (DW_TAG_member)
    <260c3>   DW_AT_name        : pkgPath	
    <260cb>   DW_AT_data_member_location: 3 byte block: 11 8 22 	(DW_OP_consts: 8; DW_OP_plus)
    <260cf>   DW_AT_type        : <0x24a35>	
 <2><260d7>: Abbrev Number: 6 (DW_TAG_member)
    <260d8>   DW_AT_name        : methods	
    <260e0>   DW_AT_data_member_location: 3 byte block: 11 10 22 	(DW_OP_consts: 16; DW_OP_plus)
    <260e4>   DW_AT_type        : <0x2610b>	
 <2><260ec>: Abbrev Number: 0
 <1><260ed>: Abbrev Number: 22 (DW_TAG_typedef)
    <260ee>   DW_AT_name        : reflect.uncommonType	
    <26103>   DW_AT_type        : <0x2609c>	
 <1><2610b>: Abbrev Number: 19 (DW_TAG_structure_type)
    <2610c>   DW_AT_name        : []reflect.method	
    <2611d>   DW_AT_byte_size   : 24	
 <2><2611e>: Abbrev Number: 6 (DW_TAG_member)
    <2611f>   DW_AT_name        : array	
    <26125>   DW_AT_data_member_location: 0 byte block: 	()
    <26126>   DW_AT_type        : <0x29de9>	
 <2><2612e>: Abbrev Number: 6 (DW_TAG_member)
    <2612f>   DW_AT_name        : len	
    <26133>   DW_AT_data_member_location: 3 byte block: 11 8 22 	(DW_OP_consts: 8; DW_OP_plus)
    <26137>   DW_AT_type        : <0x24f2b>	
 <2><2613f>: Abbrev Number: 6 (DW_TAG_member)
    <26140>   DW_AT_name        : cap	
    <26144>   DW_AT_data_member_location: 3 byte block: 11 10 22 	(DW_OP_consts: 16; DW_OP_plus)
    <26148>   DW_AT_type        : <0x24f2b>	
 <2><26150>: Abbrev Number: 0
 <1><26151>: Abbrev Number: 21 (DW_TAG_structure_type)
    <26152>   DW_AT_name        : reflect.method	
    <26161>   DW_AT_byte_size   : 48	
 <2><26162>: Abbrev Number: 6 (DW_TAG_member)
    <26163>   DW_AT_name        : name	
    <26168>   DW_AT_data_member_location: 0 byte block: 	()
    <26169>   DW_AT_type        : <0x24a35>	
 <2><26171>: Abbrev Number: 6 (DW_TAG_member)
    <26172>   DW_AT_name        : pkgPath	
    <2617a>   DW_AT_data_member_location: 3 byte block: 11 8 22 	(DW_OP_consts: 8; DW_OP_plus)
    <2617e>   DW_AT_type        : <0x24a35>	
 <2><26186>: Abbrev Number: 6 (DW_TAG_member)
    <26187>   DW_AT_name        : mtyp	
    <2618c>   DW_AT_data_member_location: 3 byte block: 11 10 22 	(DW_OP_consts: 16; DW_OP_plus)
    <26190>   DW_AT_type        : <0x25f4f>	
 <2><26198>: Abbrev Number: 6 (DW_TAG_member)
    <26199>   DW_AT_name        : typ	
    <2619d>   DW_AT_data_member_location: 3 byte block: 11 18 22 	(DW_OP_consts: 24; DW_OP_plus)
    <261a1>   DW_AT_type        : <0x25f4f>	
 <2><261a9>: Abbrev Number: 6 (DW_TAG_member)
    <261aa>   DW_AT_name        : ifn	
    <261ae>   DW_AT_data_member_location: 3 byte block: 11 20 22 	(DW_OP_consts: 32; DW_OP_plus)
    <261b2>   DW_AT_type        : <0x248f1>	
 <2><261ba>: Abbrev Number: 6 (DW_TAG_member)
    <261bb>   DW_AT_name        : tfn	
    <261bf>   DW_AT_data_member_location: 3 byte block: 11 28 22 	(DW_OP_consts: 40; DW_OP_plus)
    <261c3>   DW_AT_type        : <0x248f1>	
 <2><261cb>: Abbrev Number: 0
 <1><261cc>: Abbrev Number: 22 (DW_TAG_typedef)
    <261cd>   DW_AT_name        : reflect.method	
    <261dc>   DW_AT_type        : <0x26151>	
 <1><261e4>: Abbrev Number: 11 (DW_TAG_base_type)
    <261e5>   DW_AT_name        : reflect.flag	
    <261f2>   DW_AT_encoding    : 7	(unsigned)
    <261f3>   DW_AT_byte_size   : 8	
 <1><261f4>: Abbrev Number: 21 (DW_TAG_structure_type)
    <261f5>   DW_AT_name        : reflect.sliceHeader	
    <26209>   DW_AT_byte_size   : 24	
 <2><2620a>: Abbrev Number: 6 (DW_TAG_member)
    <2620b>   DW_AT_name        : Data	
    <26210>   DW_AT_data_member_location: 0 byte block: 	()
    <26211>   DW_AT_type        : <0x248f1>	
 <2><26219>: Abbrev Number: 6 (DW_TAG_member)
    <2621a>   DW_AT_name        : Len	
    <2621e>   DW_AT_data_member_location: 3 byte block: 11 8 22 	(DW_OP_consts: 8; DW_OP_plus)
    <26222>   DW_AT_type        : <0x2572a>	
 <2><2622a>: Abbrev Number: 6 (DW_TAG_member)
    <2622b>   DW_AT_name        : Cap	
    <2622f>   DW_AT_data_member_location: 3 byte block: 11 10 22 	(DW_OP_consts: 16; DW_OP_plus)
    <26233>   DW_AT_type        : <0x2572a>	
 <2><2623b>: Abbrev Number: 0
 <1><2623c>: Abbrev Number: 22 (DW_TAG_typedef)
    <2623d>   DW_AT_name        : reflect.sliceHeader	
    <26251>   DW_AT_type        : <0x261f4>	
 <1><26259>: Abbrev Number: 21 (DW_TAG_structure_type)
    <2625a>   DW_AT_name        : reflect.stringHeader	
    <2626f>   DW_AT_byte_size   : 16	
 <2><26270>: Abbrev Number: 6 (DW_TAG_member)
    <26271>   DW_AT_name        : Data	
    <26276>   DW_AT_data_member_location: 0 byte block: 	()
    <26277>   DW_AT_type        : <0x248f1>	
 <2><2627f>: Abbrev Number: 6 (DW_TAG_member)
    <26280>   DW_AT_name        : Len	
    <26284>   DW_AT_data_member_location: 3 byte block: 11 8 22 	(DW_OP_consts: 8; DW_OP_plus)
    <26288>   DW_AT_type        : <0x2572a>	
 <2><26290>: Abbrev Number: 0
 <1><26291>: Abbrev Number: 22 (DW_TAG_typedef)
    <26292>   DW_AT_name        : reflect.stringHeader	
    <262a7>   DW_AT_type        : <0x26259>	
 <1><262af>: Abbrev Number: 12 (DW_TAG_array_type)
    <262b0>   DW_AT_name        : [6]string	
    <262ba>   DW_AT_type        : <0x24a46>	
    <262c2>   DW_AT_byte_size   : 96	
 <2><262c3>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <262c4>   DW_AT_type        : <0x24901>	
    <262cc>   DW_AT_upper_bound : 32	
 <2><262cd>: Abbrev Number: 0
 <1><262ce>: Abbrev Number: 21 (DW_TAG_structure_type)
    <262cf>   DW_AT_name        : reflect.layoutType	
    <262e2>   DW_AT_byte_size   : 24	
 <2><262e3>: Abbrev Number: 6 (DW_TAG_member)
    <262e4>   DW_AT_name        : t	
    <262e6>   DW_AT_data_member_location: 0 byte block: 	()
    <262e7>   DW_AT_type        : <0x25f4f>	
 <2><262ef>: Abbrev Number: 6 (DW_TAG_member)
    <262f0>   DW_AT_name        : argSize	
    <262f8>   DW_AT_data_member_location: 3 byte block: 11 8 22 	(DW_OP_consts: 8; DW_OP_plus)
    <262fc>   DW_AT_type        : <0x24901>	
 <2><26304>: Abbrev Number: 6 (DW_TAG_member)
    <26305>   DW_AT_name        : retOffset	
    <2630f>   DW_AT_data_member_location: 3 byte block: 11 10 22 	(DW_OP_consts: 16; DW_OP_plus)
    <26313>   DW_AT_type        : <0x24901>	
 <2><2631b>: Abbrev Number: 0
 <1><2631c>: Abbrev Number: 22 (DW_TAG_typedef)
    <2631d>   DW_AT_name        : reflect.layoutType	
    <26330>   DW_AT_type        : <0x262ce>	
 <1><26338>: Abbrev Number: 21 (DW_TAG_structure_type)
    <26339>   DW_AT_name        : struct { sync.RWMutex; m map[reflect.layoutKey]reflect.layoutType }	
    <2637d>   DW_AT_byte_size   : 32	
 <2><2637e>: Abbrev Number: 6 (DW_TAG_member)
    <2637f>   DW_AT_name        : sync.RWMutex	
    <2638c>   DW_AT_data_member_location: 0 byte block: 	()
    <2638d>   DW_AT_type        : <0x25d13>	
 <2><26395>: Abbrev Number: 6 (DW_TAG_member)
    <26396>   DW_AT_name        : m	
    <26398>   DW_AT_data_member_location: 3 byte block: 11 18 22 	(DW_OP_consts: 24; DW_OP_plus)
    <2639c>   DW_AT_type        : <0x263a5>	
 <2><263a4>: Abbrev Number: 0
 <1><263a5>: Abbrev Number: 16 (DW_TAG_typedef)
    <263a6>   DW_AT_name        : map[reflect.layoutKey]reflect.layoutType	
    <263cf>   DW_AT_type        : <0x2ba8e>	
 <1><263d7>: Abbrev Number: 21 (DW_TAG_structure_type)
    <263d8>   DW_AT_name        : reflect.layoutKey	
    <263ea>   DW_AT_byte_size   : 16	
 <2><263eb>: Abbrev Number: 6 (DW_TAG_member)
    <263ec>   DW_AT_name        : t	
    <263ee>   DW_AT_data_member_location: 0 byte block: 	()
    <263ef>   DW_AT_type        : <0x25f4f>	
 <2><263f7>: Abbrev Number: 6 (DW_TAG_member)
    <263f8>   DW_AT_name        : rcvr	
    <263fd>   DW_AT_data_member_location: 3 byte block: 11 8 22 	(DW_OP_consts: 8; DW_OP_plus)
    <26401>   DW_AT_type        : <0x25f4f>	
 <2><26409>: Abbrev Number: 0
 <1><2640a>: Abbrev Number: 22 (DW_TAG_typedef)
    <2640b>   DW_AT_name        : reflect.layoutKey	
    <2641d>   DW_AT_type        : <0x263d7>	
 <1><26425>: Abbrev Number: 21 (DW_TAG_structure_type)
    <26426>   DW_AT_name        : reflect.ptrDataGC	
    <26438>   DW_AT_byte_size   : 32	
 <2><26439>: Abbrev Number: 6 (DW_TAG_member)
    <2643a>   DW_AT_name        : width	
    <26440>   DW_AT_data_member_location: 0 byte block: 	()
    <26441>   DW_AT_type        : <0x24901>	
 <2><26449>: Abbrev Number: 6 (DW_TAG_member)
    <2644a>   DW_AT_name        : op	
    <2644d>   DW_AT_data_member_location: 3 byte block: 11 8 22 	(DW_OP_consts: 8; DW_OP_plus)
    <26451>   DW_AT_type        : <0x24901>	
 <2><26459>: Abbrev Number: 6 (DW_TAG_member)
    <2645a>   DW_AT_name        : off	
    <2645e>   DW_AT_data_member_location: 3 byte block: 11 10 22 	(DW_OP_consts: 16; DW_OP_plus)
    <26462>   DW_AT_type        : <0x24901>	
 <2><2646a>: Abbrev Number: 6 (DW_TAG_member)
    <2646b>   DW_AT_name        : end	
    <2646f>   DW_AT_data_member_location: 3 byte block: 11 18 22 	(DW_OP_consts: 24; DW_OP_plus)
    <26473>   DW_AT_type        : <0x24901>	
 <2><2647b>: Abbrev Number: 0
 <1><2647c>: Abbrev Number: 22 (DW_TAG_typedef)
    <2647d>   DW_AT_name        : reflect.ptrDataGC	
    <2648f>   DW_AT_type        : <0x26425>	
 <1><26497>: Abbrev Number: 12 (DW_TAG_array_type)
    <26498>   DW_AT_name        : [1]uint8	
    <264a1>   DW_AT_type        : <0x24a2c>	
    <264a9>   DW_AT_byte_size   : 1	
 <2><264aa>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <264ab>   DW_AT_type        : <0x24901>	
    <264b3>   DW_AT_upper_bound : 224	
 <2><264b4>: Abbrev Number: 0
 <1><264b5>: Abbrev Number: 21 (DW_TAG_structure_type)
    <264b6>   DW_AT_name        : struct { sync.RWMutex; m map[*reflect.rtype]*reflect.ptrType }	
    <264f5>   DW_AT_byte_size   : 32	
 <2><264f6>: Abbrev Number: 6 (DW_TAG_member)
    <264f7>   DW_AT_name        : sync.RWMutex	
    <26504>   DW_AT_data_member_location: 0 byte block: 	()
    <26505>   DW_AT_type        : <0x25d13>	
 <2><2650d>: Abbrev Number: 6 (DW_TAG_member)
    <2650e>   DW_AT_name        : m	
    <26510>   DW_AT_data_member_location: 3 byte block: 11 18 22 	(DW_OP_consts: 24; DW_OP_plus)
    <26514>   DW_AT_type        : <0x2651d>	
 <2><2651c>: Abbrev Number: 0
 <1><2651d>: Abbrev Number: 16 (DW_TAG_typedef)
    <2651e>   DW_AT_name        : map[*reflect.rtype]*reflect.ptrType	
    <26542>   DW_AT_type        : <0x2b84d>	
 <1><2654a>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <2654b>   DW_AT_name        : *reflect.ptrType	
    <2655c>   DW_AT_type        : <0x26564>	
 <1><26564>: Abbrev Number: 21 (DW_TAG_structure_type)
    <26565>   DW_AT_name        : reflect.ptrType	
    <26575>   DW_AT_byte_size   : 72	
 <2><26576>: Abbrev Number: 6 (DW_TAG_member)
    <26577>   DW_AT_name        : reflect.rtype	
    <26585>   DW_AT_data_member_location: 0 byte block: 	()
    <26586>   DW_AT_type        : <0x26066>	
 <2><2658e>: Abbrev Number: 6 (DW_TAG_member)
    <2658f>   DW_AT_name        : elem	
    <26594>   DW_AT_data_member_location: 4 byte block: 11 c0 0 22 	(DW_OP_consts: 64; DW_OP_plus)
    <26599>   DW_AT_type        : <0x25f4f>	
 <2><265a1>: Abbrev Number: 0
 <1><265a2>: Abbrev Number: 22 (DW_TAG_typedef)
    <265a3>   DW_AT_name        : reflect.ptrType	
    <265b3>   DW_AT_type        : <0x26564>	
 <1><265bb>: Abbrev Number: 21 (DW_TAG_structure_type)
    <265bc>   DW_AT_name        : reflect.fieldScan	
    <265ce>   DW_AT_byte_size   : 32	
 <2><265cf>: Abbrev Number: 6 (DW_TAG_member)
    <265d0>   DW_AT_name        : typ	
    <265d4>   DW_AT_data_member_location: 0 byte block: 	()
    <265d5>   DW_AT_type        : <0x2660c>	
 <2><265dd>: Abbrev Number: 6 (DW_TAG_member)
    <265de>   DW_AT_name        : index	
    <265e4>   DW_AT_data_member_location: 3 byte block: 11 8 22 	(DW_OP_consts: 8; DW_OP_plus)
    <265e8>   DW_AT_type        : <0x26761>	
 <2><265f0>: Abbrev Number: 0
 <1><265f1>: Abbrev Number: 22 (DW_TAG_typedef)
    <265f2>   DW_AT_name        : reflect.fieldScan	
    <26604>   DW_AT_type        : <0x265bb>	
 <1><2660c>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <2660d>   DW_AT_name        : *reflect.structType	
    <26621>   DW_AT_type        : <0x26629>	
 <1><26629>: Abbrev Number: 21 (DW_TAG_structure_type)
    <2662a>   DW_AT_name        : reflect.structType	
    <2663d>   DW_AT_byte_size   : 88	
 <2><2663e>: Abbrev Number: 6 (DW_TAG_member)
    <2663f>   DW_AT_name        : reflect.rtype	
    <2664d>   DW_AT_data_member_location: 0 byte block: 	()
    <2664e>   DW_AT_type        : <0x26066>	
 <2><26656>: Abbrev Number: 6 (DW_TAG_member)
    <26657>   DW_AT_name        : fields	
    <2665e>   DW_AT_data_member_location: 4 byte block: 11 c0 0 22 	(DW_OP_consts: 64; DW_OP_plus)
    <26663>   DW_AT_type        : <0x26688>	
 <2><2666b>: Abbrev Number: 0
 <1><2666c>: Abbrev Number: 22 (DW_TAG_typedef)
    <2666d>   DW_AT_name        : reflect.structType	
    <26680>   DW_AT_type        : <0x26629>	
 <1><26688>: Abbrev Number: 19 (DW_TAG_structure_type)
    <26689>   DW_AT_name        : []reflect.structField	
    <2669f>   DW_AT_byte_size   : 24	
 <2><266a0>: Abbrev Number: 6 (DW_TAG_member)
    <266a1>   DW_AT_name        : array	
    <266a7>   DW_AT_data_member_location: 0 byte block: 	()
    <266a8>   DW_AT_type        : <0x2a080>	
 <2><266b0>: Abbrev Number: 6 (DW_TAG_member)
    <266b1>   DW_AT_name        : len	
    <266b5>   DW_AT_data_member_location: 3 byte block: 11 8 22 	(DW_OP_consts: 8; DW_OP_plus)
    <266b9>   DW_AT_type        : <0x24f2b>	
 <2><266c1>: Abbrev Number: 6 (DW_TAG_member)
    <266c2>   DW_AT_name        : cap	
    <266c6>   DW_AT_data_member_location: 3 byte block: 11 10 22 	(DW_OP_consts: 16; DW_OP_plus)
    <266ca>   DW_AT_type        : <0x24f2b>	
 <2><266d2>: Abbrev Number: 0
 <1><266d3>: Abbrev Number: 21 (DW_TAG_structure_type)
    <266d4>   DW_AT_name        : reflect.structField	
    <266e8>   DW_AT_byte_size   : 40	
 <2><266e9>: Abbrev Number: 6 (DW_TAG_member)
    <266ea>   DW_AT_name        : name	
    <266ef>   DW_AT_data_member_location: 0 byte block: 	()
    <266f0>   DW_AT_type        : <0x24a35>	
 <2><266f8>: Abbrev Number: 6 (DW_TAG_member)
    <266f9>   DW_AT_name        : pkgPath	
    <26701>   DW_AT_data_member_location: 3 byte block: 11 8 22 	(DW_OP_consts: 8; DW_OP_plus)
    <26705>   DW_AT_type        : <0x24a35>	
 <2><2670d>: Abbrev Number: 6 (DW_TAG_member)
    <2670e>   DW_AT_name        : typ	
    <26712>   DW_AT_data_member_location: 3 byte block: 11 10 22 	(DW_OP_consts: 16; DW_OP_plus)
    <26716>   DW_AT_type        : <0x25f4f>	
 <2><2671e>: Abbrev Number: 6 (DW_TAG_member)
    <2671f>   DW_AT_name        : tag	
    <26723>   DW_AT_data_member_location: 3 byte block: 11 18 22 	(DW_OP_consts: 24; DW_OP_plus)
    <26727>   DW_AT_type        : <0x24a35>	
 <2><2672f>: Abbrev Number: 6 (DW_TAG_member)
    <26730>   DW_AT_name        : offset	
    <26737>   DW_AT_data_member_location: 3 byte block: 11 20 22 	(DW_OP_consts: 32; DW_OP_plus)
    <2673b>   DW_AT_type        : <0x24901>	
 <2><26743>: Abbrev Number: 0
 <1><26744>: Abbrev Number: 22 (DW_TAG_typedef)
    <26745>   DW_AT_name        : reflect.structField	
    <26759>   DW_AT_type        : <0x266d3>	
 <1><26761>: Abbrev Number: 19 (DW_TAG_structure_type)
    <26762>   DW_AT_name        : []int	
    <26768>   DW_AT_byte_size   : 24	
 <2><26769>: Abbrev Number: 6 (DW_TAG_member)
    <2676a>   DW_AT_name        : array	
    <26770>   DW_AT_data_member_location: 0 byte block: 	()
    <26771>   DW_AT_type        : <0x294b2>	
 <2><26779>: Abbrev Number: 6 (DW_TAG_member)
    <2677a>   DW_AT_name        : len	
    <2677e>   DW_AT_data_member_location: 3 byte block: 11 8 22 	(DW_OP_consts: 8; DW_OP_plus)
    <26782>   DW_AT_type        : <0x24f2b>	
 <2><2678a>: Abbrev Number: 6 (DW_TAG_member)
    <2678b>   DW_AT_name        : cap	
    <2678f>   DW_AT_data_member_location: 3 byte block: 11 10 22 	(DW_OP_consts: 16; DW_OP_plus)
    <26793>   DW_AT_type        : <0x24f2b>	
 <2><2679b>: Abbrev Number: 0
 <1><2679c>: Abbrev Number: 21 (DW_TAG_structure_type)
    <2679d>   DW_AT_name        : reflect.StructField	
    <267b1>   DW_AT_byte_size   : 104	
 <2><267b2>: Abbrev Number: 6 (DW_TAG_member)
    <267b3>   DW_AT_name        : Name	
    <267b8>   DW_AT_data_member_location: 0 byte block: 	()
    <267b9>   DW_AT_type        : <0x24a46>	
 <2><267c1>: Abbrev Number: 6 (DW_TAG_member)
    <267c2>   DW_AT_name        : PkgPath	
    <267ca>   DW_AT_data_member_location: 3 byte block: 11 10 22 	(DW_OP_consts: 16; DW_OP_plus)
    <267ce>   DW_AT_type        : <0x24a46>	
 <2><267d6>: Abbrev Number: 6 (DW_TAG_member)
    <267d7>   DW_AT_name        : Type	
    <267dc>   DW_AT_data_member_location: 3 byte block: 11 20 22 	(DW_OP_consts: 32; DW_OP_plus)
    <267e0>   DW_AT_type        : <0x26858>	
 <2><267e8>: Abbrev Number: 6 (DW_TAG_member)
    <267e9>   DW_AT_name        : Tag	
    <267ed>   DW_AT_data_member_location: 3 byte block: 11 30 22 	(DW_OP_consts: 48; DW_OP_plus)
    <267f1>   DW_AT_type        : <0x26885>	
 <2><267f9>: Abbrev Number: 6 (DW_TAG_member)
    <267fa>   DW_AT_name        : Offset	
    <26801>   DW_AT_data_member_location: 4 byte block: 11 c0 0 22 	(DW_OP_consts: 64; DW_OP_plus)
    <26806>   DW_AT_type        : <0x24901>	
 <2><2680e>: Abbrev Number: 6 (DW_TAG_member)
    <2680f>   DW_AT_name        : Index	
    <26815>   DW_AT_data_member_location: 4 byte block: 11 c8 0 22 	(DW_OP_consts: 72; DW_OP_plus)
    <2681a>   DW_AT_type        : <0x26761>	
 <2><26822>: Abbrev Number: 6 (DW_TAG_member)
    <26823>   DW_AT_name        : Anonymous	
    <2682d>   DW_AT_data_member_location: 4 byte block: 11 e0 0 22 	(DW_OP_consts: 96; DW_OP_plus)
    <26832>   DW_AT_type        : <0x255dd>	
 <2><2683a>: Abbrev Number: 0
 <1><2683b>: Abbrev Number: 22 (DW_TAG_typedef)
    <2683c>   DW_AT_name        : reflect.StructField	
    <26850>   DW_AT_type        : <0x2679c>	
 <1><26858>: Abbrev Number: 15 (DW_TAG_typedef)
    <26859>   DW_AT_name        : reflect.Type	
    <26866>   DW_AT_type        : <0x25674>	
 <2><2686e>: Abbrev Number: 0
 <1><2686f>: Abbrev Number: 22 (DW_TAG_typedef)
    <26870>   DW_AT_name        : reflect.Type	
    <2687d>   DW_AT_type        : <0x26858>	
 <1><26885>: Abbrev Number: 20 (DW_TAG_structure_type)
    <26886>   DW_AT_name        : reflect.StructTag	
    <26898>   DW_AT_byte_size   : 16	
 <2><26899>: Abbrev Number: 6 (DW_TAG_member)
    <2689a>   DW_AT_name        : str	
    <2689e>   DW_AT_data_member_location: 0 byte block: 	()
    <2689f>   DW_AT_type        : <0x250d2>	
 <2><268a7>: Abbrev Number: 6 (DW_TAG_member)
    <268a8>   DW_AT_name        : len	
    <268ac>   DW_AT_data_member_location: 3 byte block: 11 8 22 	(DW_OP_consts: 8; DW_OP_plus)
    <268b0>   DW_AT_type        : <0x255d4>	
 <2><268b8>: Abbrev Number: 0
 <1><268b9>: Abbrev Number: 21 (DW_TAG_structure_type)
    <268ba>   DW_AT_name        : struct { b bool; x interface {} }	
    <268dc>   DW_AT_byte_size   : 24	
 <2><268dd>: Abbrev Number: 6 (DW_TAG_member)
    <268de>   DW_AT_name        : b	
    <268e0>   DW_AT_data_member_location: 0 byte block: 	()
    <268e1>   DW_AT_type        : <0x255dd>	
 <2><268e9>: Abbrev Number: 6 (DW_TAG_member)
    <268ea>   DW_AT_name        : x	
    <268ec>   DW_AT_data_member_location: 3 byte block: 11 8 22 	(DW_OP_consts: 8; DW_OP_plus)
    <268f0>   DW_AT_type        : <0x25e42>	
 <2><268f8>: Abbrev Number: 0
 <1><268f9>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <268fa>   DW_AT_name        : *os.File	
    <26903>   DW_AT_type        : <0x2690b>	
 <1><2690b>: Abbrev Number: 21 (DW_TAG_structure_type)
    <2690c>   DW_AT_name        : os.File	
    <26914>   DW_AT_byte_size   : 8	
 <2><26915>: Abbrev Number: 6 (DW_TAG_member)
    <26916>   DW_AT_name        : *os.file	
    <2691f>   DW_AT_data_member_location: 0 byte block: 	()
    <26920>   DW_AT_type        : <0x2693a>	
 <2><26928>: Abbrev Number: 0
 <1><26929>: Abbrev Number: 22 (DW_TAG_typedef)
    <2692a>   DW_AT_name        : os.File	
    <26932>   DW_AT_type        : <0x2690b>	
 <1><2693a>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <2693b>   DW_AT_name        : *os.file	
    <26944>   DW_AT_type        : <0x2694c>	
 <1><2694c>: Abbrev Number: 21 (DW_TAG_structure_type)
    <2694d>   DW_AT_name        : os.file	
    <26955>   DW_AT_byte_size   : 40	
 <2><26956>: Abbrev Number: 6 (DW_TAG_member)
    <26957>   DW_AT_name        : fd	
    <2695a>   DW_AT_data_member_location: 0 byte block: 	()
    <2695b>   DW_AT_type        : <0x2572a>	
 <2><26963>: Abbrev Number: 6 (DW_TAG_member)
    <26964>   DW_AT_name        : name	
    <26969>   DW_AT_data_member_location: 3 byte block: 11 8 22 	(DW_OP_consts: 8; DW_OP_plus)
    <2696d>   DW_AT_type        : <0x24a46>	
 <2><26975>: Abbrev Number: 6 (DW_TAG_member)
    <26976>   DW_AT_name        : dirinfo	
    <2697e>   DW_AT_data_member_location: 3 byte block: 11 18 22 	(DW_OP_consts: 24; DW_OP_plus)
    <26982>   DW_AT_type        : <0x269b0>	
 <2><2698a>: Abbrev Number: 6 (DW_TAG_member)
    <2698b>   DW_AT_name        : nepipe	
    <26992>   DW_AT_data_member_location: 3 byte block: 11 20 22 	(DW_OP_consts: 32; DW_OP_plus)
    <26996>   DW_AT_type        : <0x2541d>	
 <2><2699e>: Abbrev Number: 0
 <1><2699f>: Abbrev Number: 22 (DW_TAG_typedef)
    <269a0>   DW_AT_name        : os.file	
    <269a8>   DW_AT_type        : <0x2694c>	
 <1><269b0>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <269b1>   DW_AT_name        : *os.dirInfo	
    <269bd>   DW_AT_type        : <0x269c5>	
 <1><269c5>: Abbrev Number: 21 (DW_TAG_structure_type)
    <269c6>   DW_AT_name        : os.dirInfo	
    <269d1>   DW_AT_byte_size   : 40	
 <2><269d2>: Abbrev Number: 6 (DW_TAG_member)
    <269d3>   DW_AT_name        : buf	
    <269d7>   DW_AT_data_member_location: 0 byte block: 	()
    <269d8>   DW_AT_type        : <0x25253>	
 <2><269e0>: Abbrev Number: 6 (DW_TAG_member)
    <269e1>   DW_AT_name        : nbuf	
    <269e6>   DW_AT_data_member_location: 3 byte block: 11 18 22 	(DW_OP_consts: 24; DW_OP_plus)
    <269ea>   DW_AT_type        : <0x2572a>	
 <2><269f2>: Abbrev Number: 6 (DW_TAG_member)
    <269f3>   DW_AT_name        : bufp	
    <269f8>   DW_AT_data_member_location: 3 byte block: 11 20 22 	(DW_OP_consts: 32; DW_OP_plus)
    <269fc>   DW_AT_type        : <0x2572a>	
 <2><26a04>: Abbrev Number: 0
 <1><26a05>: Abbrev Number: 22 (DW_TAG_typedef)
    <26a06>   DW_AT_name        : os.dirInfo	
    <26a11>   DW_AT_type        : <0x269c5>	
 <1><26a19>: Abbrev Number: 15 (DW_TAG_typedef)
    <26a1a>   DW_AT_name        : os.Signal	
    <26a24>   DW_AT_type        : <0x25674>	
 <2><26a2c>: Abbrev Number: 0
 <1><26a2d>: Abbrev Number: 22 (DW_TAG_typedef)
    <26a2e>   DW_AT_name        : os.Signal	
    <26a38>   DW_AT_type        : <0x26a19>	
 <1><26a40>: Abbrev Number: 14 (DW_TAG_subroutine_type)
    <26a41>   DW_AT_name        : func(error) bool	
 <2><26a52>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <26a53>   DW_AT_type        : <0x25634>	
 <2><26a5b>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <26a5c>   DW_AT_type        : <0x26a7f>	
 <2><26a64>: Abbrev Number: 0
 <1><26a65>: Abbrev Number: 22 (DW_TAG_typedef)
    <26a66>   DW_AT_name        : func(error) bool	
    <26a77>   DW_AT_type        : <0x26a40>	
 <1><26a7f>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <26a80>   DW_AT_name        : *bool	
    <26a86>   DW_AT_type        : <0x255dd>	
 <1><26a8e>: Abbrev Number: 14 (DW_TAG_subroutine_type)
    <26a8f>   DW_AT_name        : func(string) (os.FileInfo, error)	
 <2><26ab1>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <26ab2>   DW_AT_type        : <0x24a46>	
 <2><26aba>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <26abb>   DW_AT_type        : <0x26b23>	
 <2><26ac3>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <26ac4>   DW_AT_type        : <0x25b87>	
 <2><26acc>: Abbrev Number: 0
 <1><26acd>: Abbrev Number: 22 (DW_TAG_typedef)
    <26ace>   DW_AT_name        : func(string) (os.FileInfo, error)	
    <26af0>   DW_AT_type        : <0x26a8e>	
 <1><26af8>: Abbrev Number: 15 (DW_TAG_typedef)
    <26af9>   DW_AT_name        : os.FileInfo	
    <26b05>   DW_AT_type        : <0x25674>	
 <2><26b0d>: Abbrev Number: 0
 <1><26b0e>: Abbrev Number: 22 (DW_TAG_typedef)
    <26b0f>   DW_AT_name        : os.FileInfo	
    <26b1b>   DW_AT_type        : <0x26af8>	
 <1><26b23>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <26b24>   DW_AT_name        : *os.FileInfo	
    <26b31>   DW_AT_type        : <0x26af8>	
 <1><26b39>: Abbrev Number: 12 (DW_TAG_array_type)
    <26b3a>   DW_AT_name        : [60]uint16	
    <26b45>   DW_AT_type        : <0x26b59>	
    <26b4d>   DW_AT_byte_size   : 120	
 <2><26b4e>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <26b4f>   DW_AT_type        : <0x24901>	
    <26b57>   DW_AT_upper_bound : 192	
 <2><26b58>: Abbrev Number: 0
 <1><26b59>: Abbrev Number: 11 (DW_TAG_base_type)
    <26b5a>   DW_AT_name        : uint16	
    <26b61>   DW_AT_encoding    : 7	(unsigned)
    <26b62>   DW_AT_byte_size   : 2	
 <1><26b63>: Abbrev Number: 12 (DW_TAG_array_type)
    <26b64>   DW_AT_name        : [218]uint32	
    <26b70>   DW_AT_type        : <0x24a22>	
    <26b78>   DW_AT_byte_size   : 872	
 <2><26b7a>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <26b7b>   DW_AT_type        : <0x24901>	
    <26b83>   DW_AT_upper_bound : 32	
 <2><26b84>: Abbrev Number: 0
 <1><26b85>: Abbrev Number: 12 (DW_TAG_array_type)
    <26b86>   DW_AT_name        : [136]uint16	
    <26b92>   DW_AT_type        : <0x26b59>	
    <26b9a>   DW_AT_byte_size   : 272	
 <2><26b9c>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <26b9d>   DW_AT_type        : <0x24901>	
    <26ba5>   DW_AT_upper_bound : 192	
 <2><26ba6>: Abbrev Number: 0
 <1><26ba7>: Abbrev Number: 12 (DW_TAG_array_type)
    <26ba8>   DW_AT_name        : [470]uint16	
    <26bb4>   DW_AT_type        : <0x26b59>	
    <26bbc>   DW_AT_byte_size   : 940	
 <2><26bbe>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <26bbf>   DW_AT_type        : <0x24901>	
    <26bc7>   DW_AT_upper_bound : 192	
 <2><26bc8>: Abbrev Number: 0
 <1><26bc9>: Abbrev Number: 12 (DW_TAG_array_type)
    <26bca>   DW_AT_name        : [28]strconv.leftCheat	
    <26be0>   DW_AT_type        : <0x26bf5>	
    <26be8>   DW_AT_byte_size   : 672	
 <2><26bea>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <26beb>   DW_AT_type        : <0x24901>	
    <26bf3>   DW_AT_upper_bound : 192	
 <2><26bf4>: Abbrev Number: 0
 <1><26bf5>: Abbrev Number: 21 (DW_TAG_structure_type)
    <26bf6>   DW_AT_name        : strconv.leftCheat	
    <26c08>   DW_AT_byte_size   : 24	
 <2><26c09>: Abbrev Number: 6 (DW_TAG_member)
    <26c0a>   DW_AT_name        : delta	
    <26c10>   DW_AT_data_member_location: 0 byte block: 	()
    <26c11>   DW_AT_type        : <0x2572a>	
 <2><26c19>: Abbrev Number: 6 (DW_TAG_member)
    <26c1a>   DW_AT_name        : cutoff	
    <26c21>   DW_AT_data_member_location: 3 byte block: 11 8 22 	(DW_OP_consts: 8; DW_OP_plus)
    <26c25>   DW_AT_type        : <0x24a46>	
 <2><26c2d>: Abbrev Number: 0
 <1><26c2e>: Abbrev Number: 22 (DW_TAG_typedef)
    <26c2f>   DW_AT_name        : strconv.leftCheat	
    <26c41>   DW_AT_type        : <0x26bf5>	
 <1><26c49>: Abbrev Number: 12 (DW_TAG_array_type)
    <26c4a>   DW_AT_name        : [11]float32	
    <26c56>   DW_AT_type        : <0x26c6a>	
    <26c5e>   DW_AT_byte_size   : 44	
 <2><26c5f>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <26c60>   DW_AT_type        : <0x24901>	
    <26c68>   DW_AT_upper_bound : 64	
 <2><26c69>: Abbrev Number: 0
 <1><26c6a>: Abbrev Number: 11 (DW_TAG_base_type)
    <26c6b>   DW_AT_name        : float32	
    <26c73>   DW_AT_encoding    : 4	(float)
    <26c74>   DW_AT_byte_size   : 4	
 <1><26c75>: Abbrev Number: 12 (DW_TAG_array_type)
    <26c76>   DW_AT_name        : [23]float64	
    <26c82>   DW_AT_type        : <0x25519>	
    <26c8a>   DW_AT_byte_size   : 184	
 <2><26c8c>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <26c8d>   DW_AT_type        : <0x24901>	
    <26c95>   DW_AT_upper_bound : 160	
 <2><26c96>: Abbrev Number: 0
 <1><26c97>: Abbrev Number: 12 (DW_TAG_array_type)
    <26c98>   DW_AT_name        : [9]int	
    <26c9f>   DW_AT_type        : <0x2572a>	
    <26ca7>   DW_AT_byte_size   : 72	
 <2><26ca8>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <26ca9>   DW_AT_type        : <0x24901>	
    <26cb1>   DW_AT_upper_bound : 96	
 <2><26cb2>: Abbrev Number: 0
 <1><26cb3>: Abbrev Number: 19 (DW_TAG_structure_type)
    <26cb4>   DW_AT_name        : []uint16	
    <26cbd>   DW_AT_byte_size   : 24	
 <2><26cbe>: Abbrev Number: 6 (DW_TAG_member)
    <26cbf>   DW_AT_name        : array	
    <26cc5>   DW_AT_data_member_location: 0 byte block: 	()
    <26cc6>   DW_AT_type        : <0x294ef>	
 <2><26cce>: Abbrev Number: 6 (DW_TAG_member)
    <26ccf>   DW_AT_name        : len	
    <26cd3>   DW_AT_data_member_location: 3 byte block: 11 8 22 	(DW_OP_consts: 8; DW_OP_plus)
    <26cd7>   DW_AT_type        : <0x24f2b>	
 <2><26cdf>: Abbrev Number: 6 (DW_TAG_member)
    <26ce0>   DW_AT_name        : cap	
    <26ce4>   DW_AT_data_member_location: 3 byte block: 11 10 22 	(DW_OP_consts: 16; DW_OP_plus)
    <26ce8>   DW_AT_type        : <0x24f2b>	
 <2><26cf0>: Abbrev Number: 0
 <1><26cf1>: Abbrev Number: 19 (DW_TAG_structure_type)
    <26cf2>   DW_AT_name        : []uint32	
    <26cfb>   DW_AT_byte_size   : 24	
 <2><26cfc>: Abbrev Number: 6 (DW_TAG_member)
    <26cfd>   DW_AT_name        : array	
    <26d03>   DW_AT_data_member_location: 0 byte block: 	()
    <26d04>   DW_AT_type        : <0x29500>	
 <2><26d0c>: Abbrev Number: 6 (DW_TAG_member)
    <26d0d>   DW_AT_name        : len	
    <26d11>   DW_AT_data_member_location: 3 byte block: 11 8 22 	(DW_OP_consts: 8; DW_OP_plus)
    <26d15>   DW_AT_type        : <0x24f2b>	
 <2><26d1d>: Abbrev Number: 6 (DW_TAG_member)
    <26d1e>   DW_AT_name        : cap	
    <26d22>   DW_AT_data_member_location: 3 byte block: 11 10 22 	(DW_OP_consts: 16; DW_OP_plus)
    <26d26>   DW_AT_type        : <0x24f2b>	
 <2><26d2e>: Abbrev Number: 0
 <1><26d2f>: Abbrev Number: 12 (DW_TAG_array_type)
    <26d30>   DW_AT_name        : [37]uint	
    <26d39>   DW_AT_type        : <0x26d4e>	
    <26d41>   DW_AT_byte_size   : 296	
 <2><26d43>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <26d44>   DW_AT_type        : <0x24901>	
    <26d4c>   DW_AT_upper_bound : 96	
 <2><26d4d>: Abbrev Number: 0
 <1><26d4e>: Abbrev Number: 11 (DW_TAG_base_type)
    <26d4f>   DW_AT_name        : uint	
    <26d54>   DW_AT_encoding    : 7	(unsigned)
    <26d55>   DW_AT_byte_size   : 8	
 <1><26d56>: Abbrev Number: 21 (DW_TAG_structure_type)
    <26d57>   DW_AT_name        : strconv.decimalSlice	
    <26d6c>   DW_AT_byte_size   : 48	
 <2><26d6d>: Abbrev Number: 6 (DW_TAG_member)
    <26d6e>   DW_AT_name        : d	
    <26d70>   DW_AT_data_member_location: 0 byte block: 	()
    <26d71>   DW_AT_type        : <0x25253>	
 <2><26d79>: Abbrev Number: 6 (DW_TAG_member)
    <26d7a>   DW_AT_name        : nd	
    <26d7d>   DW_AT_data_member_location: 3 byte block: 11 18 22 	(DW_OP_consts: 24; DW_OP_plus)
    <26d81>   DW_AT_type        : <0x2572a>	
 <2><26d89>: Abbrev Number: 6 (DW_TAG_member)
    <26d8a>   DW_AT_name        : dp	
    <26d8d>   DW_AT_data_member_location: 3 byte block: 11 20 22 	(DW_OP_consts: 32; DW_OP_plus)
    <26d91>   DW_AT_type        : <0x2572a>	
 <2><26d99>: Abbrev Number: 6 (DW_TAG_member)
    <26d9a>   DW_AT_name        : neg	
    <26d9e>   DW_AT_data_member_location: 3 byte block: 11 28 22 	(DW_OP_consts: 40; DW_OP_plus)
    <26da2>   DW_AT_type        : <0x255dd>	
 <2><26daa>: Abbrev Number: 0
 <1><26dab>: Abbrev Number: 22 (DW_TAG_typedef)
    <26dac>   DW_AT_name        : strconv.decimalSlice	
    <26dc1>   DW_AT_type        : <0x26d56>	
 <1><26dc9>: Abbrev Number: 21 (DW_TAG_structure_type)
    <26dca>   DW_AT_name        : strconv.extFloat	
    <26ddb>   DW_AT_byte_size   : 24	
 <2><26ddc>: Abbrev Number: 6 (DW_TAG_member)
    <26ddd>   DW_AT_name        : mant	
    <26de2>   DW_AT_data_member_location: 0 byte block: 	()
    <26de3>   DW_AT_type        : <0x24f2b>	
 <2><26deb>: Abbrev Number: 6 (DW_TAG_member)
    <26dec>   DW_AT_name        : exp	
    <26df0>   DW_AT_data_member_location: 3 byte block: 11 8 22 	(DW_OP_consts: 8; DW_OP_plus)
    <26df4>   DW_AT_type        : <0x2572a>	
 <2><26dfc>: Abbrev Number: 6 (DW_TAG_member)
    <26dfd>   DW_AT_name        : neg	
    <26e01>   DW_AT_data_member_location: 3 byte block: 11 10 22 	(DW_OP_consts: 16; DW_OP_plus)
    <26e05>   DW_AT_type        : <0x255dd>	
 <2><26e0d>: Abbrev Number: 0
 <1><26e0e>: Abbrev Number: 22 (DW_TAG_typedef)
    <26e0f>   DW_AT_name        : strconv.extFloat	
    <26e20>   DW_AT_type        : <0x26dc9>	
 <1><26e28>: Abbrev Number: 12 (DW_TAG_array_type)
    <26e29>   DW_AT_name        : [8]strconv.extFloat	
    <26e3d>   DW_AT_type        : <0x26e0e>	
    <26e45>   DW_AT_byte_size   : 192	
 <2><26e47>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <26e48>   DW_AT_type        : <0x24901>	
    <26e50>   DW_AT_upper_bound : 96	
 <2><26e51>: Abbrev Number: 0
 <1><26e52>: Abbrev Number: 12 (DW_TAG_array_type)
    <26e53>   DW_AT_name        : [87]strconv.extFloat	
    <26e68>   DW_AT_type        : <0x26e0e>	
    <26e70>   DW_AT_byte_size   : 2088	
 <2><26e72>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <26e73>   DW_AT_type        : <0x24901>	
    <26e7b>   DW_AT_upper_bound : 96	
 <2><26e7c>: Abbrev Number: 0
 <1><26e7d>: Abbrev Number: 12 (DW_TAG_array_type)
    <26e7e>   DW_AT_name        : [20]uint64	
    <26e89>   DW_AT_type        : <0x24f2b>	
    <26e91>   DW_AT_byte_size   : 160	
 <2><26e93>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <26e94>   DW_AT_type        : <0x24901>	
    <26e9c>   DW_AT_upper_bound : 128	
 <2><26e9d>: Abbrev Number: 0
 <1><26e9e>: Abbrev Number: 19 (DW_TAG_structure_type)
    <26e9f>   DW_AT_name        : []strconv.leftCheat	
    <26eb3>   DW_AT_byte_size   : 24	
 <2><26eb4>: Abbrev Number: 6 (DW_TAG_member)
    <26eb5>   DW_AT_name        : array	
    <26ebb>   DW_AT_data_member_location: 0 byte block: 	()
    <26ebc>   DW_AT_type        : <0x297d6>	
 <2><26ec4>: Abbrev Number: 6 (DW_TAG_member)
    <26ec5>   DW_AT_name        : len	
    <26ec9>   DW_AT_data_member_location: 3 byte block: 11 8 22 	(DW_OP_consts: 8; DW_OP_plus)
    <26ecd>   DW_AT_type        : <0x24f2b>	
 <2><26ed5>: Abbrev Number: 6 (DW_TAG_member)
    <26ed6>   DW_AT_name        : cap	
    <26eda>   DW_AT_data_member_location: 3 byte block: 11 10 22 	(DW_OP_consts: 16; DW_OP_plus)
    <26ede>   DW_AT_type        : <0x24f2b>	
 <2><26ee6>: Abbrev Number: 0
 <1><26ee7>: Abbrev Number: 19 (DW_TAG_structure_type)
    <26ee8>   DW_AT_name        : []float32	
